{"selftext": "AITA if I don't attend my family's Thanksgiving dinner this year? I (32 F) am struggling to come to terms with the plans that my mother made for Thanksgiving this year. Usually, my dad cooks, there are about 8 people that attend and it's a great time. My dad passed away 6 months ago and this will now be our first holiday without him. The original plan was for it to be just my mom, sister and her fiancé, my aunt and grandmother. Somehow that ballooned into my mom inviting 15 people over. Here's my problem; our house is small, we barely can fit the 8 people we usually have. The other people that were invited (mainly my sister's fiancé's family) I don't know very well. Usually I wouldn't have an issue with them coming, but it being the first Thanksgiving without my dad I expect it to be pretty emotional and I'm not comfortable around these people. With that many attendees, there's nowhere to really go for a break if I need one. AITA if I make other plans and skip this dinner?", "post_id": "1olet63", "title": "AITA for not going to Thanksgiving?", "flair": "No A-holes here", "created_utc": 1761970454, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1olet63/aita_for_not_going_to_thanksgiving/", "downs": 0, "ups": 19, "score": 19}
{"selftext": "I (17M) live with my mom (48F) and brother (15M). Two days ago, my mom bought 2 large pizzas for dinner which I really like. However, my aunt (48F) came to our house at dinner time so my mom offered her some and she sat down. I was really annoyed because I like having left over pizza and now there was enough for dinner but not enough for me to have more tomorrow. I got cross and asked my mom why she didn’t get 3 pizzas since my aunt was there. My mom told me to be quiet and that she wasn’t expecting my aunt so that is why she didn’t order extra. I told my mom that she was wrong and that if my aunt was going to stay for dinner that my mom should order another pizza. My aunt then said that she wouldn’t have the pizza and put her plate away. However, this wasn’t the point and I told them so.   My mom said that she wasn’t going to order another pizza wait 20 minutes and go back out to pick it up while my aunt was visiting and that I was being rude. She also said that I embarrassed her in front of a guest and that there was enough for dinner so I shouldn’t have said anything.    I think that I am right and that everyone else is being rude. My mom just doesn’t want to admit that she is wrong and lazy. She is always picking on me. She says I’m the rude one.      AITA for saying there wasn't enough pizza and getting annoyed at my mom in front of my aunt and upsetting them both?", "post_id": "1oko7h3", "title": "AITA for telling my mom that she should have ordered more pizza.", "flair": "Asshole", "created_utc": 1761895799, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oko7h3/aita_for_telling_my_mom_that_she_should_have/", "downs": 0, "ups": 0, "score": 0}
{"selftext": "So this year for Christmas,  we're celebrating twice. My older sister recently got married, so is going to be spending Christmas day with her husband and his family, so it'll just be me (20M) and my parents this year. For the actual Christmas day, my mom is going to cook what she always has, and for the \"second Christmas\" the plan was to have my sister, her husband, and some people from his side of the family over, and to have a buffet style meal.  I've been trying to learn to cook. I couldn't go to college this year because of some health stuff, and I've been going out of my mind at home doing nothing, so I've been practicing some recipes whilst I have the free time. I'll be the first to admit that I'm no Gordon Ramsey, but I think I've gotten pretty good.  I was hoping to \"host\" the second Christmas. It would be a chance for me to share my food with more people, and now that I'm starting to feel better health-wise, I really want to put myself out there a little more. My plan was to make some of the dishes that I've practiced more (as well as some I'm planning to practice over the next month or so) and get the rest of the stuff pre-made or frozen or whatever (what my mom originally planned to do).  When I first asked my mom if I could do this, she kind of nodded and brushed it off like she usually does when I have some far fetched or stupidly ambitious idea. I pushed a little, and she said she thought it was a terrible idea. She said it was one thing to make the food for them in the house, but something completely different doing it for a whole bunch of people. She also said that I'm not the \"kind of person who would make a good host\"  This upset me. I kind of took it to mean that she didn't like the food I've been cooking, even though I've asked her for honest feedback every time and, barring some constructive criticism the first couple of times, this has been mostly good.  My mom then accused me of sulking, and said when I get my own place I can host all I want, but she doesn't want me hosting at their house. I got upset and went to my room, and my mom hasn't talked to me since, just a passing comment on the fact that I'm still sulking.  Edit for clarity: To be clear, my mom refuses to talk to me. I've tried to start conversations a few times about completely unrelated things and she totally ignored me.  My dad keeps telling me I have to apologise, but I'll be honest I don't know what I have to apologise for? I'd get it if I had yelled or something but I literally just asked if they didn't like my cooking and that's why my mom thinks I'm sulking.  Am I the asshole for wanting to host this Christmas?", "post_id": "1omsx27", "title": "AITA for wanting to \"host\" Christmas?", "flair": "No A-holes here", "created_utc": 1762117618, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1omsx27/aita_for_wanting_to_host_christmas/", "downs": 0, "ups": 19, "score": 19}
{"selftext": "I (35F) am currently 37 weeks pregnant and due for a planned C section at the end of the week (due to some complications with my baby). My husband’s (35M) parents are here to help with the newborn baby. Since they have come through, all that has happened is that I now have to cook for 4 instead of 2 and clean up after everyone. But these are not the major issues.  The issue is that they can’t stand the cold. It’s currently autumn where I am and going into winter. I warned them before they came that it will be cold. The house it’s heated to 20C but that doesn’t seem to be enough for them. And she complains about the cold at least 5 times a day. Now I have been running hot (probably because of the pregnancy) and 20C is borderline too much for me. I’m walking around in my summer clothes. I’ve asked them (and given them) extra layers to put on so they feel warmer, which until yesterday she refused to put on. Last night they visited some relatives (and I didn’t go, as I was feeling too tired) and she took the opportunity to complain to my husband about how cold she’s been feeling. So the moment he came home at night, he turned on the heater. I warned him that it would get too hot at night for me, but he said what else was he supposed to do, and kept the heater on. He turned it off before he slept but, it was so hot for me last night that I sweated through my clothes and bedclothes.   And it isn’t just this. When I said that we shouldn’t have outside visitors till the baby gets his vaccinations (because of his complications) and that no one should be allowed to kiss him on the face, he argued with me over it saying that if someone was sick they would let us know and only that person could be excluded. He did the same with me when I said that the midwives insisted that the baby should be sleeping in a room no warmer than 20C. He argued with me that the kids in the tropics sleep in warmer rooms. And when his mom randomly dropped in the middle of a casual conversation that she was going to be carrying out an old tradition for the baby on the 28th day, he didn’t even object and just accepted it. Now we had discussed this particular tradition previously, and he was totally against it then. But when his mom brought it up, he said that if she does it, it won’t hurt anybody and it’ll make her happy, which is true, but I said that if we don’t set any boundaries in the beginning then more and more of these “traditions“ will crop up. What pisses me off about the things like the visitors is that I’m only saying it to protect the baby, and it could actually harm the baby and he still argues with me about it. He says it’s just a discussion but to me it feels like he thinks I’m being irrational and paranoid.   I told him that I don’t feel like he’s on my team and I’m being forced to do all the adjusting while he looks after his parents comfort. He says I should just adjust for a while till they can adjust to being here. Am I overreacting here? AITA?  Edit 1: My husband has been generally supportive throughout my pregnancy and the complications we’ve had with the baby. His parents are nice people and I generally like them. They’ve travelled halfway across the world to be here and can’t be told to go back just like that.  He’s trying to keep the peace but all compromises seem to be falling on me.  Edit 2: Usually it would have been my folks who came to help but my mum passed away a couple of years ago, and my sister will be here in February to help out.", "post_id": "1olk6e4", "title": "AITA for demanding that my husband pick my needs over his parents and let them feel cold for a bit.", "flair": "Not the A-hole", "created_utc": 1761991770, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1olk6e4/aita_for_demanding_that_my_husband_pick_my_needs/", "downs": 0, "ups": 7215, "score": 7215}
{"selftext": "I (25F) made biryani a few times for my mom’s boyfriend while I was staying with her while I was 20. My moms a vegetarian so she didn’t know how to make it and I was just learning cooking, so I made it a few times, it didn’t turn out great the first time but then I made the best one I’ve ever made. She didn’t eat it and just claimed it doesn’t even look good. Then I went back to college and didn’t visit her anymore, a couple years later I went to her house and she brags about how she makes the best biryani and how it’s so much better than mine. I didn’t say anything then and she also made sure to never make it when I was in town. But every time I visited her she’d brag about her biryani being the best and so much better than mine. I only thought that damn why does my mom not appreciate that I actually know how to make biryani instead of competing with me? Anyway her boyfriend visits one day and mom asks me to make something, I was just going to make chicken curry so I marinated the chicken and went out to get other things, I come back home to see my mom took all the marinated chicken and made biryani saying that she doesn’t trust that I could make good biryani when I wasn’t even trying to make biryani. I just didn’t say a word, didn’t eat and haven’t cooked for her boyfriend ever since. She keeps inviting him over and asking me to make something for him but I just find an excuse or something else comes up. I know he didn’t do anything, he actually appreciated my food but I just don’t wanna go through the crap my mom puts me through to cook. So AITA for not cooking for my mom’s boyfriend anymore?  Edit: I usually stay with my dad in the same city, but due to some major conflicts I have to stay with my mom more often. I’ve tried talking to her but the cooking competition is only the tip of the iceberg. ATP I’m a gifted chef and make the craziest things but I don’t enjoy when people demand that I cook for them. My mom’s boyfriend doesn’t live with her, just my brother. I don’t even have my own room here so I’m barely here but whenever I am, she calls her boyfriend and demands that I cook for him but he only comes on weekends and I’m almost never here on weekends. (For the real TEA I can reply to whoever wants it)", "post_id": "1oo5rya", "title": "AITA for not cooking for my mom’s boyfriend anymore?", "flair": "Not the A-hole", "created_utc": 1762258646, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oo5rya/aita_for_not_cooking_for_my_moms_boyfriend_anymore/", "downs": 0, "ups": 110, "score": 110}
