{"selftext": "My mother wants to move in with my husband and I. We are both 28. My mom has helped us out when we struggled and I know she loves me, but she is extremely narcissistic. She makes everything about her, can’t take criticism, and says the MEANEST things when she gets her feelings hurt (which happens a lot). We had planned to buy a house and move her in but I stayed with her for a week and we got into a huge fight and I realized, I can’t live with her again. I was miserable as a kid and it’s bringing up all the past trauma. My dad passed away in 2020 and my mom is disabled living with my grandma currently who is getting quite old (late 80s). My mom does not have a lot of money and has a lot of health issues, so this is where I feel guilty. My husband says she manipulates me and makes me feel like it’s my fault. She’s extremely mad now that I’ve told her I don’t think we can live together and says I’m a terrible daughter and don’t love her. I’m between feeling like a terrible person who is leaving her to fend for herself and knowing that she is narcissistic and it would be bad for my marriage and mental health. AITA??   EDIT: I didn’t give all the details in my initial post. We are not in a position to pay for housing for my mother. My husband and I were working to sell our house to move my grandma and mother (early 60s and has an autoimmune disease but can still take care of herself). She also has deep paranoia issues that she refuses to believe are an issue and will not seek help. They were helping us out to sell and then we were all going to live together to make it easier on my grandma and because my mom has always said she’d have to move in with me someday. When I went to stay with them while my husband was finishing up the house I realized that I couldn’t do it, as my mom was starting arguments frequently. My grandma also seemed as though she might have a hard time with leaving her home and the town she has lived in for 60 years. My husband and I made the decision and I told my mom those two reasons. She has said I made a little fight into nothing and used the both of them and flipped their life upside down. (Mind you they hadn’t done much at their house aside from pack a couple boxes in the basement). My grandma agreed that it sounds like we couldn’t get along and is fine with the decision but my mom is basically saying since I won’t give her my whole self then she doesn’t want just half of me and this will end our relationship. I’m already moved back into our house and will be paying them back the money they helped out with through the next 3 months. I just feel so upset that it ended this way and can’t help but feel guilty.", "post_id": "1oh6uze", "title": "AITA, Mother wants to move in", "flair": "Not the A-hole", "created_utc": 1761544997, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oh6uze/aita_mother_wants_to_move_in/", "downs": 0, "ups": 193, "score": 193}
{"selftext": "A little back story, my mom lives with my grandparents, I grew up in the household after my parents got divorced when I was 9. Before my parents got divorced, we lived in a different country  (because my dad's side of the family was there). When my parents got divorced, we moved to the USA with my mom’s side of the family. My grandfather had always hated my dad, so he never came around. When we moved to the USA, it was my first time meeting him. He was verbally abusive, and every day he picked an argument with me or my siblings. I think he hates us because he never acted like that with my cousins (one of my cousins lived there with my aunt, and she was his favorite grandchild). Because of the constant arguing, I was tired of being put down, so when I turned 18(2020), I moved out to a room. I've been trying to convince my mom to move out into an apartment with me because I want to live with her and my siblings, but also for the sake of my siblings. My mom never defended us, we were always told that that's just how he is and to just do what he wants. But even then, he would always find something wrong with us.   In April of this year, I moved into an apartment my mom found, and she was supposed to move in by the end of May. Every week she tells me she is moving in, but she never moves. She had 2 of my brothers move in, one is a minor. She would buy him a few noodle soups, a box of cereal, but no real food or any other essentials such as toilet paper, toothpaste, deodorant, etc. They don't clean, and I have to clean up after them( I let them know multiple times that everyone has to clean up after themselves, but they don't listen). They also smoke in the house despite me asking them not to( I don't care if they smoke, just not in the house). I told her multiple times how much I dislike this, and that she needs to move in to control her kids( I think she had them move in with me because she can't control them, but I don’t want to take all this responsibility).  It's now October, and she still hasn't moved in. I got tired of talking to her about these issues. I went over and told my grandmother and aunt about how she should have moved out months ago, how she barely buys them food, how they smoke in the house, and I don't like it. Now the entire family knows what’s going on. My grandmother says that she wants my mom to move out. I don't talk to my grandfather but I know how much he doesn't like my siblings, so I know that he wants them to move out. Now my mom is calling me asking me why I told my grandmother and aunt all this. I told her that I'm tired and I needed to talk to someone. She tells me that I should’ve talked to her, but every time I talk to her, she doesn't do anything so I feel like there is no point in talking to her.   AITA for sharing this information with her family?  UPDATE: Thank you, everyone for your responses. I see her for who she is now. I was just feeling guilty. I’m looking into therapy. For everyone commenting about CPS, she already has a case with them. Her excuse for not moving is that she is working too much, and I should try to save face when it comes to family matters. I told my siblings that if they don’t stop smoking in the house and start cleaning up, they would have to go back to my grandfather's house. I’m also talking to my landlord about changing the lease to just me, if not I'm moving out when the lease is up.", "post_id": "1ogwlub", "title": "AITA for telling my mom’s family she refuses to take care of her own kids?", "flair": "Not the A-hole", "created_utc": 1761514333, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ogwlub/aita_for_telling_my_moms_family_she_refuses_to/", "downs": 0, "ups": 773, "score": 773}
{"selftext": "My name is mark , 26 years old , I finally got my own apartment last year after saving for years. It’s a small one-bedroom place, nothing fancy, but it’s mine and it’s the first time I’ve ever really had privacy. My mom , she is 52 years old recently broke up with her boyfriend and had to move out of his house. She called me crying, saying she didn’t have anywhere to go and asked if she could stay for a few weeks. Of course, I said yes, she’s my mom. But it’s been four months. She hasn’t looked for a new place, doesn’t help with groceries, and has started treating my apartment like it’s hers. She rearranged my furniture, keeps commenting on my food choices, and even tried to throw away some of my stuff because it looked old. I’ve gently brought it up a few times, but every time I do, she gets emotional and says things like, “Wow, after all I did for you, now you’re kicking me out?” or “You’d let your own mother be homeless?” Last week, she invited two of her friends over while I was at work without even asking. I came home to people sitting on my couch drinking wine. That’s when I told her we needed to set a deadline for her to move out. She cried and said I’ve changed and that she can’t believe how cold I’ve become. My sister thinks I’m being heartless, but she lives two hours away and isn’t offering to take Mom in either. I love my mom, but I just can’t live like this anymore. I’m starting to feel like a guest in my own home. AITA for asking my mom to move out even though she says she has nowhere to go?", "post_id": "1ongyz7", "title": "AITA for refusing to let my mom move in with me even though she says she has nowhere else to go?", "flair": "Not the A-hole", "created_utc": 1762188633, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ongyz7/aita_for_refusing_to_let_my_mom_move_in_with_me/", "downs": 0, "ups": 2895, "score": 2895}
{"selftext": "I 24F Halle have always been close to my mom. My parents divorced when I was 12, and she basically held everything together while my dad didn’t. I’ve always admired her strength and I genuinely want her to be happy. about 8 months ago, she started dating a guy named Rick at first I was happy for her. She’s spent most of her life taking care of me and my siblings and hasn’t really dated seriously since the divorce. But the more time I’ve spent around Rick, the more uneasy I’ve become he’s not outright mean, but he has this constant dismissive tone especially toward my mom. He cuts her off midsentence, makes comments about her overreacting whenever she expresses her feelings, and has made jokes about her weight and age. Every time I politely try to redirect or stand up for her, she waves me off and says, He’s just teasing, don’t make it a big deal. A few weeks ago, I came home to visit and Rick was there my mom and I were catching up and she mentioned wanting to start a small baking business. She’s insanely talented and it’s always been her dream Rick laughed and said. You’re adorable but be realistic nobody’s buying cookies on Facebook from a middle-aged woman. I told him that was rude and unnecessary my mom got quiet and later pulled me aside saying I was making the situation uncomfortable. I told her I just don’t like seeing someone talk down to her. Last night on a call, she asked if I’d join them for dinner this weekend to get to know him better I told her honestly that I don’t feel comfortable being around him right now, and that I don’t want to force a relationship with someone who seems to belittle her constantly. She got upset and said I was judging her happiness and trying to control her life like my dad used to. That hurt I told her I love her, but I won’t sit and smile around someone who treats her like she’s beneath him. I also made it clear I’m not asking her to leave him  I just need space. She hung up on me, and my sister texted saying Mom cried afterward and that I’m being dramatic and should just let Mom have someone. I feel awful. I don’t want to be the reason she’s hurt, but I also can’t watch someone slowly chip away at her confidence. So AITA for telling my mom I don’t want to be involved with her relationship?", "post_id": "1on7aan", "title": "AITA for telling my mom I don’t want to be involved with her new relationship?", "flair": "Not the A-hole", "created_utc": 1762161992, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1on7aan/aita_for_telling_my_mom_i_dont_want_to_be/", "downs": 0, "ups": 590, "score": 590}
{"selftext": "My twin brother (29M) and I moved abroad a few years ago with help from our parents. The plan was to build a new life, work hard, and make them proud. I went with my wife (29F), and my brother had a GF of few months that he left behind.  From the start, wife and I carried most of the weight. I found work first, managed our housing, and handled paperwork. My brother spent recklessly, barely helped, and constantly got sympathy from my parents. When we ran into financial trouble, I found out he had spent most of our shared savings, and couldn’t even say on what. Around that time, he admitted he never wanted to move abroad and only did it because it was “expected.”  When he finally decided to move back home, my mom paid for his ticket. I thought that would bring peace, but it just deepened the divide. My parents brushed off everything that had happened, made excuses for him, and implied I was overreacting.  In 2024, he came back to this country, cocky because he had a job. My parents called me constantly, pushing me to let him live with me “until he gets settled.” I refused. I didn’t want to reopen old wounds or live with someone who had betrayed my trust.  Then this year (2025), my parents and relatives visited. It was tense. No matter how polite I was, hosting them, keeping the house warm, never saying no, I was still treated like the disappointing son. My father even called me stingy in my own home. It made something click: nothing I do will ever be enough for them, especially when my brother can do no wrong.  Yesterday, they called again with “good news,” a big family vacation next year for my grandmother’s 90th birthday. Everyone’s supposedly going, and they just assumed I’d join, no one asked about costs or time off work. When I said I wasn’t sure I could afford it, they guilt-tripped me immediately: “It’s your grandma’s big birthday! How can you not be excited? Everyone will be there except you?”  I love my grandmother, but the thought of spending money and time to fly somewhere just to be belittled again makes me feel sick. I’m tired of being the responsible one who gets treated like the failure.  So, AITA for not being excited, or possibly refusing, to go on this family trip?  Edit: Thank you, everyone, for your warm comments. I missed an inportant detail for all of you. My grandmother lives in another continent with ny parents. So, to visit her means an expensive trip to be with my parents.", "post_id": "1ohq94e", "title": "AITA for not wanting to join my family on a trip for my grandmother’s 90th birthday?", "flair": "Not the A-hole", "created_utc": 1761598459, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ohq94e/aita_for_not_wanting_to_join_my_family_on_a_trip/", "downs": 0, "ups": 421, "score": 421}
