[
  {
    "post_id": "1odtjvy",
    "title": "AITA for not really caring all that much that my mom sent my aunt an angry text on my behalf?",
    "selftext": "Hi, On Father's Day of this year,  my aunt and uncle had my dad [70] and I [30M] over for food and such. During this gathering, I gave my dad a $25 gift card to Lowe's for Father's Day. I was self conscious about this gift as it wasn't much money and I could conceivably afford more, but I had already spent a lot of money that weekend on gifts for a couple other people and this was what I decided was right for me at the time. And frankly, he wasn't a very good father, so he should have been happy he got anything. There isn't a card in the store I could buy him and mean it. Too much has happened. Taylor Tomlinson has a good bit that conveys my exact feelings.  Soon after I gave it to him, he starts making fun of it, saying that he spent like $80 on the food he brought. My aunt chimed in condescendingly, \"what can you buy with $25, [my name]?\" I sat there and took it, trying to let it go. The rest of the gathering passed without incident.   As I drove home, I got more and more angry. This was a PERFECT example of why I don't like my father. It exemplified so many things. I was staying with my mom at the time, and when I got home she could tell I was upset. I eventually told her what happened, including that my aunt had chimed in. I broke down and texted my dad and called him a fucking asshole. My mom has seen my struggles with my father and she was even more mad than I was. She eventually said she was going to text my aunt and give her a piece of her mind. I knew this would only make things worse, but 30 years of rage was boiling over in me and I was too pissed off to care. She texted my aunt \"You have highly disappointed me that you belittled [my name] with the gift he gave his father.\" She said my aunt would do the same thing if my mom had insulted one of her kids. My adult sister agreed. I also tend to agree.  The following afternoon I got a text from my aunt saying that she was sorry and she thought we were just joking around. I accepted her apology and told her she and I were fine but my father and I have ceased getting along.   Soon after I sent my father a letter addressing what my therapist and I consider to be years of psychological abuse from him, telling him that my relationship with him will not move forward until he reads it.   Things have been pretty cold with my aunt and uncle since all this happened. I saw them for the second time since Father's Day at a family party (my dad wasn't there) and my uncle called me out for going and crying to my mommy about what his wife said. I retorted that I didn't ask my mom to do that, but I don't really blame her for doing it. He said it was an overreaction and that we had all been drinking and that I was out of line. AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761192213.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odtjvy/aita_for_not_really_caring_all_that_much_that_my/",
    "downs": 0,
    "ups": 38,
    "score": 38
  },
  {
    "post_id": "1odtj1x",
    "title": "AITA for not asking my BIL first?",
    "selftext": "I don’t have kids so I wanted to gauge how I turn out in this story. I have a nephew that is 2yo and 2 days ago was the first time I was asked by my sister to babysit. (I had been asking to babysit since he was born). I was super excited and moved my work schedule so I could do it. Note: when anyone is asked to babysit, her Husband is always home. He works at home and they have someone babysit so he can focus on working.  The babysitting was for a couple hours in the morning, everything seemed to go well. I had checked with my sister beforehand to ask if I could take my nephew to the park a half block away. Her husband said to just let him know when I was taking him. I did. I was also asked to babysit yesterday, again everything went fine. Fast forward to today, I was asked to babysit again. (My BIL was home) I texted him to let him know I was taking my nephew for a walk.   So this is where AITA comes in. He called me a couple minutes later asking where I was at, clearly angry. He said they really prefer if people ask permission before taking their son anywhere because “you just freak out if your kid is gone”. I said I could definitely bring him back no problem. He said no it’s fine, I’m just saying. (Annoyed/angry the whole time) When I got back he didn’t come upstairs through the whole time even up to when I left their house. I also told my sister about the situation and she said its better if I phrase things as a question.. Again I don’t think I’m in the wrong because I did text beforehand and the park is literally just a half block away in an enclosed neighborhood. But I also don’t have kids so I don’t know if it’s normal? AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761192132.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odtj1x/aita_for_not_asking_my_bil_first/",
    "downs": 0,
    "ups": 11,
    "score": 11
  },
  {
    "post_id": "1odsh8m",
    "title": "AITA for not wearing pants when guests are over?",
    "selftext": "I want to start by saying this isn't a serious argument between me (32F) and my boyfriend (33M). It's something we were laughing about, but something he also genuinely believes, and he pushed me to make the post because he thinks he's right and that people will agree with him. Lol.   Right now, I'm wearing what you could say are \"booty shorts\" and a t-shirt. My dad's friend is over to do some work on my house. My boyfriend asks why I am wearing shorts and not pants, that we're clearly different people because he would wear pants if he had guests over. I said, what I'm wearing is normal, this is normal. He disagrees. So, AITA for not wearing pants when other people visit?",
    "flair": "No A-holes here",
    "created_utc": 1761188795.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odsh8m/aita_for_not_wearing_pants_when_guests_are_over/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odsch2",
    "title": "AITA because I don't text a lot ???",
    "selftext": "So my friend of 10 years has stopped talking to me at the moment and I need to know if it's mainly my fault. She's always been abit awkward with me- for example got annoyed when I wouldn't lend her money for dr*gs etc.   Anyway-I've suffered with bad depression and struggle to leave the house the last year since my dad died- something I'm working on gradually though to get to my old self!   My texting isn't great at all as I don't focus on being on my phone I try to occupy myself with other things so the last few months I haven't been great at texting.  My friend and I haven't spoken loads the last few months but I'll message her every few days and say hi how are you, just to make sure she's okay.  A few weeks ago I sent her a few messages trying to make conversation and she ignored me. A few days later I sent her a photo of my newborn niece to which she ignored. Then yesterday I messaged her to say hey is everything okay and she responded saying that she doesn't see the point in messaging me anymore because all I do is ask how she is and then she won't hear from me till the day after/2 days later.  Personally I don't see an issue with talking every few days but I want to understand where she's coming from also. She told me I don't leave the house to see her or try to talk to her properly so what's the point in trying.  Personally I think this is inconsiderate as she knows I've been struggling- but then am I not seeing things from her point of view ? I told her I don't see an issue with texting every few days to see how she is but she told me that it's draining trying to explain why it annoys her- so what now🙃",
    "flair": "No A-holes here",
    "created_utc": 1761188396.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odsch2/aita_because_i_dont_text_a_lot/",
    "downs": 0,
    "ups": 2,
    "score": 2
  },
  {
    "post_id": "1ods0of",
    "title": "AITA for telling my in laws to not pick on my wife?",
    "selftext": "My wife (25f) and me (27m) are trying to make plans for the holidays and this year, my wife wants to do Christmas with her family.   Wife’s family are not very nice to her. They pick on her a lot. Like backhanded comments that are supposed to be jokes. Particularly her brothers, but occasionally her dad too.   So I texted her mom (52f), dad (51m), and brothers (22m, 28m, 30m) without telling her and said that we are excited to be with them for Christmas, but asked them to please keep their snarky comments to themselves. I told them that the comments calling her immature, dumb, and annoying are unnecessary and rude and they really hurt her feelings. Her dad responded that my wife has always been a bit sensitive and this is just the way things are with siblings.This got back to my wife because her mom sent her screenshots of the text messages and she said to please don’t create anymore drama during the holidays.  Here’s my justification for this text:  \\- She got a porch goose for Christmas which she asked for and she was really excited and telling all the clothes she wanted to make for it. Her brother rolled his eyes and said she was immature. Then she got really embarrassed and just seemed sad. This happened several more times when she was opening gifts. When I asked her to show me some of the patterns for the clothes she was going to make the porch goose later, she just got embarrassed again and said she didn’t want to talk about it. (I would like to point out that she is a full time nanny and housekeeper to 3 kids so even if it were immature, she has an excuse.)  \\- Sometimes her brothers will just randomly call her dumb. Like at her family’s 4th of July get together, she and one of her brothers were going back and forth about roundabouts and he just shut down the conversation by saying he doesn’t argue with people who didn’t go to college and she said almost nothing the rest of the night, even after we got home.  \\- My wife lost a good deal of weight a few years back, but her family is constantly commenting on her food choices and how much or little she eats and few months to “keep her on track” they remind her that most people who lose weight gain it all back.  In spite of all this, most of the time her family is pleasant to be around but it’s like they just can’t help themselves and need to make these digs at her. When I try to or she tries to say, don’t say that, it’s always “just a joke” or “you’re reading too much into it.” It’s just hard for me to see this happen. When I try to bring it up to her, she closes down or says that it’s just how her family is.  I just don’t want to spend another holiday  watching her try to brush it off.   Now according to my wife, my MIL, FIL, and BILs are all mad at me and according to them I have already ruined Christmas in October. Maybe I should have left this up to my wife but I know she wouldn’t do it.  AITA for telling my in laws to not pick on my wife?",
    "flair": "Not the A-hole",
    "created_utc": 1761187428.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ods0of/aita_for_telling_my_in_laws_to_not_pick_on_my_wife/",
    "downs": 0,
    "ups": 1619,
    "score": 1619
  },
  {
    "post_id": "1ods00a",
    "title": "AITA for wanting to split living costs with BF instead of paying market rent to him?",
    "selftext": "Me (51F) and my BF (51M) of 4 yrs are planning to move in together. We are both divorced, and we both own a home. My kids are in college, and his are in high school, so the plan is for me to sell my house and move into his house with him and his boys (16M and 14M) who live approx. 80% of the time with him.  We don't plan to get married, and his house will continue to be owned solely by him.  Moving into his house (vs. mine) is less disruptive to the boys, and provides a shorter commute for both of us.  I offered to pay half of all living costs (utilities, property tax and insurance), but on his mortgage I suggested only paying half of the amount of the interest payment, and none of the amount attributable to principal.  My thinking is that the portion of the mortgage payment that goes to principal increases the equity he owns in the house, and only he benefits from it since my name will not be on title.  He agrees to splitting utilities, but instead of me paying half of other costs, my payment would be based on market rent rates.  His mortgage does have a low interest rate, and he feels I should not benefit from him having a low interest rate.  I feel like we are moving in as a couple, and even though we are not married, as a couple we should more or less split things.  For additional context, we both earn a good living with 6 figures, with me earning slightly more. He is more frugal overall, and I spend more on other stuff as I am more likely to buy more expensive wine, foodie items, etc. (and that has been the case during our relationship overall).  We both earned significantly more than our ex-spouses did, but he probably has more trauma from alimony etc. payments to his ex from the divorce.  Our finances are, and would remain, separate.  I don't feel right about paying more than he does.  With his math, I would pay about 55% of living costs (if I agree to pay also half of his principal/equity mortgage payment portion), or about 78% of true living costs (if we exclude his mortgage principal payment).  So, AITA for only wanting to pay true half of living costs, without contributing to the equity/principal portion of his mortgage payment?  \\*\\*\\*Adding couple clarifications.     \\---If I sell my house, I would cash out on the equity I have and could reinvest that (in the stock market, investment property or something else).  Should this not work out I could also use that to buy another place for myself.     \\---We are planning on a cohabitation agreement.    \\---We live in California so common law rules do not apply.    \\---The market rent he suggests is about half less than what one would pay to rent a full house, but also about half more than what rent for room only would be.  We would both save in monthly costs moving in, and my point is more on the principle of splitting costs evenly (minus the mortgage equity portion).",
    "flair": "Not the A-hole",
    "created_utc": 1761187372.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ods00a/aita_for_wanting_to_split_living_costs_with_bf/",
    "downs": 0,
    "ups": 1047,
    "score": 1047
  },
  {
    "post_id": "1odr3g1",
    "title": "AITA for talking behind my coach's back while she was near?",
    "selftext": "During the school season, I was in a soccer club team with all of my best friends. We've been on this team since last year, with the same coaches and teammates. Throughout the season, our one coach Rebecca has been kind of off from the start with me specifically. Flashback to a year ago, I tried out for a higher club division in the summer and I ended up not making it despite having similar athleticism, skill, and positivity as others who made it - Rebecca was coaching that team that year. It obviously was devastating since soccer means a lot to me and I really wanted to make that team but this didn't mean I was putting others who made it down or talking negatively in any sort about the people involved in the situation.   So when this year's season started, I already had let go of the summer and what had happened, and was playing with a good mindset and positivity. I was cheering others on the best I could, being polite to all coaches including Rebecca, and pushing myself at every practice and tournament. However, I could already sense Rebecca didn't really like me as much as the other people on my team or that something was off but I didn't understand why because I've never done anything to her that past year (turns out I was right). My coach also tends to be on the harsher side and visibly had favourites last year and they aren't on the team this year. Another issue we had this season was the fact that there was a mix-up about who captains were. Long-story short, it was originally me, and my other friend but it got switched arbitrarily to other people, as coaches don't really care about who captains are as long as there are three. That also caused a bit of drama which will be relevant later on.   One tournament day, all four of us \"captains\" were going to go talk to the other team's captains but Rebecca gave a bit of a dismissive opinion that only two of us should go. I understand more than two captains is a bit absurd, but I felt like I couldn't have a say in who should go and what. After the game, I went to my friends and shared how I felt about how Rebecca worded things and how it felt a bit harsh and unnecessary. I wasn't aware that Rebecca overheard our conversation and next practice it became a rule that no captains were allowed anymore. I talked to the coaches about it and their reasoning made sense but I felt that there was no value in doing that because it just made team tension worse. One other coach fully understood how me and my friends felt, and agreed that it might have been overboard. AITA for how things turned out? AITA for just stating my opinion on something with my close friends?",
    "flair": "Not the A-hole",
    "created_utc": 1761184690.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odr3g1/aita_for_talking_behind_my_coachs_back_while_she/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odr2d2",
    "title": "AITA for telling off my coworkers?",
    "selftext": "So I‘m not in the habit of lecturing people on their manners or whatever. I’m not exactly great with social cues myself (part of the reason for this post), and I’m not confrontational at all, so even if something feels weird I tend to just shrug it off. But this caught me off guard!  I was at lunch with a few coworkers (all 30s, various genders). I don’t even remember what we were talking about in particular, just work-related chat. There were 5 of us, all having one conversation at one table. One guy was saying something, but then he paused, and instead of continuing out loud, he leaned over to his friend and whispered something behind his hand into her ear. They started giggling, she whispered behind her hand back to him, they giggled some more.  It felt really awkward. The rest of the table went silent because they’d stalled the conversation. We are all adults, and I’m pretty sure I haven’t seen anyone do that kind of thing since high school.  So I tried to joke about it by saying something along the lines of “don’t whisper behind your hands! what are you saying about me?” They got defensive, and said not to worry about it and it wasn’t my business.  I didn’t actually think they were talking about me. But I thought whispering like that was considered very childish and rude to the other people present? Then again, like I said I’m not great with social cues, so maybe this is a prissy complaint on my part? Should I have just turned to my other coworkers and moved on while they did their thing? AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761184600.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odr2d2/aita_for_telling_off_my_coworkers/",
    "downs": 0,
    "ups": 14,
    "score": 14
  },
  {
    "post_id": "1odqriz",
    "title": "AITA for calling my (F22) best friend (F22) an alcoholic?",
    "selftext": "this all started 4th of july. she no call no showed to work at her dads company so she could get drunk earlier in the day. she went out all weekend, no call no showed on monday, and got fired. ofc she blamed her dad for her losing her job. then she snuck out on a thursday to go get drunk in a random field with random dudes. her dad took her car and she ofc blamed him because if she hadn’t gotten fired she wouldn’t have been drinking. then she throws a party at his house and he threatens to kick her out if it happens again. i had a talk with her, explained that she needed to focus on getting a job and a car and rebuild her relationship with her dad. she agreed and i took her to a dealership that i know would sell her a car and then helped her make a plan to get back on track. i sent her multiple job applications for jobs that i could help her get, i sent her information on different licenses she could get that would help her get better paying jobs, and i also offered to pay for her first couple classes at our community college. instead of accepting help she chose to get hammered every weekend and almost every weekday. she then tells me one day that her dads gonna kick her out if she’s not home by 2am that night. i told her i’ll drop her off at home at 1:30am so that way she has a dd and she’s home on time. so i drop her off, she says goodnight, turns off her location on life360, sneaks off to a party. i find out she’s there, pull up in my jammies to pull her out of that house and take her ass home, i take her back home then head back to my place and then find out that she went back out. i was pissed. her dad kicks her out. then last week she dodged my calls on a saturday morning. i look at her location and she’s at walmart so i pull up and look for her car and instead i see her with her mom. i immediately pretended to be surprised she was there and she said she had a bad night. she texts me later saying she got arrested with some dude. this is how i learn she’s seeing a 32 year old man with an extensive criminal background, 2 divorces, and 3 kids. i try calmly and kindly talking to her and suggest maybe she quits drinking for a while and she flies off the handle. she’s telling me im a bad friend that never did anything for her. so i lost it. i said “you’re an unemployed, homeless, alcoholic with no future. it’s fucking pathetic that you can’t admit you have a problem while you’re ruining your life.” my friends are saying i was too harsh and that i needed to be nicer but i say fuck it. it’s true. she has a problem. but what do you think?",
    "flair": "Not the A-hole",
    "created_utc": 1761183713.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odqriz/aita_for_calling_my_f22_best_friend_f22_an/",
    "downs": 0,
    "ups": 12,
    "score": 12
  },
  {
    "post_id": "1odq1ei",
    "title": "AITA for \"stealing\" my dead grandma's ring?",
    "selftext": "I (20F) was the primary caretaker for my grandma for about 4 years before she passed away this last April. I saw my grandma all the time, especially in comparison to my family, who barely visited. When she passed, my direct and extended family obviously showed up to go through her belongings and take what they wanted.   One of these being my sister (31F), who shared a birthday with my grandma. While everyone else grabbed vintage dishes, scrapbooks, and antiques,  I grabbed a few small knick-knacks like her glasses case and mini ceramic cat. I also took her bed frame (it was going to be donated and I needed one for college anyway). When it came to jewelry, my cousins took nearly everything.   My mom and I did the last sweeps of the house, taking leftover items either to our house or the dump. My sister also left some of her chosen stuff at our house temporarily. Everything just kind of piled up for a while while we grieved.  A month later, I started sorting through my pile and found a gold ring. I wasn’t sure if I’d accidentally grabbed it or if someone had tossed it in my stuff, but I was honestly happy to have something to wear everyday to remind my of my grandma. I regretted not grabbing any jewelry when we first went through her things.  For the past 6 months, I've worn this ring daily. It's a simple gold ring with green gem. This morning, my sister came over, saw it sitting in my jewelry tray, and immediately started yelling that I'd stolen it from her. She said that it was her birthstone (her and my grandma's shared birthday) and that our grandma said she should have it. Then she told everyone in our family that I stole her ring and left without another word.   For context: my sister only wears silver jewelry, while I've always been a gold girl. This ring also fits me perfectly and does not fit her at all. And now she says she is keeping it hidden from me to get it resized for herself.   What frustrates me most is that I've always valued sentimental items and take good care of them. My sister, on the other hand, has let her kids destroy multiple childhood items I passed down to them, which were things that meant a lot to me.   One of her main arguments is that I \"took a lot\" from Grandma because I display everything openly in my room. Meanwhile, she took boxes of old photos, antiques, and holiday dishes that are stored away. So, visually, it looks like I have more, which makes her story much more believable to our family.   So, am I the asshole for thinking I should get to keep the ring? (I probably can't even get it back now.)",
    "flair": "Not the A-hole",
    "created_utc": 1761181604.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odq1ei/aita_for_stealing_my_dead_grandmas_ring/",
    "downs": 0,
    "ups": 31,
    "score": 31
  },
  {
    "post_id": "1odpsi6",
    "title": "AITA for breaking my friend’s phone and refusing to pay for a new one?",
    "selftext": "I (18f) am in a trio with two girls Mia (17f) and Addy (18f) (fake names) for around three years. Last Friday we all decided to go to the mall to just hang out. After a while of shopping and looking around we decided to go to the food court. While getting in line for food I was showing them a text message between me and a guy on Snapchat that I have been talking to for a while. Mia thought it would be funny to take my phone from me and start texting the guy heart emojis which obviously freaked me out as I really liked the guy.   I tried getting my phone back but in the process I accidentally made her drop her phone onto the floor. As she picked it up the phone screen was black with colored lines on it and would not turn on at all. Mia and Addy collectively agreed that it was my fault and started saying how messed up it was for me to do that. Mia even said she was trying so hard to not break off our friendship due to what I did.   Later on Mia texted me through her iPad how she expects me to pay for a new phone for her and I replied telling her that I don’t think it’s my fault and that I wasn’t going too pay for a new one. Now Mia and Addy are constantly bringing it up how I’m horrible for breaking Mia’s phone and how I should at least pay for a new one. AITA",
    "flair": "Not the A-hole",
    "created_utc": 1761180899.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odpsi6/aita_for_breaking_my_friends_phone_and_refusing/",
    "downs": 0,
    "ups": 77,
    "score": 77
  },
  {
    "post_id": "1odpba1",
    "title": "AITA Am I not reciprocating or is it a covert contract",
    "selftext": "AITA My roommate and I have been good friends for about 3 years. We recently became roommates a few months ago. My friend also works in food catering so she often brings me back food. I never ask, nor the expect, she's just thoughtful. But recently she's been getting upset with me cause whenever I go grab a coffee or food I don't bring her any. she annoyingly goes \"wheres mine\" and I don't know how to reply. I never expect her to do these nice things and wouldn't care if she didn't. But I understand why she's frustrated   I guess I just can't tell if it's my fault for not reciprocating, or is she using covert contracts.  EDIT: the food she brings is free, left over from her job.  EDIT 2: Basically what I got from everyone is that my friend is unfair in her expectations, however, I should reciprocate and more thoughtful since she goes put her way to do nice things for me. I agree and intend to have a talk with my roommate about this so we can both feel heard. I appreciate everyone's input, thank you!",
    "flair": "No A-holes here",
    "created_utc": 1761179543.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odpba1/aita_am_i_not_reciprocating_or_is_it_a_covert/",
    "downs": 0,
    "ups": 8,
    "score": 8
  },
  {
    "post_id": "1odp1ql",
    "title": "AITA for having a security cam in a shared living room",
    "selftext": "My bf(yun), roommate(chris), and I just moved into a bigger apartment to help out my bf’s younger brother(noh) and his gf(cher) after they got kicked out of her moms house. The three of us are big on our tech and have fairly expensive set ups with mine and chris’s set up being in the living room and my yun’s setup in our bedroom; bc of all of the expensive stuff I have a security cam set in the living room (not hidden) and turned on at night or when no one is home to make sure if someone breaks in, we’ve got footage(it’s happened before). All three of us have access to it except for noh and cher bc they declined access.   I make sure cher is aware of the cam and is ok with it and she says it makes her feel safe.   Couple of weeks go by and cher is suddenly saying she didn’t know the cam was in the living room, that she feels unsafe, she doesn’t want yun and chris watching her without her knowledge, it’s illegal to record people without consent, it’s triggering to her, etc.  I told her that she and I spoke about it before and she stated she was okay with it and she said I was gaslighting her at that point.   I want to make a point: the camera isn’t active while people are home and turns on via a schedule set at 2AM and turns off at 6AM.   Other issues arose and they have since moved out but I can’t help but think if I was in the wrong and indeed an AH for getting the cam in the first place.",
    "flair": "Not the A-hole",
    "created_utc": 1761178783.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odp1ql/aita_for_having_a_security_cam_in_a_shared_living/",
    "downs": 0,
    "ups": 6,
    "score": 6
  },
  {
    "post_id": "1odoy0g",
    "title": "AITA for not eating my MIL's food",
    "selftext": "I (24 F) have been together with my boyfriend (29 M) for 3 years now. We are from different cultural backgrounds, although it's not very noticeable in our everyday lives or in the relationship in general.  I have been a vegetarian for 10 years now. It was something I chose in my early teens, as I have always felt a deep connection to animals. It was always respected by my family and was never a problem in our household. That said - I have always, and I mean ALWAYS, respected everyone's personal decisions. I would never even suggest to someone that they should become a vegetarian -  that is not my choice, not my life, and not my business.  So, I have obviously gotten to know my boyfriend's family well during the 3 years that we have been together. I like them all a lot -  even love them. His father is welcoming and warm, his siblings are funny and kind, and all of them try to help me understand all of their conversations (me and my boyfriend have different native languages). The only issue I have experienced is with his mother. Don't get me wrong, I like his mother, I really do; however, there has been one reccuring problem that has grown more evident throughout the years.  The main topic of conflict between me and my boyfriend's mother is the fact that my \"MIL\" is always trying to serve me meat. She insists on serving me dishes with either larger pieces of meat, or sometimes even disguises it by mixing small chunks of meat throughout the dish. She has also insisted that a meal is vegetarian while actually using broth made from meat and bones. She usually says that something is vegetarian, so that I will try it, and later reveals that it is actually made from meat.  I understand that it sometimes can be difficult to know which products are vegetarian and which are not. The issue, however, is that I have tried, time and time again, to explain and clarify what I can and cannot eat. The first few times I visited their home, I had to turn down food with meat in it and explain why. After that, she started \"hiding\" the fact that some dishes are made with meat.  My boyfriend has stood up for me a few times and told his mom off for continuing to serve me meat-based food, as it can also cause my stomach to become quite upset. He has, however, also said that it is considered rude of me to refuse to eat his mother's food and has explained her actions as a difference in culture. He has even been mad at me for implying that his mom can't cook, or that I don't respect their culture.  I, of course, do not refuse to eat everything my \"MIL\" cooks, but at some point, I started getting frustrated and suspicious of some of the things she cooks. I have even asked my boyfriend if I can cook, or at least help cook, my own meal (this did not help the situation). I understand that there are cultural differences, and I really do not want to come off as rude, inconsiderate or ungrateful, as she is hosting us both when we visit their home. But at some point, I feel like I need to stand up for myself.  So, AITA?     Edit: I have noticed that a lot of people have found my previous post. I have deleted it for my own peace, as I have gotten a lot of judgement from it. I know it is easy to pass judgement on people on the internet, but as all humans, relationships are complicated and sometimes it is easy to judge without having full insight into a situation. I am a bit overwhelmed by all the responses, so I will ty to respond in my own time.   And yes, I am a people pleaser and have had issues to stand up for myself, I am trying to work on that.",
    "flair": "Not the A-hole",
    "created_utc": 1761178493.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odoy0g/aita_for_not_eating_my_mils_food/",
    "downs": 0,
    "ups": 3042,
    "score": 3042
  },
  {
    "post_id": "1odnx8i",
    "title": "AITA for telling my roomate that her best friend's fiance is not invited to our parties?",
    "selftext": "I (27F) live with my boyfriend (25M) and his sister (27F) who is also one of my good friends. I will refer to my boyfriend's sister as my roomate throughout this post, but I wanted to be clear that our lives are more intertwined than your average roomates. We frequently have friends come over and host parties, and the vibes are good, EXCEPT... when my roomate's best friend's fiance comes around. I will refer to my roomate's best friend as R and her best friend's fiance as J.  J has been a source of discomfort in the friend group since he started dating R. He has shown many times that he holds bigoted beliefs and he is emotionally abusive to R, who we care about. Not only that, but R and J constantly argue, even at these gatherings where we're all trying to have fun. After months of this, it began to reach a point where all our friend group talked about was how much they hated J, mostly because my roomate kept bringing it up in conversation. Even at parties, most of our friends were eavesdropping on their arguments or complaining about how terrible J was to R, and nobody was having any fun. Yet, my roomate wasn't willing to stop inviting R and J to parties because she was worried R would be isolated.  While I understand, I have been in an abusive relationship before, and was not only very triggered by J, but also sick of how my roomate's enabling was affecting everyone. I set a boundary and said I did not want J coming to our parties anymore, and everyone agreed. My roomate didn't agree, but respected is and told R that J was no longer welcome.  R then got angry at everyone for not \"talking to her\" about it, expressing no care about how uncomfortable they had made everyone. Since then, they have not been in attendance at group gatherings, and while we were sad that R chose J over us, we understood. Since then, things have been fine.  It's been a few months, and my roomate has been repeatedly bringing up how J \"took it to heart and has changed\". I don't believe that anyone is capable of changing their whole personality and belief system in a year, never mind a few months, and have expressed my skepticism. Recently, my roomate and my boyfriend were both talking about this, and my roomate mentioned that she had invited R and J to our upcoming party.   I didn't say anything at the time (my bad, I know) but I saw this as a boundary violation, and was pissed that my roomate had not asked us how we felt about inviting R and J beforehand when we had already made it clear that J was NOT welcome. It took me awhile to talk to my roomate about it because she gets very sad when she is confronted with anything, and I find her reaction to be triggering (OCD + guilt = bad combo), but once I worked up the courage, she just kept insisting that it wasn't fair for me to make blanket judgements, that I should \"give him a chance\" and that J has changed. She is not willing to reinstate the boundary we all agreed upon. AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761175692.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odnx8i/aita_for_telling_my_roomate_that_her_best_friends/",
    "downs": 0,
    "ups": 27,
    "score": 27
  },
  {
    "post_id": "1odn9ec",
    "title": "WIBTA if I told my roommate she can’t use the kitchen fridge?",
    "selftext": "Hi Reddit,  My roommate moved in a year ago after I went through a breakup and couldn't afford the rent by myself. I rent the house owned by my parents, and I sublet a space within it to my roommate.   No cohabitation is ever perfect, my roommate is messier than me, and doesn't always clean after herself. I didn’t give up, but I decided to just clean the common areas to my liking rather than repeatedly asking her to help. But she pays rent on time and that is a big help.  When she moved in she had a lot of things, much more than was disclosed to me, and more than could fit in her space, so I asked her to move to the downstairs area so we could both reclaim some space and for me to not feel so cluttered.  After she moved in, I very quickly realized that the existing fridge was way too cramped for two people not sharing the same food, so for both our comfort I looked for another fridge and found a cheap second hand one and we moved the previous one to the garage as an extra. That worked better, we shared the big new fridge and freezer half half until it broke recently. I spent a few hundred dollars to try to fix it, buy new parts to save on the repair, but I ended up calling a fridge specialist after failed attempts, and he told me it was beyond repair.  I didn't want to buy a new fridge, but their life spans are so short now, and not wanting to go through another broken fridge adventure or keep splitting the previous one, I decided to go for it. I didn't feel it appropriate to ask my parents (the landlords) for a new fridge as the one that came with the house still works just fine.  So I bought the new fridge two days ago and it’s being delivered tomorrow. I spent 2400$ on it and it's the biggest investment I've made in a very long time. I work three jobs to make ends meet so this is a big deal for me.  The freezer is definitely too small to share (the whole fridge is smaller), and I feel comfortable asking her to use the garage freezer. But I would really like to be able to enjoy my whole new fridge by myself, so it stays organized and cared for to make it last. The other fridge is right next door to the kitchen, although I know it's more of a hassle to access by default. But she would have the whole thing to herself.  I want things to feel fair, but I don't want to be frustrated either. I feel selfish, but also like it makes sense since I bought it and there's the other one. So WIBTA if I told my roommate she can't use the kitchen fridge, just the garage one?",
    "flair": "Asshole",
    "created_utc": 1761173962.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odn9ec/wibta_if_i_told_my_roommate_she_cant_use_the/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odn911",
    "title": "AITA for washing myself in the shower after poo",
    "selftext": "I (29M) am from India and moved to Canada a few months ago for work. I share a 2 bedroom apartment with a flatmate (28F). We get along really well in general. She even introduced me to her friends and defended me once when some people were harassing me. I have struggled to make other friends here so I really value our friendship. Even though most of her friends are girls I feel like they've accepted and welcomed me.  Back home we always wash with water after using the toilet and I have never used toilet paper in my life. I find it dirty and uncomfortable. It feels unhygienic and sometimes parts of it stick, so for me it is not clean unless I wash with water. Since our landlord refused to let me install a bidet seat, what I have been doing is cleaning myself in the tub or shower right after pooping. I do not use any toilet paper at all. I always rinse the area and the tub well after, use soap, and make sure everything looks clean.  A few weeks ago my flatmate brought it up and said she does not want me to do that anymore because she \"found poo in the drain.\" I told her I do not believe that because she never showed me, and I am always careful. She has long hair and from the start we agreed she would be responsible for cleaning the shower drain because it is mostly her hair clogging it.  What also bothered me is how she even figured it out. She admitted that she could tell because she hears the shower turn on right after the toilet flushes since her bedroom is next to the bathroom. That actually made me uncomfortable because it means she has been listening to what I do in there.  She got upset and said it is disgusting and not normal here. I tried to explain that this is normal where I am from, but she said I should adapt. I asked the landlord again about a bidet attachment but he said absolutely not.  I really do not want to move because rent here is super cheap. I only pay 700 for my room when most 2 bed apartments in this area go for at least 1500 per person because she has an older lease. It is modern and spacious, and I had a really hard time finding a place when I first moved. A lot of people did not even reply to my applications, and a few sent racist messages telling me to \"go back to India.\" I would have to share with 4 or 5 people to achieve something similar.  I had awful roommates before this one and compared to them she is honestly very friendly. I do not want to lose this place or make her uncomfortable, but I also do not feel clean without washing. AITA?",
    "flair": "Asshole",
    "created_utc": 1761173934.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odn911/aita_for_washing_myself_in_the_shower_after_poo/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odn42h",
    "title": "AITA im confused and need help.",
    "selftext": "so I work in a fast food company and I am really confused. I work with a girl that calls everyone b..ch and she calls me it every single time I am in ever since the very first day that I have worked there. So today I go in and they start doing my job and she comes round the corner and asks if I can run out a order to drive through I go yes because it was a good opportunity to help train an employee who was currently learning tills I looked around to make sure that it was OK and that nobody was listening and nobody was near And just as she does to me quite a lot I said but just to be clear I'm not your pack b..ch in a very joking tone just like she does every single shift I have with her. I run the order out and I come back in only for my shift supervisor to come over to me and ask me what exactly I just told this employee and I told her the truth because I said I called her this because she calls me this every single shift And that I'm told that I have upset her and that I should apologise.     so I immediately go running around the store just trying to find her because I honestly just thought she took it as a joke because it's what she does all the time and I find her full on crying in a colleague's arms so I walk over there and I say her name to which the person holding her looks at me like I'm scum and tells me to leave So I do because I am just confused right now she can dish it out but the first time I've ever done it she can't take it?     so I leave so that she can calm down and when she comes to put the gravy into draws that they belong in I try to apologise and she once again blows up at me and says if I want to take this further I can keep talking So right now I am just feeling as if maybe when she was saying it to me she didn't actually mean it as a joke because it doesn't seem like she knew that I meant it as one which is concerning considering that she has called me it every single shift since I first started there I don't know am I the \\*\\*\\*\\* of a saying it or is she it.",
    "flair": "Not the A-hole",
    "created_utc": 1761173560.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odn42h/aita_im_confused_and_need_help/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odme6t",
    "title": "AITA for being angry at my boyfriend about a necklace",
    "selftext": "I am 18 f and dating my bf 19 for 2 years. I am a really big fan of vivienne westwood and i want to own one of her pieces. Ofcourse they are very expensive so ive gotten myself fake pieces several times ( yes this is relevant)   My boyfriend often gets me gifts that i do not like, not always but way to often. This makes me feel like all he cares about is getting me a gift instead of getting me something because he knows me and knows what i like. Ofcourse i am very grateful and i always thank him and use / wear the stuff he gives me even when i dislike it. I have told him this.  I have always been expressive about my love for vivienne westwood and i asked him to get me one of her pieces some time. I know its expensive so i didnt tell him when, i just said its something id love to get. Id rather get one gift that i absolutely love instead of 3 i dont really like.  Ive gotten him very expensive things too and i think in total ive spend more on him gift wise but i dont really mind since he spends more on dates.Money is not a problem in our relationship we both spend relatively the same on eachother. Or for example when we go to the movies, he pays the tickets i pay for our food.When i buy him a gift i look for stuff he is passionate about and i consider his interests or what he reposts about on social media. He never asks me for anything specific so i got him a sword of one of his favorite anime characters since he likes anime and did a repost about loving swords. This was a year ago i cant really top that anymore :(   This year in august he went to Japan for a month with friends. Guess what he bought... A vivienne Westwood necklace for HIMSELF matching with his best friend. Mind you my bf didnt know anything about vivienne westwood or fashion in general before we got together. He got me some cute gifts like Hello Kitty bag chain, chopsticks, a manga in Japanese, a cool Hello Kitty t shirt and really good matcha honey. (Edit i didnt expres well enough how much i loved the gifts he got me from Japan, this was meant to show he learned to get me stuff i do like)  Now i was upset about this but i didnt want to be annoying and at the moment i thought i was wrong for being upset. This man would not stop talking about how cool and great his new necklace is and wears it everyday. When i got myself fake vivienne westwood jewelry he was judging me, saying its fake and poor quality.   Now everytime i think about this i get more and more upset. Our anniversary is next month and i asked him if we are doing gifts, he asked me if i wanted something specific and j said \" i want something ive been asking for for 2 years and you eventually bought for yourself\" he said he was planning on buying it for me for a while but he didnt know what i would like.  He said hed take me to the store so i can choose... We dont have vivienne Westwood stores in the Netherlands.   He claimed we have and i said no, ofcourse after looking it up he believed me. He said he will order online for me but i told him i dont care, i dont want it anymore.  AITA?  Edit: i see people saying i am wrong for saying i dont want it anymore. IF i said that just to be mean i absolutely understand that, but i am not 'just' saying it. I genuinely dont want it from him anymore. I realized how dumb i look basically begging for something i shouldve just saved for and gotten myself.  Can people also stop being mean and attacking our character or calling names? I was asking for thought and opinions on this specific topic not insults. If you are a miserabele person keep it to yourself no need to project to others. Just because its online doesnt mean you have to stop being a decent person, you owe everyone online and offline decentness. Keep in mind that you do not know me and i do not know you, all you know is this specific information i am providing you with from my perspective",
    "flair": "Not the A-hole",
    "created_utc": 1761171663.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odme6t/aita_for_being_angry_at_my_boyfriend_about_a/",
    "downs": 0,
    "ups": 5,
    "score": 5
  },
  {
    "post_id": "1odlag6",
    "title": "AITA for telling competitive gamer I beat him ?",
    "selftext": "I’m just curious cause it bothered me. I liked this one creator. He’s a competitive gamer and he’s really good at this certain team game. I’m a gamer myself but I don’t consider myself good at this game. Well I got him in my game I was so excited because wow he’s a pretty big creator and I’m playing against him. I beat him twice. I went to his discord and sent him a message along the lines of “ his I saw you in my game ! And I beat you twice gg!“ and I left a little funny emoji. I didn’t mean any harm I just thought it was cool that I seen him and I actually won against him. But he just gave me a rude response like “ well win me 1v1, and the only reason you won is because I wasn’t playing with my friends, when I said I didn’t mean any harm he said something like “ well don’t come up in here saying that unless you wanna beat me 1v1 or something. I want playing with my friends either but still I thought he was super rude over this game or was I the asshole for my message ?",
    "flair": "Everyone Sucks",
    "created_utc": 1761168945.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odlag6/aita_for_telling_competitive_gamer_i_beat_him/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odl90b",
    "title": "AITA for saying I would be ashamed if I were my father, after he send me fake information?",
    "selftext": "First time writing on Reddit ever, please bare with me!   I (18f) fight often with my father (52) and think maybe this time it went too far. Little context just so you guys can understand better. He and my mother divorced when I was 9 and I've lived with my mother ever since, but they have shared custody.   After he moved out, we didn't see each other as often as it would've been good. There are MANY things that happened in the past that strained our relationship that would take way too long to explain. The important part is, that since I was about 13 we fought a lot. We have VERY different opinions and we are both stubborn. So our fights can go on for a few hours on a bad day.  Now the issue. Last week he came over to my apartment, originally just to see me and it somehow turned into a 3 hour debate about all kind of things. It switched topics A LOT and I told him that I thought he was a bad father in between. We talked about it for a while, he made a bunch of excuses but kinda apologised to me. We ended it after that and he left, but I thought the vibe was really off (obviously after something like that).   Two days later he send me this Facebook post over something we debated about. I read through it, it was about 20 minutes long. We had prior to that talked about how to not use information off of Facebook, he said he wouldn't do that, and still did it. It was full of fake information. I literally googled one thing from it and the first thing that came up? FAKE. I'm pretty passionate when I debate, thats why I made him an entire document were I listed ALL the things that were wrong in that post he send me and with sources. I wrote him this message on top of that:  \"Here's a file where I showed you that you just believed lies. Don't send me anything like that again if you can't even double-check simple facts. And I'm sorry to sound mean, but I would be ashamed to fall for something like that and accept it as truth just because I can't dedicate three more minutes to the topic.\" I also added that I still loved him, but that I needed to draw a line.  He was VERY upset. He said he thinks I am mean and presumptuous. He twisted my words to 'you're a liar and I am ashamed of you' even tho I didnt say that. He also wrote that he never said the post was 'the truth' just something I should think about. I answered him, clarifying some things and ending it with 'im done with this topic now, love you, good night.'   That was over a week ago and he hasn't responded or contacted me in any way. We fight often, but this felt different than usal. My mother and sister say I went too far with that message. A friend of mine said it was good that I did it and that he needs a reality check. I don't know if I did the right thing and that this harshness was something he actuall needed or if maybe I ruined our entire relationship with this now. Especially after the fight two days prior to that. So AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761168852.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odl90b/aita_for_saying_i_would_be_ashamed_if_i_were_my/",
    "downs": 0,
    "ups": 91,
    "score": 91
  },
  {
    "post_id": "1odkxl5",
    "title": "AITA For telling my mother that my little brother (13) should not get many(if any) Christmas gifts this year.",
    "selftext": "So this year has been rough for my family. My mother is a single parent of 4 including me (16f), my two brothers, and sister. I am the oldest of her children and been having to step up lately.  Earlier this year him and my mother had a fight about his screen time. It has always been 1 hour on vr for everyone, including me but he has always had trouble listening to this rule. He normally gets angry when I try to rush him off after he passes and hour and when I give him an extra 5 mintues he still won’t get off when I tell him. At one point he started getting in before my mother was awake or sneaking on without asking. Him and my mother fought about how he needs to respect her rules or he can’t bring use the headset or bring the one from his fathers house. My brothers dad doesn’t care how much they go on electronics. My mom and their dad switch weeks with them on Sunday's each week. My youngest brother(11m) doesn’t ever think the rules are unfair.  When my mother and brother had an argument about the rules he went to his dads the next day like normal but when it came the night to pick him up, his father told my mother that he wouldn’t come, he didn’t feel comfortable. My mom was asking for a reason since it was the week of spring break but my brothers dad said he was scared of when she left at night to see her friends (which she does once a month) even though I am here and capable of texting her if something’s wrong and we have big dogs to protect us. All me and my siblings don’t mind when she has left in the past since she returns before 12 and is never drunk or acting wild, she always checks in and makes sure everyone is okay beforehand.  My mother went to talk to him and see if he would come to our house or just talk but at their fathers house, his father tried making my mother talk to him through the screen door as him and his wife listened. Long story short he started getting persuaded to go with my mother but saw his father and closed up. Just so everyone knows, his father is a narcissist (professionally diagnosed) and him and his wife have been discreetly harassing my mother for months.   My mother was absolutely heart broken because she loves her children and does her best, the whole situation making her mental state much worse. For the next few months she only saw him during his sports games and she would cry after, clearly distressed and wanting to see him more. She and my brothers dad went to court. He tried to get full custody of one, key word, one of my brothers while supervised visits from my mom. He didn’t talk about his other son which made it more suspicious. To shorten this, the judge told him he had to make my brothers come to our house. My brothers dad didnt exactly listen but after another court session my brother slowly started coming back.   Lately is the problem: My brother come to our house he acts like rules dont apply to him, he can eat junk food, doesnt have to do chores, and can just sit on his phone (that wasnt even supposed to be at our house but after an incident, it is). Now all hes been talking about are gifts and things he wants even though he doesnt do anything.   AITA for thinking he shouldn’t have gifts after how he has impacted my mother and our family life?  Edit: Yes, I know I shouldn’t be trying to parent but my mom has been giving into all his wishes he’s asked for and after his fathers words towards her, hasn’t been parenting him how she used to and how she does us. I haven’t said anything yet but have been inching towards mentioning his behavior. I’m taking all comments into consideration.",
    "flair": "Asshole",
    "created_utc": 1761168082.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odkxl5/aita_for_telling_my_mother_that_my_little_brother/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1odiqom",
    "title": "WIBTA for moving out of my cousins house in the middle of the night without telling her?",
    "selftext": "So I moved into my cousins about 2 month ago to help her with her baby. She agreed to pay me and help me with my pets expenses and things like that. Well I moved in and less than a week later she quit her job because they \"weren't giving her enough hours\" at the time her baby dad wasnt living there. About 2 weeks later he moved back in and hes also jobless. Ive been here for over a month and havent gotten any money. They pay me in dab pens and small amounts of weed. Which was fine originally but I have bills to pay. Now my biggest problem is my gecko. I have no electric in my room which means she stays in the living room and her tank doesnt get warm enough during the day mind you she has mouth rot so EVERYTHING about her environment needs to be perfect. Ive asked her to get the electric in my room working multiple times and all shed have to do is call the landlord but I keep getting brushed off. Today I told her we needed to get things working and my gecko upstairs before winter and she brushed me off I told her I want electric in my room and she said \"it sounds like alot of complaining\" I said \"I have a right to complain\" and her reaction was \"do you?\" I hate to say it but my gecko means way more to me than nannying her baby with no payment mind you they only have 1 kid and neither have jobs so they rewlly dont need me. I feel like this is completely unfair to me as I got nothing I was promised but I watch her baby constantly, I clean her house and I do everything she asks for nothing. Would I be the asshole if I just up and left in the middle of the night? Mind you I have talked to her multiple times about getting the electric in my room working and my gecko in my room to which im CONSTANTLY brushed off. Shes CONSTANTLY spending money on stuff but doesnt have enough to pay me. My life has been on hold for her and I feel like shes taking advantage of me. And the baby's dad isn't much better.   Edit: so id be leaving in the middle of the night bc im a huge people pleaser and I hate conflict. I know I need to grow a pair and get over it its just hard 😩 I get guilt tripped really easily...   Edit 2: im gonna talk to them the day I move out and wont give them a chance to try to convince me to stay. I appreciate everyone replying and ill continue to read the newer replies  Edit 3: ok ig I wasnt specific enough and thats my bad, so the baby is the mother's absolute pride and joy. The baby isn't in any danger or anything. She doesn't come in contact with weed the parents dont smoke it theyre actually very strict about it understandably... idk I dont see cps doing anything bc well the baby's healthy happy fed and the house is clean and safe. The only person whos unhappy in this situation is me 😅 i do appreciate you all for being concerned for her tho ❤️   4) im not gonna keep answering questions about weed. I smoke the parents dont. they pay me in weed bc i smoke and the BD has an uncle who gives it to him for free.  Its not near the baby at all so it shouldnt matter. Its also legal where i am and its not considered a drug here. I have my reasons for smoking it. I smoke it outside only so again it shouldnt matter. Im not gona answer anymore question about it coz its really not a huge part of the problem im facing.",
    "flair": "Not the A-hole",
    "created_utc": 1761163055.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odiqom/wibta_for_moving_out_of_my_cousins_house_in_the/",
    "downs": 0,
    "ups": 20,
    "score": 20
  },
  {
    "post_id": "1odi0qd",
    "title": "AITA for not inviting my fathers wife to my wedding?",
    "selftext": "Hello!   So for context, my father met and married his wife in 2019. Back then, I still lived with them and I tried really hard to get on with her. Like, we used to be fond of each other for like the first year of them being together in contrary to my brother whom she really hates because he uses every opportunity to provoke her (he’s 23 btw) and I told him like a thousand times to just leave it be. Eventually, she stopped talking to me and didn’t care for me anymore. I didn’t understand why but I also couldn’t really bother to dig any deeper because I moved out soon after (in 2021) anyway. In this timeline, we visited them a couple of times (they live 7 hours away) and never does she even greet me. She’s Orthodox and I always took the time to wish her a Merry Christmas and Easter and wrote her on her Birthdays. She never does any of that. My fiancé proposed to me this year and I FaceTimed my father and told him. Mind you, his wife was in the same room and she didn’t even congratulate us!! I talked to my father about this and he said that because of the language barrier (she’s from Ukraine but has been living in Germany for around 8 years) and her stubbornness she’s unable to understand. And I was like, yes, but why did it work before she suddenly decided that she didn’t like me then? Anyway, we are planning to get married next year and we were originally going for a wedding without kids. I told my father and he said that if my little brother (5yo) can’t come then he won’t come as well. I was like, okay, fair, we’re allowing kids for closest family then because I can’t just not invite my father. A few days ago, he was talking to me about airbnbs and turns out, he was assuming that his wife could come. I carefully told him that we weren’t going to invite her because I don’t like her and I don’t want her at my wedding because she makes me feel uncomfortable. My father didn’t react very well and he replied that she is his wife and therefore should be allowed to come and he won’t be coming if she can’t come. I told him that he’s not coming then and we hung up and didn’t talk since that.  Honestly, I don’t know what to take from all of that. Am I the asshole for not inviting her?",
    "flair": "Not the A-hole",
    "created_utc": 1761161422.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odi0qd/aita_for_not_inviting_my_fathers_wife_to_my/",
    "downs": 0,
    "ups": 218,
    "score": 218
  },
  {
    "post_id": "1odhpvb",
    "title": "AITA for asking a kid to be quiet?",
    "selftext": "hi! So I’m seeing Beetlejuice on broadway (it’s intermission right now) and there’s a kid seated next to me who proudly told me he’s in fifth grade. I asked his mom if he’s ever seen the musical before (Beetlejuice is definitely a PG-13 musical) and she said she had and it was fine. I was skeptical about sitting next to a kid and it turns out i was right- he talked through the first three numbers. So during an applause break, I turned to him and asked him to please stop talking (those exact words). His mom glared at me and told him that he doesn’t need to stop talking (which is insane to me) and that if I was bothered I should move. Thankfully, it’s a matinee and not sold out so I was able to move a few seats over. I have really good floor seats that I paid over $100 for and I’ve travelled two hours from Philly and want to enjoy the show. I don’t think that I was out of line but other people around me weren’t complaining so was I being an AH?  Update/edit- hi everyone! thank you for all the comments. I should have involved the usher but the kid seemed to quieted down once I moved seats and I didn’t want anyone to get kicked out or in trouble so I didn’t involve an usher, even though I probably should have. thank you for all the comments though!",
    "flair": "Not the A-hole",
    "created_utc": 1761160740.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odhpvb/aita_for_asking_a_kid_to_be_quiet/",
    "downs": 0,
    "ups": 615,
    "score": 615
  },
  {
    "post_id": "1odhcmx",
    "title": "AITA for being mad at my best friend",
    "selftext": "I (22F) am best friends with 22M. We’ve been friends since around 2017 when the Nintendo switch came out. It bonded us during school and we’ve been friends ever since.   We’ve gone through a lot of changes, from school to university, to jobs to partners to friends.   Cut to now and I’m kind of pissed off at him. Since being at uni he’s never been the best replier and he also has a partner, friends, activities. But I feel like whenever I text him, I’m always the first to do so, he doesn’t send nor look at anything I send on socials (we used to be avid reels senders). We do movie nights to catch up as we don’t live close to each other, and we haven’t had one in ages. I messaged about doing one and he was like ‘maybe this day’ and I messaged about a few times and he’d made other plans.   Maybe I’m just hormonal and missing my best friend. And like I get he’s busy but considering I’m the best friend, I feel like I’m not even probably thought about that much. The most active he’s been was when I got a girlfriend and then since that’s been the new normal he’s dropped off again. (I can confirm that it wouldn’t be because of that, as again we both have partners and gayness).  Am I being the asshole for being a bit mad about this - does anyone have any advice.  Part of me is thinking not to reach out until he messages me now but I don’t know if I’m just being bitter. Or in general if I’m being too clingy here when some people barely speak to their best friend that much. Plus I know friendships with men are super different to women.",
    "flair": "No A-holes here",
    "created_utc": 1761159915.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odhcmx/aita_for_being_mad_at_my_best_friend/",
    "downs": 0,
    "ups": 1,
    "score": 1
  },
  {
    "post_id": "1odg0z3",
    "title": "AITA for not giving my benefits to our households joint account",
    "selftext": "So our household consists of my dad my brother and me. So I first of all my mom passed away 5 years ago. I am now 21 and my brother is 23 years old.   My dad is known for us as someone you can’t discuss with in any way. For example one time I came home from the train station with my bike. I opened the garage put my bike away and close the garage door. When I came inside my dad suddenly asked angry why I closed the garage door. I said it was closed so I closed it again like any normal person would do. Then he said no it was open and he started shouting. Like why would you should for something small like that. Just open the garage door again if it bothers you that much. (The door was 100% certainly closed.)   Around 5 years ago nearly 2 weeks after my mom passed we also saw that he was paying for fictional p*rn chat sites. This disgusted us and we are now talking in amounts of € 10.000 so it’s not that it was like € 5 per month.   So about the main subject. We have a joint account where we each put on € 700 each month. This is for our monthly expenses like electricity, heating, water, etc. We also use this for things like clothes that everyone needs.   Now my employer gives me a few benefits like 30% discount on my electricity bill. I also have the opportunity to work from home and get a few benefits with that as well. I get € 75 per month for my internet paid directly to my ISP so everyone benefits from this in our household, I get € 50 per month just for working from home.   Now my dad wants me to deposit the 30% discount I get paid for the electricity discount. Honestly I don’t want to because I think € 700 per month is already a lot to pay as rent to your parents to stay home. Now I live in Belgium where the rent is not to bad but you still high and with your monthly expenses I would be a tiny bit worse off living on my own. For the people saying yeah but that’s with your food and everything. Yeah you are all right but I can live a lot cheaper than my dad and my brother.   For that and because the benefit is for me because I work in the electricity sector, I don’t want to deposit this on the joint account.   I am really hard on saving and investing my money for this reason I can really save every € I can. So do you guys think I am the AH?   Edit: so I see some people asking how the discount works. Well the discount will go on my pay check because they are not the same company as my energy bill company. The Belgian ISP’s have a system where they can use third party payment provider. The energy billing companies don’t have this I think.   Maybe an important thing as well: my brother is not an AH. We have our differences but as a whole he is not a bad person like my dad is.  Some people may think that I just want to talk bad about my dad but everything that I said in here I said for a reason. I’ve been on an Erasmus exchange program in Finland and lived 4 months away from him in peace so I’ve had the chance to think about my situation clearly.   Also some people telling me I should maybe move out and I thought of this many times but I am still 20 y/o and don’t really want to because I live in a strategically good place for work and friends and the area is expensive.   I have also talked to him about this a few moments ago and he agreed that I keep it. The € 75 per month is plenty for my homework expenses.",
    "flair": "Not the A-hole",
    "created_utc": 1761156975.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odg0z3/aita_for_not_giving_my_benefits_to_our_households/",
    "downs": 0,
    "ups": 36,
    "score": 36
  },
  {
    "post_id": "1odfq0r",
    "title": "AITAH for not allowing the “return” of a car I sold now that it has broken down?",
    "selftext": "Using a throwaway as my main is used for my gaming. Obligatory posting on mobile, please excuse formatting mistakes.  I sold a vehicle to one of my partners coworkers. We were very clear that a lot of work has been done on the car and that although at this time we knew of nothing wrong with the vehicle we were selling it because we didn’t want to deal with it any more. This was repeated to them several times, “we don’t know of anything wrong, but we do not trust it.” After a test drive the coworker was confident they wanted it. So we wrote up a bill of Sale stating the terms of the sale; $3000 total paid in installments of $200 per month. And a statement that “this sale is final and the vehicle is sold as is, with no warranties or guarantees expressed or implied” seller and buyer singed the bill of sale and to make the registration and insurance process easier for her I signed over the title.  That was 6 weeks ago. The vehicle is now broken down, “internal catastrophic failure and needs a new engine.  The crank shaft and bearings have gone out.” She is now asking that we take the car back and donate it/junk it. They will just sign it back over and we can do what we want with it. It is currently about 2 hours from where we live.  I do not feel it is my responsibility to fix this problem for her, but I do feel really bad it broke down. She is now accusing my partner of taking advantage of her and saying that we never told her anything could be wrong with it.  This car has been a pain in my side since I purchased it for around $10,000 in 2020. It has had several mechanical issues that we have fixed. All in all probably putting about another $5000 into the vehicle, a lot of that very recently. A list of the things that have been replaced on it includes the battery, Alternator, Drive belt, Spark plugs, Ignition coils, Brake pads/rotors, Cam was refurbished, Valve cover gaskets, Oil/ oil filter, PCV valve, and Oil pressure sensor. Also there was fix done by our original dealership after jiffy lube failed to put oil back in the car after an oil change.  Again we were absolutely transparent about all of this and that we hoped nothing would go wrong but couldn’t promise anything. So, AITAH for refusing to allow her to return the now broken car I sold in working condition that is hours away from my home? Any idea for compromises? I can’t afford to give away thousands of dollars, but I’ve been in hard situations with cars before and know what it feels like. We are in the US.",
    "flair": "Not the A-hole",
    "created_utc": 1761156297.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odfq0r/aitah_for_not_allowing_the_return_of_a_car_i_sold/",
    "downs": 0,
    "ups": 248,
    "score": 248
  },
  {
    "post_id": "1odel8i",
    "title": "AITA for not sending my friend the files of an album I bought from my favorite band?",
    "selftext": "so i (18m) recently bought an album from one of my fav artists. it’s not on spotify, and i wanted to support them properly, so i got it from bandcamp.  a friend of mine (we’ll call him “w”) asked if i could send him the files since he didn’t want to pay for it. i told him i didn’t feel right doing that because it’s something i paid for and it’s meant for one person.  i even said if he just wanted to listen, it’s all free to stream on bandcamp, or i’d even gift him the album if he really wanted it that bad. he laughed it off, said i’m “overreacting” and compared it to not sharing sugar with a neighbor. i told him it’s not about being stingy, it’s about respecting the artists i love.  now he thinks i’m being dramatic over a few music files, and i’m sitting here wondering if i’m actually the one overthinking this.  so, AITA for refusing to send him the album i bought and standing by that?",
    "flair": "No A-holes here",
    "created_utc": 1761153843.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odel8i/aita_for_not_sending_my_friend_the_files_of_an/",
    "downs": 0,
    "ups": 7,
    "score": 7
  },
  {
    "post_id": "1odeiih",
    "title": "AITA for not driving my friend to a place?",
    "selftext": "hi, my friend asked me to drive her to her nail appointment since she will be late for it. I said no to her because i have other things to do later and i didn't want to leave home another time just for this. Usually i drive every single friend of mine everytime we hang out since im the only one with a car, ( im 18 i just got my license ) and im kinda tired of being people's uber.    This friend got angry at me and said that i should act like a friend and help her. I think that she should get her appointments only if she is able to actually get there in time and their things should not depend on me.",
    "flair": "Not the A-hole",
    "created_utc": 1761153672.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odeiih/aita_for_not_driving_my_friend_to_a_place/",
    "downs": 0,
    "ups": 10,
    "score": 10
  },
  {
    "post_id": "1ode1yv",
    "title": "AITA for not allowing my brother to eat the snacks I bought?",
    "selftext": "I 19f live with my aunt and my brother 12m, lives with his dad. His dad is poorer than my aunt so he doesn't eat as much over there. When he comes to stay at out house he eats all the snacks we buy, and sneaks some when we're asleep. This kid literally went through almost an entire box of chips during his last visit with us. I'm buying my own food now and when he came over I didnt allow him to eat any of the snacks I bought and hid them in my room. He was pretty upset about it, and my aunt told me I should share with him. I tend to go pretty easy on snacks and like to make them last a while. AITA?  Edit: He has plenty of food here and my aunt buys snacks for all of us. He is not being deprived of food at his dad's house. His dad just can't afford extra stuff like snacks.",
    "flair": "Not the A-hole",
    "created_utc": 1761152665.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ode1yv/aita_for_not_allowing_my_brother_to_eat_the/",
    "downs": 0,
    "ups": 447,
    "score": 447
  },
  {
    "post_id": "1oddli6",
    "title": "AITA For not giving back my old phone to my mother after she gave me a new one?",
    "selftext": "So I just turned 18 yesterday, and for my birthday, my mom (39F) and her boyfriend (40M) gave me a new phone. I didn’t ask for it. I had told them I was planning to buy myself one with my birthday money, and we talked about what kind I wanted, but I thought it was just a convo, like they were genuinely being interested.  Anyway, about a week before my birthday, my mom said they were getting me a new phone since they wanted to give me a “bigger” present. I was super happy when I got it on my bday, it was really nice and I thank them and gave lots of hugs. Since genuinely they landed on the gift.  Then out of nowhere, my mom says that once I start using the new phone, they’re taking the old one back. That old phone was a Christmas gift from them a while back. So I was like, “Wait, what? That phone was a gift too, and gifts aren’t something you take back.”  We started going back and forth. I stayed polite most of the time, just said I didn’t think it was fair and that's not what people do with gifts. And then she got mad and called me ungrateful.  So I’m wondering... AITA?",
    "flair": "Asshole",
    "created_utc": 1761151689.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oddli6/aita_for_not_giving_back_my_old_phone_to_my/",
    "downs": 0,
    "ups": 5,
    "score": 5
  },
  {
    "post_id": "1oddhys",
    "title": "AITA for laying on the horn at an old man who stopped in a turn lane?",
    "selftext": "I live in Los Angeles and work on film sets. I took a job as a PA on a short film last week. On the last day the shuttle bus taking the cast/crew from the parking lot to the filming location broke down so the producer asked me to go pick them up and bring them to set in my vehicle. (Yes, productions insurance covered my vehicle while on the job. I made sure of that) We were in a hurry to shuttle talent &amp; crew in and the pressure was on me at this point.   While driving from the parking lot on the first pickup I needed to make a right turn. Only problem was the driver in front of me decided to come to a complete stop outside a building and turn on his hazards. The turn lane was blocked off with a divider so there was no option for me to just drive around him. I rolled down my window and asked him if he broke down, he replied by yelling “Uber pickup, just one moment please”. I told him absolutely not and he needed to do his pickup elsewhere but he ignored me.   I started honking at him. First a quick tap, then just a bit longer. When that didn’t work I laid down the horn for probably 15-20 seconds until he threw up his hands in frustration and finally moved forward. He yelled “fucking jackass” at me as I passed him.   One of the actors in the backseat started yelling at me for being impatient and asked if I was trying to get us all shot. I was pretty confident on old man driving an older Prius with a Jill Stein and peace sign bumper stickers on the back was not going to shoot anyone let alone own a gun and also, he was impeding traffic and this is LA so I felt justified. The horn is a useful tool against inconsiderate drivers and I stand by that.   My producer approached me later on to ask what happened. He didn’t really have any reaction but I was later informed they were going to have someone else drive people to/from the parking lot for the rest of the day.",
    "flair": "Not the A-hole",
    "created_utc": 1761151483.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oddhys/aita_for_laying_on_the_horn_at_an_old_man_who/",
    "downs": 0,
    "ups": 24,
    "score": 24
  },
  {
    "post_id": "1odd8ab",
    "title": "AITA for posting a clean the toilet sign in the work bathroom?",
    "selftext": "AITAH for posting a sign that says \"Got Explosive Poops? Please pick up the toilet brush and clean up after yourself.  THANK YOU!\"   For context I work at a small business that has multiple restrooms, but the one inside the production area is the one that is used by us employees, the other is more private and mainly used by the boss for his morning poops. Lol. Lately the main bathroom toilet has been spackled nearly everyday and after a particular person uses it. He leaves it in an absolutely disgusting state after using it, and the ladies have been a little upset because they also use the same restroom. Yesterday a sign was placed on the inside of the door, instructing people to clean up after themselves, this morning someone took it personal and called the boss to complain. The boss called me, he was laughing and asked me to reword the sign, not because it isnt needed but because the dirty duecer wa complaining. So AITA",
    "flair": "Not the A-hole",
    "created_utc": 1761150891.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odd8ab/aita_for_posting_a_clean_the_toilet_sign_in_the/",
    "downs": 0,
    "ups": 478,
    "score": 478
  },
  {
    "post_id": "1odcv6p",
    "title": "AITA for putting a lock on my mini fridge that I bought with my own money in my room",
    "selftext": "I (23m) , live with my parents for the moment , I work during the day and go to flight school in the afternoon and do flight training , and study when I can . I pay my own car , insurance , and most of my own bills, not including bills my parents cover on a family plan . For years I’ve had this mini fridge I bought with my own money in highschool and have been using to hold sodas and yogurts. These past two years , I decided to buy some chocolates and put it in the fridge because I have a sweet tooth and enjoy some chocolate here and there . Problem is I have a big sweet tooth and sometimes I overeat the sweets in my fridge or have one to many sodas , recently for the past couple of months , my parents have been opening my mini fridge behind my back , and then bringing up a lot how all I eat is junk when I don’t eat as much as they say I do , but of course they see what’s in my mini fridge and judge right away . This past weekend I did a 5k and I trained for a couple of weeks doing it , and felt so accomplished the day I did it , I was proud of myself as this was a fitness goal I was aiming for , because of my recent 5k, I decided to put a lock on my mini fridge , so that it’s more difficult to satisfy my sweet tooth cravings , while Also serving as a way to prevent my parents from opening my mini fridge and seeing my snacks and drinks and judging me when I’m taking care of myself better , but it’s mostly to prevent me from opening the mini fridge as easily so I can controll my cravings better , my parents recently noticed the lock and while They don’t actively get something from the fridge , they said that I was being selfish and disrespectful and being immature for the lock on my own fridge , I tried explaining to them that while the lock does it make it to where they can’t open it easily , that it’s mostly for me to be able to controll my cravings better by making it more difficult to open the fridge whenever I want too , I told them that if they want something from the fridge , all they have to do is ask and I’ll open it and get it from them , because I have no issue with them getting something from the fridge , but that they open the fridge without me knowing and judge me on snacks and drinks I don’t touch as often as they think .  AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761150081.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odcv6p/aita_for_putting_a_lock_on_my_mini_fridge_that_i/",
    "downs": 0,
    "ups": 1761,
    "score": 1761
  },
  {
    "post_id": "1odc1qm",
    "title": "AITA for thinking my partner is overreacting about my driving?",
    "selftext": "I went to test drive a Tesla and wanted my girlfriend to come along. I had an appointment scheduled, and before we went, she mentioned a couple of times that she was uncomfortable with the self-driving feature and didn’t want me to use it. I didn’t think it would be a big deal, I just wanted to experience what the feature could actually do, so I turned it on for the entire test drive. We were completely safe, nothing dangerous happened, but she was quiet the whole time and I could tell she was upset afterward.  For context, she has been in a car accident before, and I know that might make her more anxious as a passenger. I’m trying to be understanding, but it’s exhausting feeling like I can’t even drive normally without upsetting her. I get that she gets anxious sometimes, but I don’t think I should have to completely change how I drive when I’m not doing anything unsafe.  Towards the end of the drive, I asked her if I could “floor it” to see how the car handled. She said, “please don’t,” but I did anyway, just for a second, to see what it was capable of. Again, nothing unsafe or reckless happened, but she got quiet again.  Later that night, while we were driving home on the highway, there was a car ahead of us that was swerving a lot. She said something like, “Wow, that person must be drunk, they’re swerving.” By that point, I was getting frustrated with the constant driving comments, so I said, “I know how to drive.” I was aware of the situation and already giving the other car plenty of space.  After that, things felt tense. When we stopped at the grocery store, she walked ahead of me and didn’t really talk. Later, she pulled me aside and said she’d felt uncomfortable in the car. I told her it felt like she just had a problem with my driving. I wasn’t trying to dismiss her feelings, I genuinely didn’t think I’d done anything wrong or unsafe.  I eventually said something like, “Maybe you should just let me drive,” because I felt like she was micromanaging me and overanalyzing everything I did behind the wheel. She started crying and got really emotional, which surprised me.",
    "flair": "Asshole",
    "created_utc": 1761148280.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odc1qm/aita_for_thinking_my_partner_is_overreacting/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1od9uhw",
    "title": "AITA for changing my roommate’s Netflix password after they used my bank card to pay for their account without asking?",
    "selftext": "My roommate apparently forgot their card details or something, so they used my debit card once, and I trusted them. Next month they set their Netflix to AUTORENEW with my card and didn't ever bother to ask. I changed the password and restricted my card. He is furious and says I made him lose a subscription they paid for \"emotionally\", ngl I think he has too much of an ego but still, AITA? EDIT: Yes, I did close/freeze the card. I'm still waiting for the new one",
    "flair": "Not the A-hole",
    "created_utc": 1761143395.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od9uhw/aita_for_changing_my_roommates_netflix_password/",
    "downs": 0,
    "ups": 969,
    "score": 969
  },
  {
    "post_id": "1od8gim",
    "title": "AITA to expect my coparent to Rehome his kittens due to our son’s severe allergy?",
    "selftext": "Long story short, I want my coparent to rehome his 2 kittens because of our son’s severe allergy. He doesn’t want to and is acting like I’m out of line to ask. AITA to want him to rehome his kittens?  I have full custody, 6 &amp; 3 year old started in home visits with bio dad. First visit, our 3 year old was moderately symptomatic for allergy to cats. Second visit, 3 year old ended up in the ER with severe facial swelling &amp; anaphylaxis after only 45min at his father’s home.  Allergy test confirmed a severe allergy to Cats &amp; Dogs with a new medication regimen prescribed. We are sadly bringing our recently adopted puppy back to the rescue because of this allergy. Dad doesn’t want to rehome his pets. He got both cats within the last 6 months. He has a one bedroom carpeted apartment with cat towers and fabric furniture. He has completely gone distant since his decision and I can’t stop thinking about this whole situation.  So AITA to expect him to rehome the 2 kittens?",
    "flair": "Not the A-hole",
    "created_utc": 1761140119.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od8gim/aita_to_expect_my_coparent_to_rehome_his_kittens/",
    "downs": 0,
    "ups": 1174,
    "score": 1174
  },
  {
    "post_id": "1od748c",
    "title": "AITA for not buying a gift for my mom?",
    "selftext": "My dad's sister and my mom were both born on the same day, different years.  My mom and dad, each give me 20 bucks a month for allowance.  This month I used it all on a gift for my aunt's birthday. It's not much money so there was nothing left for my mom.   When she found out she blew up at me. She thinks I should have bought a gift for her instead.  I told her once she gives the money to me, it's mine, and I can do whatever the hell I want with it. What is the point of giving me money if I'm not allowed to use it how I like?  Plus my aunt was my nanny growing up so she is very important to me.",
    "flair": "Asshole",
    "created_utc": 1761136725.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od748c/aita_for_not_buying_a_gift_for_my_mom/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1od6yqx",
    "title": "AITA for not wanting to pay my friend $2K for watching my cat?",
    "selftext": "Hi, I 26F was deployed for six months. My male coworker who I thought I was friends with agreed to take care of my cat while I was gone. No money was agreed or promised before I left. During the time I paid for her expenses as he told me them. And when I got back I picked her up I gave $300 because I considered this a favor from a friend. They did not like the amount given and wanted $2K. In their words the pet care center (nearest boarder) costs $20/day or $100/week so they should get $10/day because of the effort involved in taking care of my cat. She stayed at their house with their other pet during the time so they didn’t have to travel to take care of her. So AITA for not wanting to pay $2K? I obviously realize now this person is not a friend and I no longer will consider them as such and treat them only as coworker.",
    "flair": "Everyone Sucks",
    "created_utc": 1761136314.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od6yqx/aita_for_not_wanting_to_pay_my_friend_2k_for/",
    "downs": 0,
    "ups": 3594,
    "score": 3594
  },
  {
    "post_id": "1od6b53",
    "title": "AITA for being 'controlling' about the cleaning when my boyfriend was cooking for me",
    "selftext": "I (48F) work full-time, often from home, and I’m a single parent to a 14-year-old. I live in a small open-plan apartment, so my kitchen, living area, and workspace are all in one space. When it’s messy, I can’t escape it.  My job is demanding and takes a lot of mental and physical energy. By the end of the day, I’m drained, and keeping up with housework feels like a never-ending battle. I’m often too embarrassed to have people over because it never feels properly presentable.  Yesterday, I used my lunch break to deep-clean the kitchen and bathroom. It took almost two hours, and I had to make up the time by working late. I was so happy to have finally got on top of a few  things and just wanted the place to stay nice for a little while.  My boyfriend (55M) doesn’t officially live with me, but he stays over about six nights a week and cooks and eats here daily. He helps where he can (loading the dishwasher, wiping surfaces, taking bins out, etc)  but the majority of jobs are on me.  When he came over after work, he brought ingredients to cook dinner. Admittedly, I was being a bit twitchy about the kitchen. I followed him around with a sponge, picked up dropped food, rinsed the sink, hand-washed utensils, and wiped counters as he cooked, which annoyed him. The moment that really set him off was when I turned a pepper grinder upright after he’d left it upside-down, leaving pepper on the counter. He snapped and said I was being passive-aggressive, making him feel incompetent, and that his nice gesture wasn’t appreciated.  I apologised and explained I just wanted to keep the kitchen nice for a while, but he was still irritated. When we sat down to eat, he asked why I looked annoyed. I said I just felt like no one respected how hard I worked to get things clean. He blew up and threatened to go home, saying he wouldn’t cook for me again.  He and my daughter had both been rolling their eyes as he cooked and saying things like “oh god, mum’s on about the cleaning again,” which made me feel dismissed. I said I didn’t expect anyone else to deep-clean, but some acknowledgment of why I might want to keep it nice would go a long way. Instead, he told me I was controlling and that no one wants to be around me when I’m like this.  Later that night, when I got up to go to bed, I found the sink full of food scraps, the hob covered in sauce splatters, and dirty dishes left on the side. I don’t know if it was just because of the argument, but after being made to feel like I was the problem, it really felt like the final straw.  So, AITA? I genuinely can’t tell.  TL;DR: I work full-time and am a single parent. After spending hours deep-cleaning my small apartment, my boyfriend cooked, I tried to clean as he went, and he called me controlling and ungrateful. Later I found the kitchen dirty again. AITA?",
    "flair": "Everyone Sucks",
    "created_utc": 1761134503.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od6b53/aita_for_being_controlling_about_the_cleaning/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1od5iuy",
    "title": "AITA for telling my friend that her friend posted about not finding meaningful friendships",
    "selftext": "For context I dmed this stranger on YikYak bc he made a post about feeling lonely and not finding his people yet in college. So I felt bad for him and said I’d be his friend. He asked for my instagram and I was super hesitant bc I didn’t want to like get murdered or anything so I consulted my friend and she became curious about who this stranger was.   I ended up giving him my instagram and it turns out it was somebody I already knew! And this guy is close friends with the girl that I was telling about this situation, so I was like omg it’s your friend! Then my friend told her best friend who is the guys girlfriend, and he was like you snitched on me. Now I feel like an asshole bc this kid is probably just depressed and I just exposed his business to his closest friends.",
    "flair": "Not the A-hole",
    "created_utc": 1761132100.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od5iuy/aita_for_telling_my_friend_that_her_friend_posted/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1od4zy0",
    "title": "AITA for standing my ground against my mother?",
    "selftext": "Good evening. Last week i had a very heated argument (Or maybe one can even say fight) with my mother on the subjective of my (Step)sister who she had banned me from ever talking to since my birth.   It's a long story but I'll try keep it short.   Apologies in advance for the horrible English, It's not my first language.  My parents married at a very high age (\\~50), and due to this, as you can imagine, this was my father's second marriage. He had a daughter from that marriage (early 20s back then), which my mother disliked more than anything because my father paid a lot of attention to her, mentally and economically. This resulted in very heated relations, and eventually she forced her to \"Get out of their life\".      Fast forward 18 years and all this time she has banned me from ever talking to her and having any sort of contact with her because \"She ruined our life\", her reasoning is, among many she influenced my father to not be a great husband and she said she (My sister) is looking for a way to get rid of me so she can get all of the inherence.    A while ago, I finally managed to meet her in a condition where i could spend lots of time with her, and I very quickly realized pretty much all of what i heard from my mom was Bullshit and she actually, all this time really cared for me and during the 1 week time i spent with her found out we were very compatible and she was very supportive of me.  My mother finally found out about this and was unimaginably mad. I stood my ground, saying she is wrong about her and how she is my sister, and she has no right to ban me from being in contact with her.    She is very very mad and has said I'm no longer her child for disobeying her so blatantly.  So what do you think? Was i right or wrong?",
    "flair": "Not the A-hole",
    "created_utc": 1761130404.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od4zy0/aita_for_standing_my_ground_against_my_mother/",
    "downs": 0,
    "ups": 54,
    "score": 54
  },
  {
    "post_id": "1od4rzm",
    "title": "AITA for expecting my boyfriend to lock the door (and get the keys after forgetting)?",
    "selftext": "My boyfriend and I are university students living in separate shared flats. We frequently alternate where we sleep. I have an independent key for his flat, but my apartment only has two keys, meaning I can't give him one.  I usually leave for the gym at 6:40 AM. My shift-working flatmate is already gone, so I am responsible for locking up. My boyfriend, a night owl, was asleep when I got up. I forgot I couldn't lock the door with him inside. I woke him, asked him to lock the door after me, and return the keys later at university - something we've done before. I placed the keys right by his phone.  Later, when I asked for the keys, he was completely unaware, having forgotten our exchange while half-asleep. This resulted in two problems:  1. The apartment door was didn’t have the deadbolt in. (which I view as unsafe). 2. I was locked out. My flatmate was only briefly home in the afternoon before leaving again for the night, forcing me to either wait until late for his return or interrupt my study day to rush home for the key exchange.  I was annoyed by the inconvenience and the partially locked door, but I didn't give him a hard time; people forget things. I texted my boyfriend, asking him to collect the keys from the flat and bring them to me at the university library. I felt this was a fair request since he was the one who had forgotten to lock up. He reluctantly agreed.  When he returned the keys at the library, he was angry. He accused me of being at fault for getting locked out and said I shouldn't expect him to listen while half-asleep. Taken aback, I simply thanked him, and he left. He later texted an apology for his grumpiness but insisted he felt unfairly treated.  The next day, he brought it up again. I explained my gratitude for him bringing the keys and my reasoning for asking him to do the trip. He stood firm that it was my fault, insisting I should have just left the door unlocked next time. Feeling his reaction was unfair and an unnecessary deflection of blame, I ended the argument and left.  **AITA for expecting him to lock the door and then asking him to collect and bring me the keys afterwards?**",
    "flair": "Not the A-hole",
    "created_utc": 1761129651.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od4rzm/aita_for_expecting_my_boyfriend_to_lock_the_door/",
    "downs": 0,
    "ups": 117,
    "score": 117
  },
  {
    "post_id": "1od3wxl",
    "title": "WIBTA if I decide to move out and separate finances from my family",
    "selftext": "I am a 30F and my parents have been living with me for the past 5 years (I pay for rent, utilities and most expenses). It is completely out their choice, I don't need them to live with me. I have an elder brother who is married, both of them work. He earns as much as me and SIL earns a bit lesser. But since parents don't live with him, he's not asked to pitch in for any recurring expenses. I don't think he would say no but he's not come forward to pitch in either. Though I don't think he particularly wants to live full time with them. Everytime I have broached the topic, he's dodged it.  My relationship with my father is fraught. While I love him, he still likes to extend control over my life and treat my finances as his.  He's manipulative and everytime I ask him to pick up a few of their bills, he goes \"Oh so you mean you want all of us to go separate ways\" etc.   While he has significant savings, he refuses to get a debit card or credit card or adopt any app that would enable him to make digital payments - sort of a forced financial dependence. He knows how to use all these financial devices and had a good career in the government before retiring. Instead he asks me to make all the payments. If I push back a little bit, he makes a show of \"giving me money because I asked for it\" and guilt tripping me.   I am tired of being manipulated, micromanaged and treated as a child even though I'm the one taking care of everything. I've given up a lot of my social life over the past 5 years because they're quite controlling/need me/manipulative. This is not just financial but in daily life as well. I want to move out and reduce expenses and increase my savings which would make them move in with my brother that too after much guilt tripping bs and me appearing as a the bitch in the family.   WIBTA for doing so?",
    "flair": "Not the A-hole",
    "created_utc": 1761126549.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od3wxl/wibta_if_i_decide_to_move_out_and_separate/",
    "downs": 0,
    "ups": 127,
    "score": 127
  },
  {
    "post_id": "1od3qtj",
    "title": "AITAH for being two faced towards my “friend”",
    "selftext": "This started two months ago, my friend who we well call S gained a crush on my boyfriend. Now he is an amazing guy so I completely get it but her crush has gotten to the point where she has been trying to convince him that I am a bad person when he is struggling with emotions. This has happened on many occasions and it is truly stressful because I sometimes worry that it is going to get to a point where he will leave me because she has become too convincing. She has managed to get my boyfriend to break up with me on many occasions so she has a chance with him. So recently after finding out that she has been telling people the stuff I trusted her to not tell, I have been two faced and only act nicely to her face but me and my boyfriend dislike her but remain “friends” with her.   I do worry though that I am the bad person for this as I know that two wrongs don’t equal a right. Yesterday, I wanted to see if she would go tell my boyfriend what I had vented to her about so me and my boyfriend were telling each other what she said on both ends. Turns out she lied to my face saying she knew nothing (previously my boyfriend had vented to her saying how he believed I was distancing so therefore was acting off with me.) S then went and told him everything I was saying then told me she wouldn’t tell him anything while actively sending screenshots to him. I honestly feel betrayed even though I expect it as S has done this before. AITAH?",
    "flair": "Everyone Sucks",
    "created_utc": 1761125921.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od3qtj/aitah_for_being_two_faced_towards_my_friend/",
    "downs": 0,
    "ups": 1,
    "score": 1
  },
  {
    "post_id": "1od39sr",
    "title": "AITA for ignoring my roommate",
    "selftext": "So for back story i live in a college apartment with 3 other people 1 girl i knew from last year and 2 new girls. The roommate that we all have a problem with is the girl i knew from last year. She doesn’t do her dishes, leaves her junk everywhere, is convinced that people are taking her food when she takes everyone else’s without asking. But we can handle all of that but the really problem is that she is so negative and constantly try’s to turn us 3 against eachother. Things she said to other roommate is that the 2 single ones are trying to steal her bf. Which neither of them are they are just polite and ask him how he is if he comes for the week. She told one roommate that i’m faking my hearing loss for attention. i only wear my hair down and don’t really talk about it much my other roommate just recently found out. and idk how you would even fake that. Made up story’s about roommates to make them sound bad. and so much more she is constantly trying to start drama and make us fight which hasn’t worked. We are all just frustrated and if anyone tries to stop her from saying stuff about other roommates she makes it all about how she had a rough childhood and that’s why she’s the way she is. But that doesn’t excuse the constant lies and bad mouthing. And she isn’t just making up stuff to other roommates she is telling people these lies outside of the apartment. We are all just frustrated with the constant lies about us and her saying that we’re leaving her out when we’re literally talking in the community kitchen in are apartment bc we didn’t knock on her door to come talk to us. It just feels like she wants all of us to revolve around her and she sabotages are other friendships. We have only lived together for 2 months and it’s already miserable. I am definitely so lucky for my other 2 roommates. And just to be clear she wasn’t left out at the start she actually caused the other 2 to not like me originally bc i moved in later but we have figured everything out honestly once we all met we settled and saw past the lies bc i was also fed lies before moving in. So basically aita for avoiding being in the appartment and going out with my other roommates more. and should we confront her?",
    "flair": "Not the A-hole",
    "created_utc": 1761124119.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od39sr/aita_for_ignoring_my_roommate/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1od1z69",
    "title": "AITA for not stopping my friend from snitching?",
    "selftext": "AITA? I, recently came back from this overnight school trip, and a lot happened. I looked really forward to this trip and planned a lot of stuff with my friends( it was the first time I was hanging out with such a big group, around 12 people in total) but somehow everything fell apart, the friend that was closest to me (I will call her Bee for convenience sake) Bee brought alcohol, and took it out in the bus (it was mixed with coke) I knew she could get in trouble but I didn't say much, since I didn't really care if she drank nor did I want to ruin the trip, she passed it to everyone she knew wouldn't mind, including me but I didn't drink, later on when we arrived at the hotel, we all met(all 12 of us) at one of the bigger suites, it all went well at the start and though I felt a bit excluded (my close friend was drunk af and clinged into this other girl idk) a few of our neighbours (also classmates) were scared because someone played the dingdong ditch against them, we found it funny but found no reason to be scared since I mean, we are about to go to college in a year. But those kids called the teachers, who later came to our room and to see if we were the ones behind it..but they chemistry teacher? She smelled the alcohol, she snooped everywhere, even checking the toilet, fortunately noting had happened in that room, and the teacher left with a warning, but my friends got shit scared, since their room had a can of absolute vodka and ciggerate buds in the can, so much so they said they'd bring it here, me and few other opposed that idea cuz we didn't want to get involved in this bs, but I still recommended ways to fix it, later, me, and four other girls (we had a  different room and the fourth one just tagged alone cuz she was too scared) went to our room and discussed this shit, but we heard the door move, one of us thought it might be someone eavesdropping, and then a teacher barged in, and asked who it was, we played dense at the beginning, but they already knew which room it was, and after pushing us for a good 10 minutes, one girl blurted it out in panic, and they went away, now my close friend refuses to talk to me, and says it is my fault for not stopping them( I don't know how I was supposed to since it was all so sudden and I couldn't just shyt the girls mouth right in front of the teachers TvT)  P.s. this is my first time posting here to idek shit  Update:- 😔 past me was stupid for thinking the trip was the worst part, forgot about social boycott. Bee and my other 'friends' that were nearly caught got off scot free, the girl who snitched and I devised a plan to get them out of this situation, and it worked, surprisingly. It didn't change much however and now I sit alone in most of my classes, with a fun sized amount of bullying of course. Friends with the students who weren't involved but they are in another class, I hope school is renamed to the hellhole it is. P.s. I have no clue who to tell this to, so sorry for listening to my near rant/vent :P",
    "flair": "Not the A-hole",
    "created_utc": 1761119077.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od1z69/aita_for_not_stopping_my_friend_from_snitching/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1od1fip",
    "title": "WIBTA if I ban my roommate’s boyfriend from staying the night?",
    "selftext": "First time posting on Reddit cause all my friends are asleep. I roommate (M19) am a college and like many have a roommate. We were randomly assigned and I got a reasonable roommate (F19). She was seeing this guy (M20) and I was fine with him spending the night sometimes. He seemed fine to be so I didn’t really care. Over the past few weeks he has been getting really upset/angry at something (usually something me or my roommate said) with not communication of why, being overall unhygienic, and overly blunt to the point of coming off as a bit rude. I’ve been trying to let it slide since I’m typically not one for confrontation but it’s gotten to the point where sleepovers are a nightmare. Not to get to deep but I am a very traumatized person, so if I do not feel safe around someone sleeping/going to sleep I cannot sleep. I do not feel 100% safe around him and because of this it has made any time he spends the night my own personal hell, this lack of sleep on top of my pre-existing chronic illness has caused me to feel sick. But I don’t want him to feel like he’s not welcome/hurt my roommates feelings as he’s over what feels like a reasonable amount. But I don’t want this to mess with college. So tell me would I be the asshole?",
    "flair": "Not the A-hole",
    "created_utc": 1761116929.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od1fip/wibta_if_i_ban_my_roommates_boyfriend_from/",
    "downs": 0,
    "ups": 7,
    "score": 7
  },
  {
    "post_id": "1od04cq",
    "title": "AITA For getting mad at a game?",
    "selftext": "Hey Reddit this is something that has been on my mind and I feel like I need to share. I(24f) and Tay(23f) have been friends for almost 9 years. I was added to a friend group online by a friend that had her and 4 other people were in. Me and Tay hit it off outside the group and became best friends. I never had any close friends due to being bullied, so having someone I can see as a sister, made my life better. Tay tended to be bossy and when things didn’t go her way, there was a melt down. So to avoid any fights, I went along with her.The group slowly broke off due to a lot of issues but me and her stayed together. Over time I went to go visit her a couple of times and we had a blast everytime.  Then she found this game called phasaphobia. If you don’t know, it’s like you have to go into different maps and find the type of ghost and leave. Well I got into it way more than her and played it when she wasn’t on. I started getting better equipment and leveling up fast. The next time we got on and she saw how much I played, she told me that she wants to only use her level equipment because if she used mine, she considered it cheating. I said it’s fine and it didn’t bother me because I didn’t have that much upgraded anyway.  Over time, I played it more and more and got way better at the game and can see the the higher the equipment, the better it was to find ghosts. I was at least at level 40 and she was still at only level 12. So the next time she decided to play, I told her,”hey I noticed the higher equipment makes things easier, why don’t we use my equipment since I have a lot of money to spend?”. She blew up saying that no it’s cheating and we need to do it with her equipment and that if we don’t then she won’t play.  I told her she’s getting worked up and that it’s not cheating that I wanted to use the higher equipment. She started saying I was disrespecting her boundaries and that I didn’t care how she felt. That resulted into a screaming argument and I told her that she needs to chill it’s just a game and that I’ll talk to her in the morning once she calms down. She yelled saying if I hung up then it’s over and I told her fine and ended the call.  That was over a month ago, AITA?  Edit: I read what you guys said and that there’s a couple things isn’t wanted to say and also I didn’t say what was said in the argument because I didn’t know if Reddit had a limit or if my post would be taken down. I have only bought it up twice, so I always played it how she wanted to play it. The second time I was trying to tell her that the higher equipment was better and I had more money so was trying to help her level up. Also I just wanted her to at least try it once because I wanted to try it my way like how we play it her way. In the argument, i did try to compromise and I asked “ok we can use the lower equipment but can I at least use the level two spirit box because it’s always me using it?”. She refused saying that EVERYTHING needs to be level one and that it needs to be her way. I tried asking why couldn’t I use just one thing and she wouldn’t listen. This isn’t the first time we fought like this but that’s different stories",
    "flair": "Asshole",
    "created_utc": 1761112047.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1od04cq/aita_for_getting_mad_at_a_game/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1oczlwb",
    "title": "AITA that is going to schedule my birthday trip over my friend’s bachelorette trip?",
    "selftext": "I (29f) grew up with and continue to make multiple friends from all different walks of life to the point where the movie “27 Dresses” could be a biographical film of me in my 20s (minus the ending).   I love all of my friends so dearly and work so many hours that I never prioritized meeting the “one”. Or at least never felt like I needed to prioritize a man when I have created such a good life for myself. I do however prioritize them.. my friends. I have traveled for weddings, birthdays, baby showers, you name it. And often times, at a great cost as I travel for work so am literally across the country compared to the majority of the girls but it didn’t matter because I love seeing them. Obviously, with that being said… celebratory things like weddings and babies just don’t seem to be in my future (as sad as that makes me feel). However, I don’t fault people for choosing that path… including my friend (30f) who got engaged last year.   Now to preface, after college/later in life, I met (let’s say) “Sadie” by being a high school friend of one of my best friends. I love Sadie - she is so kind, funny, and I truly wish her the happiest married life. But I’m not actually in this wedding, and was invited to the bachelorette trip in the same group as I’m always in with a group of all of our close friends (who mostly all are in serious relationships / already having babies). The majority of them, however, are in the wedding.   Prior to Sadie scheduling her bachelorette date - I texted the group acknowledging I won’t really have many reasons to celebrate me like stated above. So I want to have a weekend for my 30th coming up and wished they’d all be there. The friend group has been best friends since high school and I joined them maybe less than 5 years ago. My birthday falls before a big holiday so I take that entire week off every year to travel home to take less PTO. However, I wanted to travel out of country/do a destination for this big milestone in my life. A week or so ago, we all FaceTimed and they agreed that those dates would be the perfect date for everyone to celebrate Sadie and to be completely honest, I agreed. She deserves to be celebrated, but a part of me feels like I do too. I didn’t mention how those days fell on my plans, or that I was unsure I was going to make it because of my birthday. I don’t think they were working in a hurtful way maybe they just forgot. I don’t blame them.   Is how I am feeling valid enough to schedule my trip (with some of the other walks if life I’ve mentioned (my other best friends from high school, college, work, etc.) and just make sure I make Sadie’s wedding, or let go of the whole birthday celebration and celebrate Sadie? Am I wanting a village, but not wanting to be a villager?   TIA   - Jane from 27 Dresses",
    "flair": "No A-holes here",
    "created_utc": 1761110183.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oczlwb/aita_that_is_going_to_schedule_my_birthday_trip/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1oczhuk",
    "title": "AITA for telling my mom she should have stayed in California?",
    "selftext": "Hi, I’m [22 F] new to Reddit so please forgive me if my post is not up to Reddit standards. I wanted to ask if I am the asshole for telling my mother she should’ve just stayed in California.   Basically, she went on a week and half long vacation with her fiancee and while she was gone, I took care of my three younger siblings who are 14,16, and 18. This means sending them to school and work outside of our usual driving to hang out and things of the sort. I don’t mind doing this, I love my siblings and although gas is expensive and I’m not really making that much money, I do what I can because I know there is no one else to help.   We had a really peaceful week; we all delegated tasks and knew what chores to do and yes they fought here and there, but it was actually really nice to have them both gone. I picked them both up from the airport tonight and I already knew it was going to be bad when we got home.   I will admit, I didn’t do some things my mother wanted me to do before she left (moving some of my new furniture downstairs into my room), but other than that, we kept the entire house clean and even cleaned and cooked before she came back to make sure when she came home it would be less stressful.   My mother and her fiancee ate dinner but I could tell she was already in a bad mood, which is understandable after a long flight, but when she got out of the shower and saw my little sister looking for her AirPods rather than being asleep (it was only 10:30 pm) she just kinda went off on us both. Talking about how she does too much for us and how she should’ve just stayed in California and how we didn’t even clean the bathroom.   My younger sister told her that yes she should’ve just stayed over there since she clearly doesn’t want to be here and I will admit I felt hurt, this isn’t the first time she’s done something like this after being away. I told her that the next she time she leaves to go on vacation or wherever she goes to just stay until she’s happy or just not come back at all because she always does this and it drags everyone’s mood down and that we did our best to keep the house clean and that I don’t know what it was she wanted from us but it doesn’t matter because she’s like this every time she comes back.  She didn’t say anything and now I am wondering if I am the asshole for saying those things?",
    "flair": "Not the A-hole",
    "created_utc": 1761109794.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oczhuk/aita_for_telling_my_mom_she_should_have_stayed_in/",
    "downs": 0,
    "ups": 464,
    "score": 464
  },
  {
    "post_id": "1ocz9b1",
    "title": "AITA or did my ex mother in law overstep?",
    "selftext": "AITA? Needing some opinions if I am in the wrong here. I have been divorced 3 years this November. My ex mother in law and I don’t really have a close relationship but we are always civil and I make sure my son stays very involved with her as a grandmother. My ex mother in law is a Realtor and I looked at homes with her in April but decided to wait and keep saving. Since then, I have been having issues with my ex husband (I started dating again in may and he’s livid) and so it has resulted in distancing myself from his family over the past 6 months due to their very vocal opinions of me dating again after 3 years of being single.  I started looking at home again for various agents and last week I reconnected with the builder (she introduced me to in April) and signed a contract on a home he’s building . My son was very involved in this and out of excitement let his dad know we are buying a house. Long story short, my ex mother in law found out and called the builder behind my back demanding to be added to the contract to get a commission (went on for 48 hours before I found out) The builder obviously could not do this because one, she was not physical there when the home was shown and she is not representing me. We never signed a buyer/rep agreement. She tried emailing one that was back dated but I refused to sign one, to me that is unethical and dishonest. I was very thankful she took the time back in April to show me 2 homes but we were in such a different place in our relationship and I also want to add she repeatedly told me she was going to waive her commission and put it toward closing costs. She harassed me for days over this and my ex husband withheld my child from me and we missed a paid for vacation last week to visit family (we have a decree but have never followed it) so since it was technically his time I lost out on the whole trip. I have been told they will no longer help me when needed etc etc. After not being to see or speak to my child for days, I called the builder and begged him to add her because of the drama it was causing which he declined to do so on ethics. As of today I backed out of the home, it was a week of emotional turmoil which I thought buying my first home as a single mother would be a happy time. It is. Is being spun by my exes entire family I did her wrong and karma will be paid back. AITA for not getting her back involved?",
    "flair": "Not the A-hole",
    "created_utc": 1761108992.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocz9b1/aita_or_did_my_ex_mother_in_law_overstep/",
    "downs": 0,
    "ups": 32,
    "score": 32
  },
  {
    "post_id": "1ocz866",
    "title": "AITA Told a kid it was time to take turns,on a playground, over a one of a kind swing.",
    "selftext": "Old playground, new equipment. The area is suburban. Grew up literally 3 houses from this park. Myself (41f), my son (8m), husband(42m) and dog were all at park.   I was attending to my son on the playground, he wanted me there, nearby, to take pics of his jumps.  He pointed out a specific swing there is only one of on the playground. Ppl were on it. We played on other things. I waited for it while he swang some more. It became available and I went to get it.  A younger girl met me at the swing doing the same thing. My son was just getting off the other swing l, so I told her, you go ahead, I'll get next.  Cut to 25 minutes later, and her and her cousins really seeming to enjoy watching me wait. No concern for my kid who is now plopped down, as we've now done everything else and still waiting.  My husband has also now been watching us wait while with our dog at a table.  Finally, the young girl I initially gave a turn to started to get off, so I go to grab it. She says, no,  we're not done. I say, ladies, we've waiting 25 minutes. They say another friend wants a turn, I say she needs to wait until my son and i were done. They flat out refuse.  I tell them, no really its our turn. And older cousin (all these girls are likely 10-17) starts yelling in my face saying I can't talk to them, their children etc. Finally their moms come over,  start yelling at me, repeating their daughters, that I'm talking to children, how dare I. I was stunned they flipped, totally ignoring their children were acting like little brats.  I just walked away at tjat point, they weren't going to hear my side that I was simply trying to be a village cause their children were not taking turns. I got in the car and bawled my eyes out.  Silver lining, my husband and son went back and my son got his turn.  But my god, I really don't think I was  in the wrong, I have a 13 year old and would have wanted someone to tell him to let other ppl use the equipment.  Still, AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761108885.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocz866/aita_told_a_kid_it_was_time_to_take_turnson_a/",
    "downs": 0,
    "ups": 3,
    "score": 3
  },
  {
    "post_id": "1ocz1oz",
    "title": "AITA for hanging out with my cousin’s ex?",
    "selftext": "For context, My cousin, Bryan(24M) had been dating his gf, Melissa(22F) for around 3 years. Over this time, I(21F) had gotten closer with Melissa when we saw each other at family gatherings and such. Whenever we saw each other, it was always a good time. We have similar interests and senses of humor. They seemed like they were end-game despite them being very young. I guess i just assumed they were happy with each other and that wasn’t gonna change very easily. They even bought a house together and shared the mortgage. That’s why I felt it was set in stone. They came up with baby names, everything promising they could’ve done.   Long story short, she broke up with him a month or two ago. I could give you all the details on both of their sides of the story if you want but I basically chalk it up to it just didn’t work out, and they were young and it’s okay that it didn’t work out. They both weren’t happy in the relationship because Bryan tended to be jealous and overthink. Melissa felt controlled by him. You know the classic situation where insecurity pushes two people apart from each other. Anyway, Bryan is very tore up about this and has confided in me when we hung out the other day. His siblings and parents have all alienated her from the family because they automatically took his side when they heard the news. Even sending Melissa hostile text messages telling her she “fucked up” and even my aunt telling her to “fuck right off”.   Messy, I know.  I’ve been on the fence on whether or not it would be okay for me to hang out with Melissa, given the situation. On one hand I don’t want to disrespect Bryan because of it all but I also didn’t want to completely drop Melissa just because she broke up with my cousin. I can’t really figure out how to toe the line between the two.   Well tonight, I made plans to hang out with Melissa. We went to a pub in town and got food and some drinks. Bryan figured out that we were hanging out and texted me and asked if Melissa was at the bar tonight. I told him the truth about it and now he’s very upset with me. He said he could never hate me, but he would never do that to me. Saying I knew how depressed he’s been about it and he just didn’t expect that “after how horrible she’s been”.   But AITA for hanging out with my cousin’s ex?",
    "flair": "Not the A-hole",
    "created_utc": 1761108289.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocz1oz/aita_for_hanging_out_with_my_cousins_ex/",
    "downs": 0,
    "ups": 5,
    "score": 5
  },
  {
    "post_id": "1ocyuht",
    "title": "AITA sister in law drama",
    "selftext": "So my husband and his family are going through a soon to be death in the family (their mom is dying from alcohol abuse) I’ve had an appointment set up for over a month and my husband is missing work to watch the kids because they can’t go and I have nobody else to watch the kids. We have four. 1 will be in school. So they knew about the appointment that I’ve already had planned and they decided that very same day and time to make the appointment to sign cremation papers together. Which by the way you can tell them anytime that works for you. They got really mad that I didn’t cancel my appointment and called me selfish, but to me both of the things can be done the same day. After he told them I was not cancelling they made it to 1 instead. Was 12. Which is something they could’ve done in the first place, but didn’t want to I guess. I just found it weird I was the bad guy, but they seemed to have planned everything down to the very hour I had something going on. And no he doesn’t have any plans to see his mom in the hospital anymore. The appointment they made and got mad about was strictly to sign cremation papers.",
    "flair": "Not the A-hole",
    "created_utc": 1761107594.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocyuht/aita_sister_in_law_drama/",
    "downs": 0,
    "ups": 14,
    "score": 14
  },
  {
    "post_id": "1ocyr6h",
    "title": "AITA for \"throwing a fit\" after my mom got mad at me?",
    "selftext": "Posting this before I go to bed maybe regret it tomorrow morning anyway, for some context: I live in an Asian household and like the stereotypes my mom has always been a straight-A student and top of her school, my older sibling has always been praised for being super smart from a young age. Me? I struggle with school. I wasn't always like this, and my grades aren't bad, they're just not all As.   I've switched to online classes and so my mom said that I shouldn't have bad grades or missing work etc. I've been doing good so far, I've had some missing assignments here and there but end up turning them in late (but no late penalty) and my assignments are always in the range of 85%-100% but for some classes even with those percentages the total grade is like a D or C (It's a whole thing) I told my mom about it when she asked about my grades, she agreed it was strange.  One night after I when out with my friends she yelled at me for not turning in all of my assignments and etc same conversation from before. She kept switching what she was mad about every time I tried to explain myself. She told me no going out unless I turn in all of my assignments. I did all of my work and then I thought that was the end of it.  Since then, she would constantly ask about my grades. It gets on my nerves. She's been asking about literally nothing but school work, so obviously whenever she mentions school again I get a little agitated, but I don't want to get in trouble I don't say anything. When I get agitated I close my door a little too hard, or I walk a little too loud, and etc. So she would say \"why are you so mad?\" and \"I guess I won't tell you to do anything\" (Not exact words but I can't exactly translate it)  Today was when things sort of \"blew up\". Not sure how it even started but basically, my family (mom, dad, sibling) sat me down and said I need a better schedule/routine and etc. They told me things as if I could follow routines best fit for them, and maybe I could but it wouldn't be best for *me*. Later my mom and dad were talking and asked me why I was \"throwing a fit\" (not sure what they word they used is in English but that's close to it) and I said that I'm allowed to have emotions. Later my mom came into my room and asked why I'm mad at her, then I blew up. I told her, while sobbing, that I'm tired of her always talking about school and that I'm really trying my hardest, and that I can't take it whenever she talks about school. I told her that she hasn't talked to me about anything but school. She completely missed the point, she kept telling me that she has to so that my grades would be better. I honestly don't know what she was talking about because I was so shocked at her response. She ended the conversation with \"I'm too scared to even talk to you\" (another rough translation). Me and mom are super close, the post may not seem like it but it's true, I love her more than anyone. That's why I don't know what to do, so am I the asshole?",
    "flair": "Not the A-hole",
    "created_utc": 1761107281.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocyr6h/aita_for_throwing_a_fit_after_my_mom_got_mad_at_me/",
    "downs": 0,
    "ups": 2,
    "score": 2
  },
  {
    "post_id": "1ocymtn",
    "title": "AITA for wanting to rehome our cat.",
    "selftext": "My fiance and i adopted a cat back in march. My fiance really connected with her, i didn’t as much but felt i liked her enough and felt confident i would bond with her and wanted my fiance to have what they wanted.   fast forward to now and i do. not. want. her. i know. i feel terrible. i never thought i could feel this way as a pet owner. i’ve had a cat before, up until she died last summer. she was my baby.   i of course would want to find her a loving home with someone who had the capacity to care for her and give her more attention. I just have a feeling she is not happy here.   She has been peeing outside of her litter box for about two months. she chose the couch as her spot to pee, and now is peeing on our bed, too. We’ve done nearly everything. Been to the vet multiple times, tested for UTIs etc, pheromone plug ins, pheromone collar, twice daily gabapentin, multiple calming supplements, CBD, extra play time, rotating toys, puzzle toys, feeding her in the spots she’s been peeing, clean litter box daily, etc. i’ve even been extremely aware of my mood and the way i interact with her. speaking kindly and being patient and giving her positive reinforcement. she has a window hammock and tall cat tree and hiding places and scratching options. we even bought a whole new couch. We have even seen TWO different psychics/mediums. Our last option, per the vet, is to try prozac. will obviously try that.   but i am losing sleep over this and its causing so much stress, i am not comfortable in my home. we cant use our couch. we have to be monitoring her at most times which is difficult. not to mention all laundry and hundreds and hundreds of dollars this has cost us in such a short period which we can not sustain. we have travel plans at the end of the month, november, and december. i dont feel like we can leave her.   the cat clearly isn’t happy and idk what to do. AITA for thinking maybe she’d be happier somewhere else? with someone who is home more? on a farm? ahhhhhhh",
    "flair": "No A-holes here",
    "created_utc": 1761106885.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocymtn/aita_for_wanting_to_rehome_our_cat/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocxijb",
    "title": "AITA for getting upset over a gift my mom sent for my birthday",
    "selftext": "My mom has always been a pretty bad gift giver, but this has to be the worst, I’m an only child &amp; I’m now expecting my first so for my birthday she sent two baby outfits one that her coworker got from tj max, and a couple of baby books and left all the tags on including the one that was on clearance. She then wraps a coloring book from tj max &amp; some color pencils from the dollar store in some tissue paper with my name on it and puts it at the bottom of the box. I just turned 29.. Idk if it’s my hormones but the low effort she put into this gift really upset me. She also forgot to say happy birthday &amp; then forgot what age I was turning. When she called me to ask how I liked everything I couldn’t help but tell her I was a bit disappointed especially because just last night she went on about how she just bought herself Birkenstocks, she also knew I really wanted a diaper bag &amp; would’ve been happy with that. AITA for being upset, i feel ungrateful but I just wish she tried a bit harder.",
    "flair": "Not the A-hole",
    "created_utc": 1761103449.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocxijb/aita_for_getting_upset_over_a_gift_my_mom_sent/",
    "downs": 0,
    "ups": 68,
    "score": 68
  },
  {
    "post_id": "1ocxi06",
    "title": "AITA for giving an honest opinion?",
    "selftext": "My partnergot a hair cut over the weekend and we didn't see each other until Monday. When we finally met up and I was able to see his haircut I didn't love it because I personally prefer longer hair on him, but, obviously I didn't mention anything about not loving it. (He definitely knows that I like longer hair on him and he has accepted my opinion without any sort of trouble or fighting). A couple minutes later he asked me what I thought about his haircut. He can get very sensitive about his haircuts, so I made sure that I was able to give him my honest opinion without saying anything that could be misconstrued of taken the wrong way.  Finally I ended up telling him: \"It's not my favorite haircut but I think it looks good!\". At first he didn't take this the wrong way, we kept talking like we normally would. A couple of hours went by and he got extremely upset with me. He said that even if he asked me what my opinion was I shouldn't have told him that. He said that the only thing I got out of telling him I didn't love the haircut was hurting him, making him feel insecure, making him feel like he was ugly and like I didnt want to be with him. He even went to the extent of saying that I was gonna have to wait a couple of days to go out with him till the hair grew out because apparently I hated it that much (which is definitely not true). He said that I was making him feel like I didn't find him attractive anymore.  To a certain extent I do understand why he got upset, but I think that I was respectful and honest without being hurtful or mean. I love him and no matter the haircut he gets that will remain true.",
    "flair": "Not the A-hole",
    "created_utc": 1761103407.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocxi06/aita_for_giving_an_honest_opinion/",
    "downs": 0,
    "ups": 4,
    "score": 4
  },
  {
    "post_id": "1ocxfuv",
    "title": "AITA My puppy passed away..",
    "selftext": "For context, 2 years ago I move out of my friends house (6of us) into my bf house. It became an argument that I couldn’t have my puppy in the new home and I told him that that was not spoke about and this relationship will not continue.. then what happened was I couldn’t move back into her house (for obvious reasons too many people) I moved into an apartment with a family member of theirs to which was really adamant that he didn’t want her here for specific reasons (she was losing her bowels) anyways AITA because I open my phone up to a text message from my friend that my puppy was put down sometime in the afternoon that day and she didn’t want to upset me. I’m more upset that NOONE called me to tell me what was going on and happening we have had many discussions about when the day would come and what I’d like done with her body.. to opening a. Text at 1am (I work nights) to find out my dog that is 16 years old died roughly 6 hours before I was told anything.  I entrusted this person to care and love and take care of her am I wrong for being upset that no one told me anything. ;(",
    "flair": "Not enough info",
    "created_utc": 1761103226.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocxfuv/aita_my_puppy_passed_away/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocxfcj",
    "title": "AITA for not switching rooms?",
    "selftext": "Last year, I was placed with a random roommate (R1) in a very small double room. Her and I got along very well, and ultimately had no issues. Throughout the year, we met two other people (R2 and R3). These two each lived in separate suits with their own room. We were all paying the same price for first year housing.  We decided to room together this year in a 4 person, 3 bdrm apartment. There is a larger double room and 2 smaller single rooms. Originally, R1 and I were to share the double for first sem and for R2 and R3 to share second sem. It was important for R1 and I that we got it first semester, because we didn't want to have to go back to a double after adjusting to a single.  This summer, R2 and R3 lived together in the same room (same bed) for 2-4 nights a week. During this time, they offered (without us asking) to take the double for the entire year because they enjoyed living together, and naturally R1 and I agreed. At this point, we were all very close friends, and I acknowledge how naive this sounds.   A few weeks in to this sem, R1 and I realized, for a variety of reasons, that 4 people living together was too much for us. We communicated this to the other two girls and they were upset but ultimately fine. R2 also found and signed a lease with other people. R3 didn't have other plans, and felt like she was abandoned. R3 asked R1 and I if we could live together, but we gently informed her that we were already looking at 2 person apartments and she should probably try and find her own accommodations.   R3 became a distant, and I know she is really hurt that we aren't all living together next year. I'm sure she feels abandoned by the people she thought were her best friends. She's since found roommates for next year, and we interacted fairly normally if not a little distant until Sunday when she said she wants to switch rooms second semester. We had a meeting and she said she feels like she offered too much in making that agreement, she didn't like the double as much as she thought she would, and she was avoiding the dorm because she didn't feel like she has a place here.   Ultimately, R1 and I said no to switching because it's what was agreed to and the problems she has with the double are things that are known about doubles. I don't want to make excuses, but I have always had bad sleep anxiety, and I cope by making my sleeping environment a certain way. This is way easier to do in a single, and I had become settled with the idea that I would be staying there for the whole year -- this stability was really important to me.     I've been feeling very guilty. I'm usually empathetic and that's not how I acted in this situation. In principle, the room is mine, but emotionally I'm not acting like a good friend. I know her desire to switch is a result of her being hurt about next year, and I want to have a conversation about how we don't have to stop being friends, but I don't know if that will make it 'right'. So, AITA for not switching?",
    "flair": "Asshole",
    "created_utc": 1761103182.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocxfcj/aita_for_not_switching_rooms/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocwquw",
    "title": "AITA for thinking coworkers need to stop taking offense and just get to work?",
    "selftext": "I (24F) work at a logistics company. I’ve worked here since I was 21. My current position is CSR which requires a LOT of communication between departments to be able to triangulate/coordinate loads as efficiently as possible.   With that being said, the past year has been so annoying and uncomfortable to deal with. I began to notice that a lot of my coworkers will give me side eye/roll their eyes, stare me up and down, or just simply talk to me like shit when I approach them with work.  One thing about me is, I will not bother you unless there is work to do. I will not go out of my way to chit chat and whatnot so I think people get offended at the fact that I do not show them interest in that way. I will simply greet them, ask for their help with whatever task the client is requesting, and ask for an estimate of completion to pass to the client. I will, occasionally ask them if they’re okay if I see they’re sick, crying(especially the girls), or simply not their usual self. I know how that feels all too well since I went through chemotherapy 2 years ago and a lot of them saw me at my worst so I always try to look out for them in that way.  But I really hate how it all has become. A lot of them will say to my face “Get away. All you do is cause headaches.” Like bro, what? First of all, that’s hurtful to say to someone. Also, Im coming to you with work because we are, quite literally, AT work! We are getting PAID to do our jobs. I always ask them in a very kind, respectful, and professional way for them to say those snarky comments.  I also have been getting accused lately of sleeping around with these 2 guys at work that are around my age. They both have very important positions there at work and one can say they’re attractive in their own way but personally, HELL no. They’re both engaged (and Im a girls girl all the way) and we’re at work- I do NOT like to get involved with coworkers. Not to mention that they’re also not my type :) They both have told me of the advances a lot of the women there have made towards them but they flat out tell them no and draw boundaries with them over and over again. These 2 gentlemen often join my lunch table in the break room since we all get along and I’m one of the few that makes them feel comfortable since Im not throwing myself at them.   I have like 5 coworkers total(out of 100+ employees) that have actually become my friends and who I love dearly for their genuine friendship. I just know that some people dont know how to differentiate work and fucking around. I also grew up hearing my dad saying to always set a fine line between work relations and friendships. Point is: regardless if its because I dont want to be friends with the majority at work or if because I eat lunch with 2 people that the rest of the building wants to also eat with- I think that should be separated entirely. Like seriously, get over it and get to work.  AITA for thinking that?",
    "flair": "Asshole",
    "created_utc": 1761101164.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocwquw/aita_for_thinking_coworkers_need_to_stop_taking/",
    "downs": 0,
    "ups": 10,
    "score": 10
  },
  {
    "post_id": "1ocuk3q",
    "title": "AITA for asking to get a door on my lock",
    "selftext": "Am I the asshole for yelling at my parents for not letting me get a lock on my bedroom door   A little bit of background I 19 F just got a BF and he has been coming to my house pretty often (like once a week) I asked my parents if I could put a lock on my door because I don't like them just barging into my room when I'm playing video games and stuff or when I'm trying to sleep.  And they flat out refused, I even said I would buy it and install it.  My dad even said I will rip off your door if you put a lock on your door. Mind you I am a 19 year old woman who pays $400 a month in rent to have privacy in my own bedroom. I'm just so mad 😡   I would love any advice and if you need more information just say  I also do have a job, and I go to school full-time I cannot afford to get a full-time job so if you're saying that just don't  And if you're telling me to move out I can't",
    "flair": "Not the A-hole",
    "created_utc": 1761094863.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocuk3q/aita_for_asking_to_get_a_door_on_my_lock/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1octsoi",
    "title": "WIBTA if I tell a friend tat I have too many problems with her birthday plan?",
    "selftext": "I(20F) have a friend (20F) whose birthday is coming up in 2 weeks. We live in a Dorm with strict rules(in-time and stuff), and she decided that she wants to stay out for her birthday+weekend, her birthday falls on a Friday so she is planning a full 3 day thing in the city. There are a few problems with it.  First one is that my parents are definitely not okay with this, she is asking me to lie to my parents about it and go along with her plan. Her point is I have gone out multiple times by lying to my parents, which is true but I have never stayed out all night, all of them were day things.   Evey time I try to bring up the fact that I am uncomfortable with the plan or I won't be able to join, she starts complaining that everything is wrong in her life and her birthday is also going to be ruined.   While we have other friends who are in on the plan, she will cancel her plans if I am not going, but I do not wish to lie to my parents about this. I am in a far away city for my uni, where they do not have people they know. They have entrusted me with my own safety and they trust that i follow the rules they have set for me. I do not wish to break that to such an extreme degree.  Second is, the plan is expensive, she is paying for some portion of it but I have to manage the rest myself. Her parents are giving her extra birthday cash, mine won't be giving me money for her birthday. My spending this year has already been quite high so I barely have much left and there is still more than a month before I can go home for Christmas break.  Third thing being her plan is to crash at a friends place, who is completely fine if not overjoyed by the idea. I am not fond of that person, it's not that i have a dislike to her it's just that i find that person extremely annoying. The point is she does too. She talks bad about her, makes fun of her, laughs when other people say something bad about her, but also invites her many times to hangout with us and stuff.   Recently the same thing happened and I feel bad for the girl as she always agrees to whatever because she doesn't have many people she could consider friends.  I do not know how to approach this anymore. The only way left is to tell her straight that i cannot join her in her plans even though it would mean she will have to cancel everything.   While I am sure my reasoning is good I know this will completely ruin her birthday. She has had a lot of problems she is facing recently so she will feel horrible about it.   I just need an opinion whether it is reasonable for me to go through with it or would I be the asshole if I did.  **TLDR**: My friend wants to have a 3 day celebration for her birthday as she is feeling down these days but due to my parents, money and people in the plan I do not wish to. But if I do not go it would mean she cancels the plan, WIBTA if I am the reason she doesn't celebrate her birthday.  **Additional Info I was told to add:**   My dorm will need permission from my parents if I am going out.    I come from a country where traditionally women were married off young and not sent out of homes for education.   So most dorm or such places are 'responsible' for the safety of the students staying there, so to make sure that if something happens to the student they aren't held solely responsible, they confirm with the parents that they know about the plan or whatever.  It is much lenient for guys, but for us we have strict rules we need to adhere to.",
    "flair": "Everyone Sucks",
    "created_utc": 1761092767.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1octsoi/wibta_if_i_tell_a_friend_tat_i_have_too_many/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1octrmz",
    "title": "AITA for smelling like weed in my brothers house?",
    "selftext": "I moved in with my older brother(26) back in July. Before I even entertained the idea of moving in with him I made it very clear that I am a user of the devils lettuce. I told him that I would never smoke inside and I have stayed true on my word. He said he had no problems with it and so I moved in.    Today I went outside and smoked a joint that, admittedly, definitely had a stronger scent than I expected. I smoked it a solid two hours before he got off of work, thinking that the smell would be gone by then since it usually was. I never want to inconvenience him in any way so I tried doing it nice an early.   My bedroom is directly next to the back door, which we all use to get into the house (I always have a ton of fans on in my room for circulation and I was hoping that would help with the smell). And so he comes home and walks into the house and not even 10 seconds goes by and I hear this exaggerated gaging sound come from him. And then he just walked out of the house and he hasn’t been back in 3 hours.   He’s always been super passive aggressive and condescending about everything, but I’m wondering if I’m actually the AH here since I’ve never been in a situation like this.   EDIT: To clarify, I only smoke outside, my brother explicitly said it was okay as long as I didn’t do it indoors. I gave it 2 hours before he even got off of work. I shower daily and I wasn’t blowing smoke anywhere near the house, I stood out by the garage like I always do. I think it was just a strong strain and the smell lingered more than usual. I wasn’t trying to make anyone uncomfortable.  EDIT 2: we talked and he explained everything. So, he had a long day at work, he works at a middle school and some kid literally threw up on the floor so he was already having a bad day in general and he was super sensitive to smells. He told me that it’s literally never bothered him before and it was just a one time thing and he wasn’t actually mad because there was no way I was supposed to know he had a bad day.  Also the reason he left was because he was going to go play DnD with some friends and that’s why he was gone for 5 hours. I told him about the Reddit post and he laughed at everyone assuming that it was automatically a tie breaker for me to smoke given the fact that I literally told y’all that he said it was okay.  So, to all of the pot haters: you all can suck a dick and hopefully chill out a little.   -Stoner sibling OUT 🙏",
    "flair": "Asshole",
    "created_utc": 1761092688.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1octrmz/aita_for_smelling_like_weed_in_my_brothers_house/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1octkde",
    "title": "AITA for changing my daughters middle name",
    "selftext": "Sorry about the long post guys, but this one has been eating at Me. I 31F and my husband 34M are expecting our first baby in March. We found out really early that we’re having a little girl and are super excited. However, there is the problem of my mother-in-law for backstory my mother-in-law 57F has some serious control issues to the point that she hijacked our wedding and basically tried to make it what she wanted and now has effectively ruined most of the baby milestones. We haven’t announced the pregnancy yet she decided to go tell the family herself when we found out the gender. We told her and told her she to keep her mouth shut. but it’s her first grandbaby and didn’t wanna keep it from her. Well that’s where the problem started. We wanted to do a gender reveal party mother-in-law tried to hijack that event again and forced us to do it at a location that we weren’t comfortable with at her sister‘s house because we stated we didn’t want to have the party there queue World War 3. She got over the drama after my husband the saint that he is snapped on her. Now comes planning for the baby shower once again trying to involve her sister who we have no relationship with. We asked that the only stipulation we had was that we got to do the food for it because we are both chefs queue the next meltdown. Now his father 69m decided to get involved as he enables his wife. Husband and FIL get into a huge screaming match, because that was our only concession. Well this is where I may be the asshole. When we found out the gender, we decided on names we picked something non-familial for her first name and her two middle names were going to be my grandmother’s middle name and MIL’s middle name. Since she has caused all this drama, I told my husband I don’t want MIL’s name attached to our daughter as MIL has a tendency to be vindictive, cruel and narcissistic. Husband agreed and we have since decided that daughter’s second middle name will be my husband’s now late grandmother’s name am I the asshole for changing my daughter’s middle name?  Edit for context: I’m done I will not control my husband’s relationship with his parents but I’m done I wash my hands of them they will not have a relationship with our daughter and I give not a single crap. I will not subject my innocent child to that type of manipulation. Abuse, or behavior, I don’t agree with her way of being and will not allow that as an influence on my child. Period. I don’t tolerate poor behavior from my own family I will not allow it from his at all. They will get no information at all and hubs is on my side 100% we hate it has come to that but actions have consequences",
    "flair": "Asshole",
    "created_utc": 1761092133.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1octkde/aita_for_changing_my_daughters_middle_name/",
    "downs": 0,
    "ups": 54,
    "score": 54
  },
  {
    "post_id": "1octgq7",
    "title": "AITA for finally kicking my roommate’s boyfriend out after he kept stealing my stuff??",
    "selftext": "**burner account and fake names so i don't get caught**    y’all i am LOSING my damn mind. me (26f) and my roommate tessa (27f) have been living toegther for a year and everything was going fine. then she starts dating this motherfucker eli (30m, big ass 6'4 dude) about six months ago. at first i was like maybe he’s chill maybe he'll help with chores. then suddenly he thinks our apartment is HIS HOUSE. he’s here almost every night, sleeping on my couch, eating all our food, and showering. like bro??? you're not paying for all this shit 😭😭    first it was litttle stuff. snacks gone. my expensive shampoo? gone. my iced matcha latte that literally has my name on it? gone. chargers? gone. ok fine whatever maybe he's a little slow. then i straight up told him “stop taking my stuff” and he laughed in my face, like fucking CACKLING and said “oh i thought it was for both of us” LIKE WHAT. no. my shit is MINE. i pay for this. MY SPACE. leave me the fuck alone.    then it got worse. my feminine wipes? gone. Secret deodorant? gone. and THEN… MY UNDERWEAR. yes. MY FUCKING UNDERWEAR. i confronted his ass but he didn’t laugh this time. oh no. this time he tried to play it off like he was “just borrowing it” and said “it’s soft i like it” like bro what the actual fuck. at this point i am picturing every way to kick this man out but i can't cuz he's FUKCING 6'4 LIKE WHSAT AM I SUPPOSED TO DO??? i feel violated. i feel gross. i feel like he sees my stuff and my body as public property    and y’all last week i come home from work and HEs SITTING ON MY COUCH WEARING MY HOODIE (which is like 5 sizes too small for him btw) and eating MY leftover pad thai. i crash the fuck out and tell him to get the fuck out. i am DONE. he rolls his eyes and goes \"yo chill its not that deep ”. MOTHERFUCKER. NO I WONT CHILLL. YOU ARE A DISGUSTING BASTARD WHO THOUGHT HE COULD STAEL MY SHIT AND GET AWAY WITH IT.    eventually he leaves after i yell at him for a couple hours but i was genuinely SO pissed off like ive never been this mad at someone and now that i think about i said some REALLYY fucked up shit to him which i dont want to say here and now i feel kinda bad idk. i promise im a good person ok?    and then tessa comes home and loses her shit. she's screaming at me like i'm a crazy woman and that i might be the reason they break up... girl what 🧍‍♀️    **TLDR**: roommate’s boyfriend has been at my apartment constantly stealing my snacks, skincare, feminine products, and generally violated my space and autonomy as a woman. i finally kicked him out after he got too comfortable but now my roommate is mad at me. AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761091848.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1octgq7/aita_for_finally_kicking_my_roommates_boyfriend/",
    "downs": 0,
    "ups": 615,
    "score": 615
  },
  {
    "post_id": "1octeus",
    "title": "AITA??) My best friend left my 18th birthday party for a boy..I don’t know if I can forgive her",
    "selftext": "One of my best friends I’ve known since grade 8 got with a boy in the beginning of June and didn’t tell any of us in the friend group  We are a very close knit friend group. She kept dismissing our hangouts and ghosting us during them, despite her planning most of them just to hang out with him.   Due to a strict family, she is not allowed to see him or any relationships. At my 18th birthday party, she forgot about a gift, the whole party and she showed up late and then left early to go see him after giving me a very rude card and 50 bucks in the card. (For reference, I had bought her a pandora bracelet with matching charms for her 17th.) Mind you she did not tell us about him and my grandpa had died from cancer two days prior.  During my party after she left, she called me and begged me to lie to her older sister, who was in my driveway about her whereabouts for her. She still hadn’t told me where she was (which was with him) and repeatedly refused to do so. I didn’t get to talk to her sister because the boy dropped her off before that.  Now, after a long summer of exhausting back-and-forth mixed apologies, mixed stories, and blaming it on him that he made her dump us, she wants me to go to her 18th and I calmly said no. She also broke up with him at the end of summer.  Two of the friends in our friend group are going the rest are still mad at her or still on the fence. Unfortunately and completely coincidentally we all booked tickets for a haunted house on the same day as her party , including the friends going to her party so they will have to leave 2 hours early to hang out with the people who denied to go to her party or ghosted her.  What should I do? Should I try forgiving her?  I understand her family is strict, but am still very hurt she used us and created hangouts just to never show up to see him.  I’m deeply hurt. Especially because of my 18th party and she wanted me to go to hers. AIO??  Please give me reasons and explain why I’m overreacting, or not. I’ve been going crazy!",
    "flair": "Not the A-hole",
    "created_utc": 1761091704.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1octeus/aita_my_best_friend_left_my_18th_birthday_party/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1oct6pp",
    "title": "AITA for not taking my mom’s dog?",
    "selftext": "So my (21F) mom (55F) was recently arrested for assault. She has a dog who’s currently staying at the place she shares with her friend, and her friend is also most likely going to jail for about 6 months. For reference, I’m on my own - work full time, pay all my own bills (hardly), no roommates. Also for reference, my mom has an addiction problem and does not work at all, her friend takes care of her financially. I just spent money (that I really didn’t have) to transport her from another state, because she decided to hitch hike out of state for some reason, then I got a call from some police department late at night pretty much telling me to take care of her. Now fast forward a week later and she’s in jail, and the dog might not have anywhere to go. I’m also leaving for vacation (that I’ve worked very hard for) in about a week, so I couldn’t take the dog even if I was eager to (I don’t have the time for a dog, I work all the time). Am I morally obligated to take the dog? I care about him but I don’t feel that it’s my responsibility to take care of my parent or her pets, I hardly turned 21 this month and I’m a blue collar worker trying to build my own life. The guilt is eating me up.",
    "flair": "Not the A-hole",
    "created_utc": 1761091084.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oct6pp/aita_for_not_taking_my_moms_dog/",
    "downs": 0,
    "ups": 362,
    "score": 362
  },
  {
    "post_id": "1oct4v5",
    "title": "AITA for not wanting to go to my stepbrother’s house for holidays anymore?",
    "selftext": "I grew up without my dad and my mom married my step dad when I was young and he has two boys. Was neither close with his kids or him. We are different people with very different values.  My mom constantly asks me to go over to his oldest boys house that is married with kids there for holidays.   I have went the past two years and its so uncomfortable and not natural. We dont connect or talk... Its an hour away and not worth it to me. I dont wanna just do fake family shit.  my step dads kids dont even talk to me when I go over, nor does his wife. didnt invite me to their wedding, and only say hi when I leave. I feel my parents value them more because they took the same path they did in life and mine differs from theirs.   AITA for not wanting to go over there?",
    "flair": "Not the A-hole",
    "created_utc": 1761090945.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oct4v5/aita_for_not_wanting_to_go_to_my_stepbrothers/",
    "downs": 0,
    "ups": 592,
    "score": 592
  },
  {
    "post_id": "1oct4qd",
    "title": "AITA I won't be spending christmas eve with my mom",
    "selftext": "I (40M) always go home to philly to visit my family for christmas (I now live in the midwest). My father passed 12 years ago and the last two years my mom is dating a new guy. I like him and he was a friend of my dad's. Last year, my mom asked me to go to his family's christmas eve (it's like his cousins or something).   I know basically none of these people at this event). It was fine but I was just not that into it. She asked me today to do that again this year and I told her I'd rather just spend chirstmas eve alone.  My dog died this year and I also got divorced, so I don't really feel like being around a bunch of strangers on christmas eve. For the record, we are doing our own family things on Christmas day and then with our extended family on that Saturday and I'm staying at our house so there is plenty of time to see her.   My mom says I'm being an asshole for not being with her on that night.       AITA?   TL;DR: Mom wants me to spend chistmas eve with her new man's family and I'd rather not.",
    "flair": "Not the A-hole",
    "created_utc": 1761090937.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oct4qd/aita_i_wont_be_spending_christmas_eve_with_my_mom/",
    "downs": 0,
    "ups": 7,
    "score": 7
  },
  {
    "post_id": "1ocsvfl",
    "title": "AITA for telling my roommate his “pet” needs to go?",
    "selftext": "ok so i (23m) live w my roommate (24m) and he’s been keeping this squirrel in our apartment for like a month. yes. a real squirrel. he found it outside and said it “looked sad.”  at first i figured he was just helping it heal or whatever but nope, he’s decided it’s his “emotional support squirrel.” he made a tiny collar for it out of a shoelace. it’s cute but it’s also… wild?? it chewed through my phone charger and pooped behind the tv.  i told him he’s gotta either release it or call a wildlife place because it’s starting to smell and i’m not tryna live in a zoo. he got all defensive saying i “don’t believe in compassion.” i said compassion is fine but like, not in the living room bro.  now he’s barely talking to me and posting squirrel selfies on his story with captions like “some ppl dont understand love.”  i honestly dont think i’m the asshole but maybe i could’ve handled it better. idk. aita?  UPDATE: mission “remove the damn squirrel” was a major success. i just opened all the doors and ran around the place chasing it until it eventually ran out of the door. seems to be solved for now, i’ll keep updating this post with my roommate’s reaction.",
    "flair": "Not the A-hole",
    "created_utc": 1761090235.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocsvfl/aita_for_telling_my_roommate_his_pet_needs_to_go/",
    "downs": 0,
    "ups": 256,
    "score": 256
  },
  {
    "post_id": "1ocsnbu",
    "title": "AITA for asking my sister to clean a little more often?",
    "selftext": "Okay so I(21F) and my sister(19F) have lived together for 2 years now. Recently I was fired and since housing was provided by my employer, i went homeless for a while. Thankfully she helped me through it and we both found a place to stay, and I really needed that since I’ve found a job and she paid for the first two months as I was still waiting for my paycheck. We moved into an apartment that is shitty on its own, as it was extremely dirty and now we got cockroaches and mold in some places and we basically have to get this entire place to at least be decent on our own. Thing is my sister has a cleaning problem. Even when we shared a room she’d always throw her clothes everywhere around the room, she’d eat and leave everything in there, she’d never clean the house or the kitchen(and that created problems with the other people we lived with) but i’d always clean after her and make her bed whenever i’d do so. Thing is now that we’ve moved i’d like to keep the place as clean as possible and i’m also willing to put a lot of work into it, but she’s not. and she gets angry and moody if i’m telling her to help me out with cleaning/renovating, and then stops talking to me. im not always gonna clean after her, even though id love to keep this place clean. She keeps saying that she doesn’t care but well, this is what we gotta do. And we can’t live like this. I refuse to live like this. I can feel my patience slipping away and turning into quiet rage and i’m just about to blow. I wish she’d do more. I wish she’d at least do SOMETHING. we lived in poverty and my parents neglected us and the house and that’s traumatic to me. The house is dirty = i don’t feel comfortable. seems like it has impacted us differently. i had a little fight with her and told her to stop putting her garbage and make up everywhere cause it just looks bad. I love her more than anything but i don’t want to live in a house that’s full of garbage. I avoid conflict because she did help me a lot but i still feel like this is the work that we both have to do in order to have a nice place. at the same time, maybe she’s got her own shit to deal with, and thinking about that makes me feel like im selfish for expecting things out of her after all that she’s been through just because i lost my job. (by the way i am giving her the rent money back, little by little) Am i the asshole? edit: added some details.",
    "flair": "TL;DR",
    "created_utc": 1761089634.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocsnbu/aita_for_asking_my_sister_to_clean_a_little_more/",
    "downs": 0,
    "ups": 1,
    "score": 1
  },
  {
    "post_id": "1ocsldv",
    "title": "AITA for making myself pizza?",
    "selftext": "Tonight was leftovers and I worked over 30 mins extra so when I got off everyone had eaten except for my youngest son (8yrs old). I went outside where my husband was and told him I was going out to grab some things we needed at the store and a gluten free pizza. He said okay. My son said he wanted noodles (Ramen pho flavored) since his siblings did not leave him what they ate. I said okay in a hurry out the door, so one of my other kids made him noodles.   I came home and made the pizza, was going to share with my son as well and my husband came in and got upset that he wasn't eating some of the other leftovers in the fridge. He then proceeded to tell me to make better decisions on what I'm eating and that he hated me. He amended that to he hates my decisions, but clearly said he hated me first. AITA? I was in a hurry. I got off later than normal and I have class tonight.",
    "flair": "Not the A-hole",
    "created_utc": 1761089489.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocsldv/aita_for_making_myself_pizza/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocrs7a",
    "title": "AITA for telling my friend to stay out for her friend’s birthday?",
    "selftext": "So my friend who we’ll call Jade got mad at me recently, and I’m honestly still a bit confused about it.  We were celebrating Jade’s best friend’s birthday - who we will call Rachel. We started off in a group at a park, then were planning to head to a bar afterwards. Jade had no other plans that day, but as we were heading to the park she said she was leaving.  I said, jokingly, “come on, stay for Rachel’s birthday.” She immediately said “shut up” and did the usual goodbyes.  At first I thought maybe she was just tired or in a mood, but later I heard from another friend that she told him she was mad at me for saying that. Apparently, she said something like her “20-year friendship doesn’t revolve around whether she stays out for her birthday or not.” and that “I am aware that everyone thinks I’m boring because they all think I want to just be with my boyfriend”.  This annoyed her so much that she then told that same friend that our other flatmate, who we’ll call John, is her favourite flatmate by far (we all live together). Felt a bit unneeded as a comment. This all has negatively affected my relationship with her, and I would like to talk about this, but would like to know if I was out of line for making this comment.   It’s kind of annoying because if anyone knows me, I’m very chill and unserious - I never meant it as pressure or guilt. It was literally a throwaway comment said in a lighthearted, jokey way.   So… AITA for telling her to stay for her best friend’s birthday?",
    "flair": "Everyone Sucks",
    "created_utc": 1761087353.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocrs7a/aita_for_telling_my_friend_to_stay_out_for_her/",
    "downs": 0,
    "ups": 3,
    "score": 3
  },
  {
    "post_id": "1ocrqpk",
    "title": "AITA - hoping my partner can do things more independantly.",
    "selftext": "My partner is a homemaker. There are some personal documents that need to be written that pertain to both of us. They have pushed the agenda that I create the document. I have suggested that we do it together or they can write it and I will review it and ammend if needed. They somewhat agreed to that, but is still adamant that I must do it. I work all day and want a bit of time to wind down when I get home. When I have had the capacity to tackle the project when I get home I have suggested that we work on it together, but it has always been met with \"I'm not in the mood right now\". At this point I am waiting for them to come to me to tackle it together, which has never come. I will admit I do leave things to the last minute, but if there is a deadline I get it done. There is no deadline on doing this, so I just wait. Whenever an argument comes up, so does that fact that 'I' haven't done the project. I always ask about their day when I get home, and a lot of the time I get told they were doing housework and corresponding with friends and family, which is fine. I want them to be able to do what they want with their days and I am here to support that. But when I get blamed for the project not getting done I'm the bad guy. My partner used to be so independant, but now they can't do anything without me or for me to do it myself. Am I the asshole for not just doing the project myself, or for expecting that they can tackle it without me?",
    "flair": "Not enough info",
    "created_utc": 1761087254.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocrqpk/aita_hoping_my_partner_can_do_things_more/",
    "downs": 0,
    "ups": 2,
    "score": 2
  },
  {
    "post_id": "1ocqg5d",
    "title": "AITA for asking my roommates to throw out their cats poop outside",
    "selftext": "I live with 3 roommates, which 2 of them are in a relationship and living in a room together. Those roommates got a cat about half a year ago. They asked everyone else, including me, if we were alright with a cat present. We both agreed that they can adopt one.  They cared for the cat very well at first, taking care of her hygiene and whatnot, but with time they got more lazy and sloppy about it, especially in the litterbox department. In the kitchen (that we all share), stand all the trash bins. The bin for organic materials stands out in the open, since we have no other spot to place it. As you can expect, they started throwing the litter into the bin. Not in a bag, just from the litterbox, straight to the bin. It was incredibly rancid walking into the kitchen and catching a massive whiff of cat excrement. If the bin was not emptied quickly enough, the whole apartment would stink. I obviously brought it up to them, that it was bothersome. They agreed, and started throwing the litter out in small baggies.  It would be all well and good if not for the fact that it still stank, just not as much. With time i started getting bothered with the constant smell in the kitchen. Noone else seemed bothered by the smell, probably because they all lived with cats in their homes before we moved in. I decided to bring it up again. I explained that the smell is still there and it's really bothering me. They just kind of shrugged and brushed it off, as me being sensitive and the only one having a problem with it.  This is where I feel like I might've been the asshole. I walked into the apartment after a really hard week and immedietaly got hit with the same putrid smell. I looked down and the trash bag was pulled out of the bin and just left by the door. I decided that enough was enough. I placed the bag in their room and just left it there for them to come back to. After they came back, they were furious. They called me over to ask if it was me who left it there, which i agreed. I went on to explain that it's ridiculous that they're throwing the cat's litter into the bin yet again. They said that \"I agreed to the cat\". I replied \" The cat is not the problem, your incompetence and lack of compassion is!\". I went on to explain how I had to comform to their habits multiple times, while they consistently brush mine off. Moreover, I explained that they could just take the litter outside, which would take them at most 5 minutes each day and other solutions that really wouldn't be that extreme. They replied, and I kid you not, \"We can spend that time on more important stuff.\" and \"If you want us to do that, just throw the litter out with us\". Ultimately we came to the agreement that they will try something, like keeping the bags in their room.  AITA for leaving trashbags in my roommates room after repeat appeals of not throwing their cat's litter into the main trashbin?",
    "flair": "Not the A-hole",
    "created_utc": 1761084038.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocqg5d/aita_for_asking_my_roommates_to_throw_out_their/",
    "downs": 0,
    "ups": 16,
    "score": 16
  },
  {
    "post_id": "1ocpzmn",
    "title": "AITA for getting upset at a student teacher?",
    "selftext": "I (15F) am taking a German II class at my high school. Recently, this student teacher started working in our class (call her Frau S), and we could already tell she was too emotionally unstable for teaching. She would always get upset when some of the guys in our class would playfully joke around or just chat with one another while we would play class review games. Her emotions got so bad one day, she outburst on this one guy for simply being extra competitive and jokingly shouting \"suck my di\\*\\*\" at the other team. Frau S whisked him into the hallway, started screaming and yelling at him to the point my friend in the class down the hall said they all stopped class to just listen at the free entertainment (lol). My actual teacher eventually had to go outside and calm her down after a good 10 minutes. Yeah, it was that bad. 😖  A week later, we had an in class short test. In our class, its pretty typical for students to ask out loud \"How do I say....?\" or \"what is...?\". The guy in front of me raised his hand and asked \"how do we say 'to drive?'\", to which I simply said \"fahren.\" Frau S, super big for her britches, then walks over, takes my test, folds it up and throws it in the trash can in front of the whole class. She then snarkily says \"I know you have good intentions, but these of yours are just bad.\" Teacher was in another room at a meeting when this happened, and Frau S then says I can retake it in the morning before school. So I went home crying to my mom due to feeling humiliated. especially that I now have to retake a whole test for a completely pointless reason. My mom calls my teacher, teacher says shell talk to me tomorrow when I come in. I go in the next day, and my teacher asks to talk in the hallway. She tells me to just \"let it go\" bc Frau S in a new teacher, and that I can retake my test afterschool. Teacher did absolutely nothing to correct Frau S about her behavior, and just made a bunch of excuses for her. My mom reiterated what my teacher said when I got home, but WITA for even escalating this?",
    "flair": "Asshole",
    "created_utc": 1761082929.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocpzmn/aita_for_getting_upset_at_a_student_teacher/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocptfp",
    "title": "AITA for being cautious about my boyfriend’s sister moving into his house ?",
    "selftext": "My boyfriend and I have been dating for two years, and our relationship has been a little rocky in the past few months. Because of this, I’ve been staying with my mom on and off. I moved in with him about a year ago.  During this time, I’ve realized that his family has a lot of drama. He recently started talking with his sister after being on rocky terms for years. She was in an abusive relationship for seven years, and he didn’t talk to her for two of those years.  One day, she told him she felt like she didn’t have anyone to talk to. I offered to be there for her, because I’ve been in abusive relationships myself and wanted her to know she’s not alone. He gave her my number, and I ended up having a phone conversation with her.  After that, she started calling me every other day to talk about her trauma and her abusive relationship. I suggested she get a therapist or an attorney for legal advice regarding her living situation, but she said she didn’t have the money. Later, she told me she had another boyfriend and had been traveling with him, but she was still technically living with her abusive ex. She also asked me to keep it a secret from my boyfriend.  I felt really uncomfortable being caught in the middle of all of this. When I tried to express my unease about the situation to my boyfriend, he said, “Well, don’t you have any empathy for people being abused since you’ve been abused yourself?” When I told him I was overwhelmed and thought she needed professional help, he also said that maybe I shouldn’t have contacted her in the first place.  A couple months ago, he told me he was going home for Thanksgiving, and that his sister would be moving in with us. I was taken aback, but since it’s his house, I didn’t push too hard. While staying at my mom’s, I reflected on the situation and started feeling uneasy and upset.  I asked him if she had a plan for how long she would stay or if he wanted to set any boundaries, and he said he didn’t know. When I asked if she might stay longer than a year, he said “maybe.” I feel that if our relationship were stronger, I probably wouldn’t be as upset, but given the circumstances and his rocky history with his sister, I’m skeptical and uncomfortable with this situation.  Am I wrong for feeling skeptical or upset about him moving in his sister without consulting me first, even though it’s his house?",
    "flair": "Not the A-hole",
    "created_utc": 1761082527.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocptfp/aita_for_being_cautious_about_my_boyfriends/",
    "downs": 0,
    "ups": 21,
    "score": 21
  },
  {
    "post_id": "1ocpcx3",
    "title": "AITA for refusing to pay a 100$ bill from my Sisters in laws?",
    "selftext": "So my sister and I planned a family vacation together. We rented a big house for both our families. It was me, my wife, our 1 year old, our dog, and my sister with her husband and their two kids who are 5 and 3. The house was big enough that her in laws stayed with us during the first week and our parents came in the second week.  Our dog is a rescue she is very sweet but gets nervous around new people. She knows both our families really well and loves the kids and my brother in law but she had never met his parents before. So we made it clear that she would always be leashed when they were around and that my wife or I would always be there.  Two days into the trip my sister’s MIL told me she is great with dogs and asked me if she could give her a treat. I said yes but I explained exactly how to do it safely. I told her to get down low so she would not tower over the dog and to move slowly. She said okay but immediately did the opposite. She leaned over her and reached down and the dog got scared and jumped up on her. I pulled the dog back right away and told her that for the rest of the week it would be better if she did not try to interact with the dog.  She seemed fine with that so I thought that was the end of it.  Two days later everyone else was out. It was just me, our baby, Sisters MIL+FIL and one of the older kids in the house. I was on the floor playing with my kid when I heard them talking very loudly at the dining table. It was that kind of loud where it feels like they actually want you to hear it. They were saying things like we will have to get it repaired when we get home and maybe we can find someone cheap to fix it.  I could not really ignore it so I asked what was broken and what needed fixing. She said that one of the kids had brought her her broken ankle bracelet. She said she was not sure what happened. Maybe it broke while she was on the trampoline or bumped into sonething, or maybe it was when the dog jumped at her earlier that week.  I said oh okay that sucks and left it at that. Nobody mentioned it again and the topic never came up once for the next 4 days that they stayed.  Fast forward two weeks after the vacation. My sister called me and said her in laws had a bracelet repaired and now they wanted me to send them 100 dollars for the repair.  I was honestly shocked. I called my sisters MIL right away and asked what that was about. She said she thought it must have been the dog when she jumped up on her. I reminded her that she ignored my clear instructions and that she was not even sure if it was the dog since she had mentioned several other reasons.  I told her that if she had talked to me honestly during the trip and said she thought my dog broke it I might have helped pay. But she said nothing, waited two weeks, and then sent the bill. So I told her no, I was not paying.  Now she is upset and told my sister I am an asshole So Reddit. AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761081454.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocpcx3/aita_for_refusing_to_pay_a_100_bill_from_my/",
    "downs": 0,
    "ups": 2642,
    "score": 2642
  },
  {
    "post_id": "1ocpa94",
    "title": "AITAH :-for telling my half-sisters that the difference between us is very clear?",
    "selftext": "I'm from a country that doesn't speak English, and all... I'm writing from a different account, the names are in yours because my family has Reddit.  i'm Eleni, ( 25F) My story began when I was young.  I grew up in a large family, and when I say large, I mean literally large. My mom, dad, three half-sisters from my dad's deceased wife (Sophia, Tia, and Monica), me, my two younger sisters (Noah and Nia, the twins), my unmarried aunt, my two grandmothers, and my paternal grandfather. My large family of 12 members. None of them worked except my dad, mom, and aunt. Our financial situation is rubbish. I always felt that our financial situation would have been great if my dad had stopped spending so much money on his daughters from his first wife.  And when I say a lot of money, it really is. He buys them expensive things.  :- Clothing and Makeup I remember one time he bought Mony a dress for $250, while he refused to give me taxi money. Gifts for no reason.  When I complained to my grandfather about my father, he told me that my sisters didn't have a mother to care for them and that my father wanted to make up for it.  And that when my sisters grew up, they would work and the situation would end.  But that didn't happen because all three of them entered private universities near our house. My father wanted to buy them cars, and of course, our situation got much worse.  Noah and Nia only had two jackets for the winter, which they changed into as spare parts. As time went on, my sisters didn't work.  When I was 17, my father came to prepare me so I could start working at 18, pay rent, and contribute to the household expenses.  The strange thing is that my entire family agreed. I asked my father why his daughters didn't work. He told me I shouldn't compare myself to someone who doesn't have a mother. I told him that  My mother treated them like her own children; she probably pampered them more than we did.  Of course, I worked in a restaurant and at a bookstore. Noah and Nia grew up and went to different universities. Years passed, and I graduated, worked, and helped Noah and Nia.  Two weeks ago, I was at work. Nia called and said she was under my new house and needed someone to open the door for her. I went home, let her in, and we sat down. Suddenly, she told me that her father had kicked her out of the house because she refused to work. (For your information, Nia's field of study is difficult and requires focus, and it's hard for her to work while studying.) Mouni called and asked me to explain her mistake to Nia and let her work and pay her father's rent. I cursed Mouni and told her that she was selfish like her father and that she and her siblings were spoiled in our father's house. Of course, I was met with her famous crying spell.  Everyone called, even Sophie the Charismatic called and asked me how I could upset her sister.  And she thought there was no difference between us.  I told her that the difference between us was very clear",
    "flair": "Not the A-hole",
    "created_utc": 1761081278.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocpa94/aitah_for_telling_my_halfsisters_that_the/",
    "downs": 0,
    "ups": 673,
    "score": 673
  },
  {
    "post_id": "1ocp7o7",
    "title": "AITA for moving a little over an hour",
    "selftext": "A year and a half ago I finally took the step because I had the funds to do so to move out of my parents house with my girlfriend. While I am not in love with the area, I do love her and have stuck to my promise of visiting frequently (I visit weekly or every other week and sleep over at least once a month).   When I originally moved out I was quite miserable living with my parents and often disappeared for days crashing at my girlfriend's or other peoples houses because I found them exhausting, which I think was just a by product of getting older and the issues that occurred. Obviously, no one (including my friends) were happy about me moving especially because of the location. There were a few reasons for this 1) I was always the person available for everything and always helping everyone 2) I was always the back up plan if things went wrong whether it was my car or otherwise 3) Most of my friends and family are quite poor and transportation is often difficult for them.  I tried to remedy that when I moved so they could visit me. Sometimes I would drive there and pick people up and bring them back. Most of them I would pay any tolls and gas it took to get there. I even cover some of their bills because I care and I know they're struggling. But since I moved I noticed there is always a tension and everyone is always lowkey kind of upset with me.  My brother has to move as him and his wife were having a kid and its only a little over 30 minutes for my parents to visit and he also complains I am too far. So, I also try as much as possible to visit him and my friends who have moved and my parents who are struggling financially but still everyone seems bitter about me moving.  To be honest, if I had a choice I maybe would move somewhere different or slightly closer but between work and better Healthcare (as I am also chronically ill and was in desperate need of better healthcare) the location I'm in works on a lot of levels. To be honest, it's just hard to keep up not only because it stresses me out that I could be a real asshole for moving and making them all upset at me but also because my health is getting worse and it feels like everyone is even more frusterated with me because I can't travel as much as I'd like to to hang out and see everyone. Hell, even if I wasn't as sick I still would have difficulties seeing everyone since I work 40-60 hours a week depending on what is going on. I could go on, I just need to know...am I the asshole? If I am how do I be better and not as shitty as a friend and family member?",
    "flair": "Not the A-hole",
    "created_utc": 1761081109.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocp7o7/aita_for_moving_a_little_over_an_hour/",
    "downs": 0,
    "ups": 1,
    "score": 1
  },
  {
    "post_id": "1ocof4i",
    "title": "AITA for asking my coworker not to whistle so much?",
    "selftext": "Throwaway etc.  I (31NB) work in a small building with an even smaller team, most of whom are neurodivergent in some way (several with ADHD, I'm the only one who's also autistic). The work environment is very casual and none of of our roles are customer-facing. I've been here three years and it's been more or less smooth sailing.  However, due to my disability I have a lot of sensory sensitivities that require a fair amount of management on a daily basis. Both my manager and supervisor (both 40sF) are aware of this and have said to let them know if I have any accommodation requests at any point. I haven't yet because I prefer to deal with it myself, so at most I'll wear a pair of Loop earplugs or take a couple of quick sensory breaks throughout the day. This has been fine so far and hasn't affected my ability to do my job at all.  Recently though, there's been one particular sound I've found especially unpleasant - my supervisor's whistling. It's something she's always done, usually when she's concentrating or working hard, and I've always just tried to tune it out. But it's been getting more and more frequent, so that now she's doing it a solid 80-90% of the time. It's often louder than the background music we have playing and usually not in tune with it either, and it's not just when she's really concentrating - it's when she's just working, or bored, or thinking, or even during meetings when someone else is speaking. Because of the nature of our roles I can't request to work elsewhere in the building, which would be the easiest solution, and Loops actually made it worse because they muffled the background music so much that the whistling became the salient sound and was even more overstimulating. I tried taking extra breaks to self-regulate, but that was disruptive to the workflow to the point that the person I was working with the other day kept asking if I was okay because I had to keep stepping out.  So I decided to bite the bullet yesterday and talk to my supervisor. I made it clear this was a situation of conflicting access needs and nobody was in the wrong, and that I was hoping we could find some kind of compromise like maybe she could hum or sing instead, or whistle more quietly/less often. She implied it was weird that I was \"tracking\" her whistling because she's \"always done it this much\" and \"doesn't even notice she's doing it\", then asked if I could do something on my end to deal with it. I told her what I'd already tried and said I was very open to any suggestions she might have for anything else I could try. She didn't offer any, and just ended the conversation kind of abruptly by saying she would \"try\" to whistle less. The vibe was definitely off after that and it's clear she's ticked off about the whole thing, so I'm looking for some outside opinions on the situation.  AITA for asking her to change her behaviour due to my my sensory distress? Or is she TA for not being more mindful of making so much noise in a shared space?",
    "flair": "Not the A-hole",
    "created_utc": 1761079294.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocof4i/aita_for_asking_my_coworker_not_to_whistle_so_much/",
    "downs": 0,
    "ups": 126,
    "score": 126
  },
  {
    "post_id": "1ocnz2m",
    "title": "AITA for showing my girlfriend some criticism of Taylor Swift's latest album after she asked for it?",
    "selftext": "My girlfriend is a big Taylor Swift fan. Last weekend when we were cuddling I asked how she liked the latest album (she'd really been waiting for it to drop). She said it was good and asked me how I liked it. I said I hadn't gotten the chance to listen to it but I'd just asked because some people were flaming it on X. She asked me about what, I said I wasnt sure, just that I'd read it when it came across me. She insisted that she wanted to see the posts, so I just showed them to her. She read it, disagreed with a few of them out loud, tried to explain to me why they were wrong, and I just agreed with her.  Last night when we were driving one of the songs in the latest album came up on her Spotify, and during it she told me I'd ruined the album and Taylor Swift for her. I thought she was joking but she was serious. AITA for having brought up all the criticism I came across to her?",
    "flair": "Not the A-hole",
    "created_utc": 1761078269.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocnz2m/aita_for_showing_my_girlfriend_some_criticism_of/",
    "downs": 0,
    "ups": 4826,
    "score": 4826
  },
  {
    "post_id": "1ocnnsn",
    "title": "AITAH for not being able to commit to a cruise my parents booked?",
    "selftext": "Two years ago my parents booked a cruise for me as a birthday/graduation present. This is when I was still in medical school. I had told them at the time I didn’t know if I’d get leave but they assured I would and booked it.   I’ve now started working as a junior doctor in the NHS and I don’t have a rota for my next rotation yet, which is when the cruise is booked for. I would need over two weeks off for this holiday. My parents have been continually asking me to get the days off and I’ve explained one the rota does not exist yet and two I’m worried I won’t get the time off as I get 9 days annual leave per job ( every four months). When I had told them this my dad said I was bullshitting them and the real reason is because I didn’t want to go.    I ended up emailing the rota person and explained the situation. I was told they can try to accommodate but can’t guarantee anything. I told my parents this again and my dad told me he just thinks I don’t want to go and I’ve known about the cruise for two years so I should have sorted it. He says I have too much going on in my life like “that girl” and my work.   For context, that girl is my girlfriend and my parents don’t support my sexuality or relationship. They’ve both expressed extreme disappointment in this, threatened not to be in my life anymore. My mother has told me it made her feel suicidal and I need to help her with it.   My mum asked to explain how annual leave works and seemed skeptical.   They’re now saying they’re cancelling the full trip and have lost money from it, including the deposit. I told them they should go themselves and I’d want them to. They have told me no and why would they want to do that.   Now I feel terrible. It was never my intention to waste their money or plans or time but i genuinely can’t control my schedule.",
    "flair": "Not the A-hole",
    "created_utc": 1761077579.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocnnsn/aitah_for_not_being_able_to_commit_to_a_cruise_my/",
    "downs": 0,
    "ups": 928,
    "score": 928
  },
  {
    "post_id": "1ocn93g",
    "title": "AITA for wanting a child-free wedding but now feeling pressured into making exceptions?",
    "selftext": "Not in a great place at the moment firstly. Diagnosed with adhd last year which was hard to come to terms with, rough &amp; busy year, trying to save for a wedding, struggling with people pleasing and have done for as long as I can remember.\r \r Fiance (36M) and I (36F) agreed last spring when we got engaged that we wanted a child-free wedding. Was worried about family opinions but all was well as of this summer as I messaged my family with kids to say we had picked our venue and that the wedding will be adults only. People were fine, no issues there. Fast forward 5 months, family circumstances have changed.. someone in my family is now expecting their 2nd child who will be 5 months old by the time we get married, would be classed as an automatic exception usually as a breastfed baby under 1 year.\r fiance is away from home when I found out about the new baby so planned to tell him when he returns (he is away for 2 weeks &amp; we had separate guestlist quarrel few weeks prior also). However, he messaged a couple days ago &amp; said his cousin cant come to the wedding (5 hr drive) without her toddler &amp; suggested we make an exception for her. He's very impulsive. In my poor mental state where I'm on edge &amp; dealing with worry, I agreed as felt it would make it easier for me to mention the exception for the new baby in my family with no pushback. He thinks its all agreed &amp; fine but ive been on edge since.. mainly around making 2 exceptions  where other family members may feel this is unfair. Called my mother for some advice as the worry has been eating away at me. She said I need to speak to fiance when he's back but he’s the one who opened the floodgate by pushing for an exception for his cousin's toddler. my mother also said it's unfair to allow the 5 month old baby but not allow the baby’s older sibling to come along- said its forcing the parents to split up their kids. My mother said \"children wont ruin your wedding though\".. i told her i dont hate kids, but didnt picture my wedding with 10 kids there. She assured me if I change plans and include them all, it will be fine but im doubtful.. ive seen these same children at weddings/parties running around wildly, getting injured, dominating dance floors, &amp; parents who cant be bothered to keep them in check. Its just not what I want &amp; I feel like I have to tell my fiance he’s made it incredibly difficult for me by pushing for this exception for his cousin and explain how I felt pressured, and then either suggest we include all the other kids, or tell him if his cousin cant make it without her toddler then tough, she’ll have to stay home – we aren’t responsible for managing other people's disappointment. Think at the moment he probably feels this is all sorted but its not him who has to deal with the inevitable backlash from my family. Feeling lost, scared, and consumed by \"what ifs\" that I'm desperately trying to manage. Please help.",
    "flair": "No A-holes here",
    "created_utc": 1761076681.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocn93g/aita_for_wanting_a_childfree_wedding_but_now/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocmkrz",
    "title": "AITA for not filming my uncles weeding for free?",
    "selftext": "EDIT: Misspelling in the tittle, i meant \"Wedding\" and not \"weeding\"… and no i’m was not high while writing the post 😂  I am a videographer and have been for the past couple of years. I have shot multiple wedding films before, but non for my close relatives.      My uncle reached out saying he is planning his wedding, after years, he is finally getting married, and i am very excited to attend... until he asked me if I could shoot his wedding for free. For free is not my problem, i would love to do it for free, especially as he is my favorite uncle. But i have been waiting for the day to come, as we would always joke about him being alone for the rest of his life (Inside joke in the family :)...), but i dont want to actually shoot his wedding, as I won't even be able to remember any of it because of my drive to deliver good work. I even told him that he would barely see me around as i would be running around the venue trying to get the best shoots as possible. I don't half ass my deliverables either, so i told him that it would either be me going full high-grade delivery on the film or not shooting at all. So AITA for telling him that i don't want to shoot his wedding film, even tho im qualified and could do it for free?",
    "flair": "Not the A-hole",
    "created_utc": 1761075174.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocmkrz/aita_for_not_filming_my_uncles_weeding_for_free/",
    "downs": 0,
    "ups": 60,
    "score": 60
  },
  {
    "post_id": "1oclls7",
    "title": "AITA for continuing to use my 529?",
    "selftext": "VERY long story short...I am in undergrad right now and left home a few months ago after a particularly bad fight with my mother. For context, I only live there during the summers when I'm home from school. Her and I have always gotten along, but she has always been very volatile and has been abusive at times and that has caused strain on the relationship. This summer was a bit of a breaking point, and I left home before I was supposed to because she got so angry she insisted she didn't want to live with me anymore. I have since stopped most contact with her and she is very upset. This past weekend, she demanded I give her back the my 529 (for those who don't know, this is a special savings account you can use to pay for educational expenses). My dilemma is that I am completely on my own financially and literally cannot live without this money...I live off campus and cannot afford food or tuition or rent without the 529. She insists I should take out loans like she did and that I am acting entitled for refusing to give her the money back. What do you all think?",
    "flair": "Not the A-hole",
    "created_utc": 1761073011.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oclls7/aita_for_continuing_to_use_my_529/",
    "downs": 0,
    "ups": 13,
    "score": 13
  },
  {
    "post_id": "1oclgh8",
    "title": "AITA - My Mom (63F) expects me (30F) to care for her in her old age, AITA if I tell her to figure it out herself?",
    "selftext": "I apologize if this is all over the place, I'm on mobile and all over the place myself.  Tldr; parent who was shitty and neglectful needs care in her old age &amp; I feel guilty that I don't want to/can't give that to her. How do I address that with her? AITA if I let her figure it out on her own?   My Mom is currently looking into hip surgery, and trying to figure out how life looks for her going forward &amp; expects me to \"help\". We will be talking later today so I'd like to be prepared to tell her no, and not sure if I should be upfront with my perspective on this ask and our relationship, or if I'm being shortsighted and should suck it up since she's my mom. She's 63 &amp; retired 15 years ago, pursuing instead a soap &amp; reselling business that has kept her afloat since then, as she never saved for retirement. She lives in a small studio &amp; has a car but not much else to her name. She collects social security &amp; all other income goes unreported. Since she \"works for herself\", she is free to come and go and do as she pleases with the money she does make - over the past 10 years she has traveled to I think 4 different countries, she's regularly buying random herbal supplements &amp; generally lives \"in the moment.\"    I see all of this as being extremely irresponsible, something she has been honestly my whole life. She's now looking at a surgery that will confine her to her studio for at least 4 weeks healing time, unable to make money, most likely by herself if I can't be there (she cuts relationship ties at the smallest slights, doesn't have many local friends).   We currently have a \"pretty good\" relationship, because I have physical distance from her and have forgiven her for her mistakes in my childhood, for my own mental health. I have a sibling that is no contact with her for these same mistakes. I truly believe she has made her bed and as it is, now has to lay in it.  I do know when we talk later shes going to ask me to come help her, and I don't know how to approach saying no, or if I should say no.  She was always a selfish and neglectful parent, and when it was her turn to care for me she did the bare minimum (all of 2 years as a teenager, didn't even make it to 18). I feel like I want to tell her exactly that, and make it clear to her she has never taken accountability for anything, she put herself in the position of having no money or resources so she could galavant the world. On the other hand I also feel some amount of responsibility for the woman who birthed me, a woman who had a hard and traumatizing life as well - but don't have the resources to help in any real capacity. I don't have money to throw at the problem, I don't want to use all my time off for the year taking care of her, and I wouldn't get paid if I take leave, which I won't even qualify to take until another 6 months from now.  Reddit AITA for holding her accountable/responsible for putting herself in this position? AITA for putting myself first here?   Edit: Thanks everyone for your perspectives, even those that think I may be the asshole - there's valuable information in some of those too. I really appreciate all the resources and ideas for how to empower her to help herself, since it won't be me. While this is currently about the hip surgery, the future looms and alot of my concern is for then too. She won't live happy and healthy forever, and I love her, but I do know she has put herself in this position and I don't have the material or emotional resources to be a caretaker. I recently did the caretaking thing for my dog, who I loved with my whole being, and it still wore me down to my bones. I can't do that for someone who I still have resentment for.   And I want to touch on something I saw come up, forgiveness. I have forgiven her and others that wronged me, as I recognize \"hurt people hurt people\" and everyone that neglected or abused me had their own extremely painful past. There is still space to feel resentment after forgiveness, and I have a duty to protect myself from putting myself in positions to be hurt further. I've gone back and forth on going no contact with her myself, but the forgiveness has allowed me to communicate with and love her from a distance - a distance she attempts to close with emotional manipulation occasionally, but I have and plan to stay strong in holding this boundary.   I'll be researching what I can from my peaceful home 3 states away, help where I can, but won't be setting myself on fire. Thank you again everyone!",
    "flair": "Not the A-hole",
    "created_utc": 1761072694.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oclgh8/aita_my_mom_63f_expects_me_30f_to_care_for_her_in/",
    "downs": 0,
    "ups": 653,
    "score": 653
  },
  {
    "post_id": "1ockazj",
    "title": "AITA for yelling at my BF because he woke me up?",
    "selftext": "My (F39) BF (M43) gets up at 5:30am for work. I get up at 7am for work. He usually turns on the light and goes about getting ready between the bedroom, bathroom, kitchen. I usually don’t mind him going in and out a couple times.   This morning he turns on the light, goes in and makes a cup of coffee and then comes back in and asks me to move to the other side of the bed so he can relax in bed and have his coffee. In a daze I did. About 2 mins later I’m pissed. He’s got the light on, scrolling on his phone, drinking his coffee, and tapping his foot (like an ankle shaking type nervous thing?). I get up and he asks where I’m going, I say well either home to sleep the rest of my 1.5 hours or to make some coffee I guess.   He in turn goes on about how my bad attitude has ruined his day for work.   As far as I know, usually when one person gets up before the other, they may turn on the light for a minute and get dressed or get their clothes for the day and turn the light back off and go into another room. It’s the polite and thoughtful thing to do.   My mom says I’m not the asshole, but that maybe he just wanted to be next to me.   AITA for snapping at my BF for completely waking me up and asking me to move over and keep me awake?",
    "flair": "Not the A-hole",
    "created_utc": 1761070144.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ockazj/aita_for_yelling_at_my_bf_because_he_woke_me_up/",
    "downs": 0,
    "ups": 3497,
    "score": 3497
  },
  {
    "post_id": "1ock3pd",
    "title": "AITA for trying to make plans with my girlfriend for after her cat dies?",
    "selftext": "My girlfriend and I have been talking about moving in together for a while, but one of things that prevented us from going ahead with it is the fact that I have a dog and she has a cat, and they were not raised next to other dogs or cats and our attempts to introduce them all went terribly wrong. But her cat is also really old (way past 20) and very near the end. He has cancer and in the last trip to the vet it was clear there was nothing to be done and he is now in palliative care.  So, my lease will expire in 2 months and I talked to my girlfriend about whether renewing it or if it was best for us to start looking for a new place together. And she didn’t understand why I was bringing this up now, and I said that I was considering what we would be doing after her cat died. And she was very, very upset by this, saying I was dismissive of her feelings and that I was already picturing a future without her cat in our lives. I tried to explain that’s not what I meant, but I don’t know, maybe she is in denial about what is about to happen. AITA here?",
    "flair": "Asshole",
    "created_utc": 1761069703.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ock3pd/aita_for_trying_to_make_plans_with_my_girlfriend/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ock2b9",
    "title": "AITA for being extremely upset with my friend for choosing my ex bsf",
    "selftext": "For context, I (17F) and my friend (16F) have been friends since we were 4 and 5. Things didn't really change until last year. My old best friend \\[Ill call her Alice\\] and I became super close about two years ago. we bonded over a toxic person who hurt us both in the same way. But everything shifted when I got a boyfriend. I've never been boy-crazy; I just happened to get into a relationship first, and she blew up over it. After that, Alice changed a lot and started to obsessively try and change to find a boyfriend. When my boyfriend and I eventually broke up, she completely dropped me and started calling me toxic, weird, fat, ugly, etc.   Now onto the friend I'm currently having issues with \\[I'll call her Natasha.\\] She has really attached herself to Alice. Natasha has had a rough family life and is usually staying at someone's house. I want to make it clear that I don't care that Natasha and Alice are friends. I was bummed at first because we all used to be close, but ive accepted that part. The problem now is that i've been feeling very lonely because Natasha is always with Alice.   This week I had a church conference Thursday and Friday, and that was what finally broke me. Natasha and Alice spent most of the time whispering to each other and going in and out of the bathroom crying because the guy Natasha is talking to his ex showed up and she had an issue with Natasha. Meanwhile I just sat there and watched, waiting to be including in the conversation. Newsflash that never happened. On the last day, I ended up having a breakdown because I felt useless and unwanted. It feels like the only time Natasha talks to me is when something is going wrong for her.   I don't need constant attention; I just want *some* effort in return. I also know i've been petty or rude at moments out of hurt, but whenever i try to talk to her she either walks away or talks over me changing the topic. Without Natasha I have no friends, and im scared of losing her too.   Now I don't know what to do. I just feel stupid and like i'm a bad friend, even though i've looked over the situation a hundred times and can't figure out what I actually am doing that is wrong besides trying to communicate my feelings.   So.. AITA?",
    "flair": "Not the A-hole",
    "created_utc": 1761069628.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ock2b9/aita_for_being_extremely_upset_with_my_friend_for/",
    "downs": 0,
    "ups": 2,
    "score": 2
  },
  {
    "post_id": "1ocjtip",
    "title": "AITA for embarrassing my siblings’ nanny?",
    "selftext": "Helloo! So for a little backstory, I’m 17f, my little sister and brother are both 5 years old. My family’s fortunate to have enough money for a nanny, my mom is often away at work and I have school and a part time job both so I don’t have all day to look after my siblings. Their old nanny quit last month due to an injury and we hired a new one around two weeks ago, she lives with us, gets the weekend off. Her only job is to look after them and keep them safe. I help out a lot whenever I can, mostly with putting them to sleep and getting them to eat. The thing is, although she’s experienced and has been a nanny before, she’s not very good with the kids. She’s on her phone a LOT, brushes them off when they wanna play and she’s totally hopeless with putting them into bed. Which is like totally fine, I don’t mind helping but she doesn’t bother trying anymore, just knocks on my door and says she can’t get them to sleep two minutes in.   So that brings us to yesterday. Like I’ve said before, her only job is the kids, right? She’s cleaned up, or at least attempted to, multiple times. Me and my mom both have told her at least five times that we appreciate it but to leave the cleaning to me, we prefer it that way. I was studying in my room last night and then I heard like this loud thud, then my sister screaming. So obviously I run over to see what’s going on and find she fell off the TABLE and busted her lip. Obviously I’m livid dude. The nanny is in the same room with a broom. I help my sister first and after she’d calmed, again, told her that no one has asked her to clean. The fact my sister managed to climb onto the table, play on it and fall off all while she’s in the same room is actually ridiculous since she should be looking after her. She didn’t say anything to me but later complained to my mom apparently that she doesn’t appreciate a teenager constantly scolding her. She said it’s misreading and embarrassing and that I’m making it hard for her to be comfortable in the house. So now I’m just like ???what?? I don’t think I’ve done anything wrong, I didn’t yell at her either. But I might just be seeing it from my own perspective so idk how it could’ve come off to her, considering she was trying to be helpful.",
    "flair": "Not the A-hole",
    "created_utc": 1761069084.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocjtip/aita_for_embarrassing_my_siblings_nanny/",
    "downs": 0,
    "ups": 196,
    "score": 196
  },
  {
    "post_id": "1ocjobf",
    "title": "AITA for assuming that someone would know that people would be expecting more than two strips of bacon as the meat on a sandwhich?",
    "selftext": "At my prolonged work meeting today I was tasked with being the ordering lunch person. That's not my normal role. The person who usually does it is out sick and I stupidly volunteered. Several people ordered chicken BLTs and when I was passing our orders down to the front desk, I asked for everything right except that I wrote that we want four BLTs and forgot to specify chicken or turkey. I realized I forgot to specify which meat we wanted right after I sent it, but I figured if it came back turkey instead of chicken it would be fine and wouldn't be worth bothering the downstairs staffer to try getting corrected at that point. What arrived for those four people was sandwiches that contained only bacon, lettuce, and tomato. The amount of bacon was just two strips. I thought it would be common sense that they would include a more satiating meat and should have replied to make sure that was right. Everyone in the meeting acted like this was my fault. I'm thinking of asking the downstairs secretary why she didn't reply back before **ordering 4 all-condiment sandwiches.** AITA here?",
    "flair": "Asshole",
    "created_utc": 1761068770.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocjobf/aita_for_assuming_that_someone_would_know_that/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocjapw",
    "title": "AITA for choosing a stronger group over my friends for university projects?",
    "selftext": "Basically its the start of second year at university and many professors told us that we need to group up to 3 ppl because of the future projects we will have. In my friend group we are 5 ppl where we hung out alot in the first year of university and helped each other alot. In this group 2 ppl are really smart in the field, I gained alot of knowledge in a year while one has more experience than me but just isnt clicking that well in the field and the final one has a full time job and barely has free time outside of university. When it came time to choosing groups i chose along side them to team up with 2 who are very smart in the field because i knew the semester would go way more smoother with them, but when we told the other 2 about it they got mad and said that we abandoned them and that I specifically should join their group to help them. I refused and stated my reasons and that while i would be in their help, id rather pass this semester easier and better. Now i feel really bad about what i said but at the same time I agree with myself about my decisions because i know if I go into the same group as them ill have to carry them alot and while im better in this field now than i was, Im still not good enough to know how to do every project to even help myself let alone them. So reddit AITA of the way i reacted or is there smth else i couldve done?",
    "flair": "Not the A-hole",
    "created_utc": 1761067926.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocjapw/aita_for_choosing_a_stronger_group_over_my/",
    "downs": 0,
    "ups": 9,
    "score": 9
  },
  {
    "post_id": "1ocj5ty",
    "title": "AITA Dog peeing on new tree",
    "selftext": "I usually walk 1-2 miles with my dog in varying routes around my neighborhood. I wave to people, and usually have my ear buds in to catch a podcast or something.   Today I took my dog on a walk and we went by a duplex where someone was constructing something out front. I didn't think anything of it. It's a corner lot so we took the side street and my dog wandered into their yard and peed on one of the trees. It was a fairly small tree. Again, I didn't think anything of it we just kept going.   Out of the corner of my eye I see the person who was construction something saying something to me. I turned around and took out my ear bud and he's in my business about the fact that he just planted that tree. I get it. I probably would be upset too. I told him I didn't know it was just planted and I apologized, but he wasn't letting up. He just kept saying \"I just planted that true and your dog peed all over it.\" I started realizing that this wasn't going to go anywhere so I asked him what he wanted me to do about it.   He said he wantedmw to pour water on the tree and wash the leaves off. At this point I almost face palmed. Not wanting to make any enemies I asked him if he had a hose or something I'd spray the tree. He said he doesn't live there and that I should go back home and bring water.   At that point I had had it with the conversation. I said I'm sorry I can't help. He went and pulled out his phone and took a picture of me and said I'm just taking this in case someone needs to be blamed if the tree dies.   I just walked away. I half considered driving back with a gallon of water or something, but then I was afraid hed take a picture of my vehicle or license plate and do something with it. So I just finished my walk, went home and got about my business. I didn't say anything mean, and felt like I was being more accommodating that I should have been. I understand the perspective of the contractor, but dogs gonna pee on plants. AITA?",
    "flair": "Asshole",
    "created_utc": 1761067625.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocj5ty/aita_dog_peeing_on_new_tree/",
    "downs": 0,
    "ups": 0,
    "score": 0
  },
  {
    "post_id": "1ocirut",
    "title": "AITA for not wanting my Roomate's Girl over all the time?",
    "selftext": "Ever since the start of this year's school year I have lived with 2 roomates and we all go to Purdue. One being single and one being in a relationship, we will call him Jude. (Context: Jude's girlfriend was somewhat friends with me before they started dating). Jude has had this girlfriend for about 8 months or forever it seems and she is over quite a lot. By that I mean she is basically living there as well. She does have a house she can stay at and is paying rent at and she does NOT go to college where we go. She has showered a couple times at our house but besides that she basically lives there and calls it her \"home\". She is at my house more than I am at the house (I do work part-time). She will be there a lot of times when nobody is there. There has been times where I come home and she is the only one there and she is working in the living room. She is working a full time remote/in person job. She has set up an extra monitor in our \"work area\" and that is where she does a lot of work when she is remote and sometimes does it in the common area. I feel as if she may be there too much. She does do dishes and cleans sometimes, however, nobody asks her to do it. She has on 3-4 different occasions asked me to do different things like \"can you do the dishes\" or \"can you clean up that\". AITA for saying that she is there too much? or is it even worth it at this point? We have had more than one person (that are our friends that come over sometime) that have said that \"she has more say in the house than you guys do\" ((referring to me and my other roomate (not Jude)). AITA for bringing this up and saying something?",
    "flair": "Not the A-hole",
    "created_utc": 1761066751.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocirut/aita_for_not_wanting_my_roomates_girl_over_all/",
    "downs": 0,
    "ups": 25,
    "score": 25
  },
  {
    "post_id": "1ocguy7",
    "title": "AITA for speaking up!",
    "selftext": "Let’s start from the beginning. I joined the family back in 2018/2019. I instantly noticed the dynamic in the house was different. It was a 3 bedroom home with 8 people living there including  2 toddlers. The initial plan was my brother in law and his family were staying till they get back on there feet… 8 years later and here we are still same position. So recently a lot of lies have been brought to the family’s attention about him and his wife. Stating they are taking care of the bills that are in my mother in laws name however every-bill is on pink… his 2 nieces “room” is really the daylight room with a massive 6ft window.  Now let’s get to the AITA. Recently my mother in law has been venting to us about how she feels the strain from taking care of the girls because she the one who feeds them, bathe them, takes care of them when sick. I told her son my husband we needed to say something. We then found out his brother lied about going on a work trip and really took a paid vaca “by himself”. Two weeks later his wife took vaca “by herself”. We confronted his brother and told him how this was not right and I said a lot more details about things I knew about like the coworker he was cheating on his wife with… I believe she is cheating as well bc once she found out nothing was done at all.   Well yesterday my mother in law called us to see if we could babysit the girls bc they “got sick” and were dropped off at the house even tho grandma and grandpa had plans.   We sent them a text asking why one of them could not take off a couple of hours to watch the girls. They both proceeded to claim they couldn’t bc the vaca they individually took. I told them it sounded like a personal problem but that this was not okay bc they just ruined the grandparents plans. They both called grandma and got mad at her for calling us bc it was “not our concern”. We then told them it was bc mom called and then they changed tunes saying “she misunderstood and miscommunicated to y’all what’s happening”. We said there no miscommunication y’all did a drop off with out actually asking then they both called individually saying they were on the way home and it’s under control. I said it’s under control because we said something but what’s y’all plan so we know if we need to go. Sister in law says “I’m on the way home right now”. She picked up the girls at 1:30 went back to work till 3:30 and claimed she was getting off at 4:30. If she got off early after we said something why not that be the initial plan. So they both said “thanks for y’all concern and since watching the girls is such a big inconvenience we will never ask y’all for help again” mind you they have never asked us for help they always just leave and expect grandma and grandpa to watch.   GMA and gpa are so scared to say something because they have taken the girls away before from there other grandparents when they lived with them bc they didn’t get there way.   AITA for saying something.  Ps. They are both managers at the place they work for and grandparents are 75 &amp;78 years old. This is also our first time saying something in the past 6/7 years, we do not live there and haven’t since they moved in.",
    "flair": "Asshole",
    "created_utc": 1761062425.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocguy7/aita_for_speaking_up/",
    "downs": 0,
    "ups": 15,
    "score": 15
  },
  {
    "post_id": "1ocgptj",
    "title": "AITA Significant other upset for not calling",
    "selftext": "So today I took my kids to get their shots, offered because alot of times my wife struggles to sleep. So she can sleepin a bit . This gives her time to get ready and once im done I meet her and she gets one of the kids and take to school and I take the other (divide and conquer). In the past I usually go to the cafeteria (Army hospital) after the shots to get food for lunch for myself and whatever the kids want. I usually call my wife to ask if she wants anything and every time she says no. Today I failed to call to ask and she goes off on me as to why I didnt call her to ask and that she would have wanted a sandwich. Now shes telling me cusing me out and dropping f bombs. I did apologize and admitted I failed to call her and she continued and to not call her for the rest of the day. Naturally I got upset too because here im focusing on trying to take care of the kids, I even offered to take one of the kids to school because she was going to take both (we both work and i was late in). I know im wrong to some extent but is she overreacting? Am I the asshole?",
    "flair": "Not the A-hole",
    "created_utc": 1761062099.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ocgptj/aita_significant_other_upset_for_not_calling/",
    "downs": 0,
    "ups": 0,
    "score": 0
  }
]