{"selftext": "So, I 21 F, am a university senior and so are those specific friends (three of then also 21 F, different department).  Almost a year ago i noticed that they wouldn't text in the gc if i didn't and they would take hours to respond, and this was a pattern. During the summer, not a single call, i was trying to keep the gc alive but it was in vain. Then, I got into a relationship with my best friend (21 M) and this got kinda busy. I was trying to balance work in a different town with no phone signal, my relationship, my declining mental health and all my friends including them. Today, after two weeks of me not sending anything nor searching for them, i met one of them randomly. She said something along the lines of \"We haven't seen you in forever\" and I said \"You didn't even look for me\" in a casual tone. I suggested we go get coffee since there was plenty of time till her class, but she said no. When i got home my phone was bombarded with texts. The two of them were texting in the gc. Saying things like \"It was very rude and unacceptable to say that\" referring to me saying \"you didn't even look for me\". They implied that i was badmouthing them, since they saw some irrelevant reposts on my tiktok, and that since I wasn't mentally well, should've talked to them about it. This kept on going for quite some time, till i felt dizzy and realised i was going to have a panic attack. I sat down and tried to relax. Right now im alright. My last message to them was \"If I say anything else, I'll repeat myself, so just tell me how you want to move on from here\". So, AITA?  Edit:  I just found out they have another gc. One of them posted a screenshot of it in their private story (they were talking about something completely irrelevant). I had a feeling that something like that was going on but I didn't think it was true.", "post_id": "1ok097e", "title": "AITA for not texting my friends?", "flair": "Not the A-hole", "created_utc": 1761832222, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ok097e/aita_for_not_texting_my_friends/", "downs": 0, "ups": 4, "score": 4}
{"selftext": "I (27m) have a boyfriend (24m) who has a boundary that partners should communicate everyday via text and calls. I don't have that boundary but I don't mind doing that.   Two days ago, I had to do what every pet owner dreads of doing and had to put down my 17 year old dog. My dog was everything she was the best dog that anyone could of asked for, even if sleeping in bed with her gave me bad back pain. After she had passed, I went home and texted my boyfriend that she had passed. He was empathetic and gave me his condolences, then told me that his childhood dog passed years ago so he knows how hard it is. After the conversation, I went to bed with a few tears and sadness.  The following day I got up and went about my morning routine. When I went to the kitchen to make breakfast, I saw that I forgot to clean my dog's food bowl. There was some food left in it from her last meal before she passed. I went to pick it up, however I paused and stared at the food. I think the realization that my little doggy was actually gone sunk in and I burst into uncontrollable tears. I'm not one to really cry, but I became inconsolable to the point I spent the day in bed crying. I'd get so drained that I'd sleep, then wake up just to cry again.   I didn't look at my phone until about 10pm because I saw that my boyfriend was calling me. I wiped my tears and answered the phone only to be told by my boyfriend that he was disappointed in me at the fact that I didn't message him back at all for the entire day.  Maybe it was the emotions, but I told him \"I can't do this right now\" and hung up. He later called back and apologized but sent a text that repeated why he was disappointed per his boundaries.   I'm more calm today, but I'm angry and confused. I can see where he is coming from because he is allowed to have boundaries in a relationship. And sending a text explaining that I would not be available to talk is simple enough to do. However I think the excuse of mourning is justified to not call, but I don't know.  AITA for not calling back for most of the day and then hanging up out of frustration?   I think I may be TA because at the end of the day, sending a text isn't difficult and I don't think it would have taken a long time to send one.", "post_id": "1ofcmto", "title": "AITA for hanging up out of frustration", "flair": "Not the A-hole", "created_utc": 1761348398, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ofcmto/aita_for_hanging_up_out_of_frustration/", "downs": 0, "ups": 23, "score": 23}
{"selftext": "AITA for going to a friend's house without calling first? For context I have 2 best friends that recently moved in together and we all went to highschool together and have been close for 12 years. In the past it was pretty normal for me and the other friend (Lexi) to show up to I'll say Ashley's house all the time unannounced. Well over the summer I got a new boyfriend after a divorce and the girls were both not wanting to meet him whatsoever and then during this time I had to move a town a way with him so for the summer about 3 months me and my friends got a little distant. In fact they went through my town together to go to a lake one town away from me and didn't even invite me nor did they come to my birthday float trip with my BF. So fast forward and my hours at work got cut and Ashley bought a new house and Lexi moved in with her. With this extra time not at work it was convenient to go to her house to do school work for a variety of reasons. I of course called every time with her also saying doors always unlocked. Well 2 days ago I showed up 30 minutes before Lexi got home and we hung out til I had to leave. Then yesterday morning I showed up didn't call and Ashley is in were work van I didn't notice but assume she's home cuz both cars are there. So I go to walk in and the doors locked. Confused I call Ashley and she says I'm in my van I said oh ok your doors locked and she says yeah I don't like you coming over without a call first. Ok fair enough but why not just say something? Why do this weird door locking scheme to prove a point. And I asked why not just call? I can't remember her response but I think she did a bait and switch with why didn't I just call and I was like well in the past it was fine and I guess I got too comfortable and didn't think it was a big deal and she responded with well we don't really hang out like that anymore. This whole situation really hurts my feelings, not because of the boundary of calling first but the way she went about it and then saying what she said not even considering the context of why we haven't spent much time together. Not even my fault I feel like. I asked my mom about the situation and she says that she thinks Ashley is trying to create distance until friendship ends which I don't want to believe. But I wonder did I deserve any of those actions that took place? Am I being dramatic with having hurt feelings? How can I even communicate with her these feelings I have and is it necessary? So am I an asshole for showing up unannounced? Or is she an asshole? Or neither or both?", "post_id": "1of2n5d", "title": "AITA for showing up at my friend's house unannounced?", "flair": "Asshole", "created_utc": 1761323954, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1of2n5d/aita_for_showing_up_at_my_friends_house/", "downs": 0, "ups": 0, "score": 0}
{"selftext": "One of my (im.a guy) best friends (also a guy) has been in a relationship for a few years now. We used to hang out a lot, gaming, trying new restaurants, and doing activities we both enjoyed. But since he started dating his girlfriend, things have changed a lot.  He lives really close to me, but we barely see each other anymore. He rarely texts first, sometimes going weeks without saying anything unless I reach out. When I do try to make plans, he usually says he’s busy,  and on the rare occasions he’s not, he only wants to hang out if his girlfriend can come too.  The thing is, the activities they plan are always based on what she wants to do, cafes, movies, outings that she enjoys. They’re not things I’m interested in, and they’re completely different from the stuff my friend and I used to bond over. It’s gotten to the point where, if I want to see him, I have to agree to spend time doing things I don’t enjoy, just to keep the friendship alive. It honestly feels more like a chore now than a friendship.  Recently, I told him I’d rather skip the group hangouts and that I’d love to have a proper guys’ night, just the two of us or with the other guys in the group catching up like before. He didn’t seem mad, but I could tell he was disappointed and since then he hasnt asked to hang out. I again suggested recently we catchup and once again he suggesed we do sth wjth his girlfriend to which i said no again, because at this point, I just want to feel like my friendship with him actually still exists on its own.  So, am I the asshole for saying no to group hangouts and wanting One-on-One time or a strictly guys hangout instead?", "post_id": "1oir2wy", "title": "AITA for Saying No to Hanging Out as a Group and Wanting a One-on-One Guys’ Night Instead?", "flair": "Not the A-hole", "created_utc": 1761699592, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oir2wy/aita_for_saying_no_to_hanging_out_as_a_group_and/", "downs": 0, "ups": 121, "score": 121}
{"selftext": "A friend I’ve had since high school and I (30M) have drifted over the past few years. She started spending a lot of time with a new group of friends, people I had some bad blood with and am not comfortable around. She knew that, and even though I told her it made me uncomfortable, she still got close with them. They play on a team together, travel, hang out, that kind of thing.  I told her how I felt, not giving an ultimatum or anything, but she kind of brushed it off. That’s when our friendship started to fade. I was upset at first, but eventually accepted it and moved on knowing our friendship had changed. We’re older now, have different interests, it happens.  She recently texted me that she got engaged while on a trip with those friends, and about a week later she asked if I wanted to be her “man of honor.” It came as a surprise since we hadn’t seen or talked in at least five months. I told her it really meant a lot, but I didn’t think I was the right person for that anymore and wouldn’t be comfortable. I honestly thought she’d understand.  She got upset, said it was hurtful, asked if I even wanted to come to the wedding (I said yes, of course), and called me cruel for saying no. I apologized for catching her off guard and told her I wasn’t trying to hurt her, just being honest. The conversation kept escalating, and eventually I told her that my best friend wouldn’t have gone out of their way to befriend people who hurt me, that I’ve felt like we hadn’t been close for a while, and that I was sorry it took her this long to notice.  I didn’t mean to start a fight. I just didn’t want to agree to something I didn’t feel good about. Now I’m not sure where we stand. I was fine just being friends, not best friends.  TL;DR: My old best friend asked me to be her man of honor even though we’ve drifted and she’s close with people I’ve had bad blood with. I said no, she called me cruel, and now we might not be friends. AITA?", "post_id": "1oewx0f", "title": "AITA for turning down being in my old best friend’s wedding?", "flair": "Not the A-hole", "created_utc": 1761310351, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oewx0f/aita_for_turning_down_being_in_my_old_best/", "downs": 0, "ups": 442, "score": 442}
