{"selftext": "I'm a 21-year-old on a competitive sports team. I placed 2nd in our tryout tournament, where most players were either brand new or unfamiliar with the rules. I’ve been playing for years and trained hard for this opportunity, with daily drills, family scrimmages, and coached classes, and I was proud of how I performed.  Now comes the issue: there is another girl on the team, one who is close to my skill level and who is pretty popular amongst the \"sweats\" of our club (She is also friends with an officer who has been trying to create a secret comp team behind the president's knowledge, she is involved). I've been told (unwarranted) how much better she is than me or just that she is better than me in general by my close friends and bf. She earned 5th place.  Recently, the president and vice president, both of whom are my close friends, were talking about how partners would work. I assumed it would be based on placement of the tournament, but was then told that the tournament didn't actually matter, and people would pick their partner based on who THEY wanted. This left me with one option, because the first-place player and the 5th girl would be choosing each other (They are good friends), but this also meant I would get a partner pretty far from my skill level. I tried to mention that this seemed like a bit of an unfair idea because it was very clear that, even though I had gotten second place, I would now be on the C team, whereas the 5th place player would now be on the A team.   I just wanted to vent my feelings. However, thinking about it more now, I won't be able to enjoy the sport if I have to constantly cover for my teammate, who might be someone who has only played for a few weeks. I know this may seem a bit selfish to say and assume, but this is truly how I feel; competitive sports for me are not about having fun, they are about winning. If I have to exhaust myself covering for a player I cannot trust to hold their own when I am playing outside my skill level, I will not be able to enjoy the game. I am not a perfect player by far, and I have A LOT to work on, but I also will not water down what abilities I have worked for.  I recently brought up to my bf that if this team continues to bring up negative feelings as it does now, I will be stepping away. I let him know that by no means would it be his fault or how it was run, but simply because of the situation I unfortunately landed in. He knows very well how I view sports, because I can become overly competitive (Which I am working on), and having to get a partner that is not going to be able to perform at my skill level will not be great for my game mentality. I want the other person to be able to have fun, and I know myself enough to understand that I have a chance of ruining that for them.  Edit: This is about pickleball! This team would represent the University I attend. I know it’s a family sport and something for fun, but I tend to be this hardcore in any sport I play. I also forgot to mention my boyfriend is the president of the club! I have brought other feelings up to just vent to him but he’s taken offense that’s why I’m iffy on this.", "post_id": "1ofd769", "title": "AITA If I Dropped My Competitive Team because of How They Chose Partners?", "flair": "Not the A-hole", "created_utc": 1761350030, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ofd769/aita_if_i_dropped_my_competitive_team_because_of/", "downs": 0, "ups": 0, "score": 0}
{"selftext": "During the school season, I was in a soccer club team with all of my best friends. We've been on this team since last year, with the same coaches and teammates. Throughout the season, our one coach Rebecca has been kind of off from the start with me specifically. Flashback to a year ago, I tried out for a higher club division in the summer and I ended up not making it despite having similar athleticism, skill, and positivity as others who made it - Rebecca was coaching that team that year. It obviously was devastating since soccer means a lot to me and I really wanted to make that team but this didn't mean I was putting others who made it down or talking negatively in any sort about the people involved in the situation.   So when this year's season started, I already had let go of the summer and what had happened, and was playing with a good mindset and positivity. I was cheering others on the best I could, being polite to all coaches including Rebecca, and pushing myself at every practice and tournament. However, I could already sense Rebecca didn't really like me as much as the other people on my team or that something was off but I didn't understand why because I've never done anything to her that past year (turns out I was right). My coach also tends to be on the harsher side and visibly had favourites last year and they aren't on the team this year. Another issue we had this season was the fact that there was a mix-up about who captains were. Long-story short, it was originally me, and my other friend but it got switched arbitrarily to other people, as coaches don't really care about who captains are as long as there are three. That also caused a bit of drama which will be relevant later on.   One tournament day, all four of us \"captains\" were going to go talk to the other team's captains but Rebecca gave a bit of a dismissive opinion that only two of us should go. I understand more than two captains is a bit absurd, but I felt like I couldn't have a say in who should go and what. After the game, I went to my friends and shared how I felt about how Rebecca worded things and how it felt a bit harsh and unnecessary. I wasn't aware that Rebecca overheard our conversation and next practice it became a rule that no captains were allowed anymore. I talked to the coaches about it and their reasoning made sense but I felt that there was no value in doing that because it just made team tension worse. One other coach fully understood how me and my friends felt, and agreed that it might have been overboard. AITA for how things turned out? AITA for just stating my opinion on something with my close friends?", "post_id": "1odr3g1", "title": "AITA for talking behind my coach's back while she was near?", "flair": "Not the A-hole", "created_utc": 1761184690, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odr3g1/aita_for_talking_behind_my_coachs_back_while_she/", "downs": 0, "ups": 2, "score": 2}
{"selftext": "This week I went on a trip to Europe, where I first visited my family in one country,  and then went to my friend in another country, where he was living as a refugee.  While visiting the first country, I bought some alcohol in the first country as it was cheaper there. As I was shopping, I called him and asked what he wanted. We both agreed on the type, and he then said that we would figure out how to split the cost. (Although I have to say that I don't remember the exact wording of the remark, but it for sure mentioned dealing with the expense).   I spent 5 days living at his and his family apartment, visiting different places nearby with the said friend and had a good time there. There were no conflicts during that time. They shared their food with me, and I did the same with the food I bought. After that, I went back to the first country and remembered that we left the matter of the bought alcohol unfinished; he did not mention anything about it during my stay. I then requested that he pay for his half of only the hard liquor that I bought (I also brought some beer, but that was a souvenir and a gift from me). I also need to mention that his financial situation is tight now, being a refugee and not having a job at the moment. I added that he can pay when it is convenient for him and not pushing for immediate pay.   After that, he hit me with the wall of text about how I am being ungrateful to him, that he gave me a place to sleep, to shower, shared food, spent time and money on traveling with me. That he is in shock with my request and is now beginning to think that I was just a freeloader there and did not value his hospitality. That he thought that I might ask him for reimbursement, but hoped that he was mistaken and I wouldn't dare to do that, as it in his words, puts an end to the friendship. After that, he decided to count all the money he spent on my stay, including rent for living in his flat, sharing their food with me and other expenses as a way to compare my request for reimbursement and, in his words, \"give a cold shower\".  I then told him that he is overreacting to all of this and tried to appeal to his own words that we were to deal with this issue later together. I also told him that I was, in fact, grateful for his hospitality and apologized if I offended him. He also then said that I was insensitive and did not read the mood properly, and that his reaction was natural. I said that we can forget about this reimbursement, as for me it wasn't worth the whole friendship, and if he were to ask beforehand not to pay for it  I wouldn't mind. I also added some explanation as to why I asked for reimbursement based on my experience in similar situations. He discarded all of it, stating that this is not about the money and that I am just looking for excuses for my ungrateful behavior, and that I should make conclusions from my bad behavior. He seemed to cool of a bit by the end of the conversation, but still bitter.  So am I the asshole?", "post_id": "1ogvb2z", "title": "AITA for asking my friend for reimbursement after he let me stay at his home for a week", "flair": "Asshole", "created_utc": 1761511134, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ogvb2z/aita_for_asking_my_friend_for_reimbursement_after/", "downs": 0, "ups": 622, "score": 622}
{"selftext": "I am trying to join a student NGO that my roommate has been a part of for two years and already became a specialist/higher-up.  In order to join I have to go through multiple phases. First there was a group interview. I asked what will it be about, and he didn't tell me anything. After that there would be an individual interview. Again, I asked him to maybe give me a hint as to what the questions will be, and he refused to tell me anything, simply saying \"You'll pass, don't worry too much\".   He was right, I did pass, but after that, there was some sort of \"examination period\" where I have to do a bunch of tasks together with a team of other people that want to join as well. This required constant meetings, discussions, calls with superiors, and all sorts of gatherings. I am really anxious around groups of people I don't know, so the first meetings made me really uncomfortable.  I have asked him to help me with those, since he already joined by doing the exact same tasks two years ago, but he won't, simply due to the principle that I \"have to do it by myself\" and so on.  I told him that this literally doesn't cost him anything, and that I would really need some help since I have matters at Uni I need to attend to, and I also deal with severe anxiety.  He still refused to even tell me a single word/hint. Again, I did not ask him to make my task, or tell me how to do it step by step. Just a little help here and there, so I am not forced to get in these situations. He told me the reason why he won't tell me is because I have to get over my anxiety and meet new people (pretty ignorant comment because it's not that easy but still).  Anyways, one day I asked him to work on his laptop, and he agreed, since my MS Word doesn't work for some reason. While working, he received a bunch of documents on Whatsapp from another member in the organization. I went through them, and found  all of the current (and future) tasks, a mock detailed solution, multiple methods, etc.  Before you guys say that this could get him in trouble, it wouldn't. He is in a pretty high position and is well respected there, so this wouldn't affect him. I also didn't copy anything word by word, just used it as a model in order to do my tasks without needing to interact with my team too much.  Anyways, while celebrating with him, my other roommate, and my gf, I told him about my secret and he got really mad. AITA?", "post_id": "1omjpjz", "title": "AITA for using my friend's laptop to get insider knowledge?", "flair": "Asshole", "created_utc": 1762096174, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1omjpjz/aita_for_using_my_friends_laptop_to_get_insider/", "downs": 0, "ups": 0, "score": 0}
{"selftext": "So a friend invited me to a quiz night last night with a group. First interaction was them asking if i wanted to go to a quiz night with her and some other friends, I said yes if you send me the date and time and I'm around. I'm a fair bit younger than anyone else who was planning to go, only 2 blokes going (one me) and a number of women - but I've doen things with them a lot. It's left, I dont hear anything. A few weeks later I see them and 2 others from the group. It's asked who's going to the friend, my names mentioned, I say I haven't said yes yet as I don't know the date, they say the date, I say okay cool, thanks. The day of the quiz - I see one of them that day and she says oh I'm looking forward tk going tk the quiz with you later etc. I say oh nice etc. The friend says oh yes her 2 daughters are coming - then a few mins later I ask the time that evening. She says \"we would ofc love to have you but I'm not sure if the 2 daughters are coming ....\". The other friend sorta goes quiet and looks a bit awkward. She still wasn't sure if they were even going to go on the day of it. Initially only one was maybe coming and other was meant to be busy. They go do something, I leave fairly quickly. Then at 5pm, the thing is happening at 7:15. I've assumed I won't be going as I don't see why I should be kept on tender hooks if their family are going instead, it's restricted to 8 people per team. I get a message saying \"daughters are coming and now this other ladies daughter is coming so we will make use of your brains next time\". This other person was never going or expressed interest in going, I'd said yes so I'm a bit pissed off. I havent replied to the above message and they sent something today and ive not bothered to respond. Am I being reasonable or am i being socially inept? I have been close friends with her and her family. I replaced myself (got someone else to stand in) for another event that was organised with her now as I don't really feel that she's been reasonable by inviting and then uninviting. Aware this might be a dick move.", "post_id": "1ohacew", "title": "AITA uninvited from quiz night", "flair": "Not the A-hole", "created_utc": 1761559174, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ohacew/aita_uninvited_from_quiz_night/", "downs": 0, "ups": 5, "score": 5}
