{
  "NTA": [
    "NTA. It is absolutely unfair of your roommate to invite R and J back to the apartment without asking you beforehand, especially since she KNEW about your feelings and you two had already established a boundary. If I were you, I would skip the party (if possible) or send her some kind of message that lets her know this is a breach of trust.",
    "NTA. Tell the others. And, honestly? I would either cancel the party or let them come and if they started anything, tell them to leave or call them out.   But this should be a group decision.",
    "NTA , go stay in a hotel for the night or at a friend's, so its clear you are not ok with this and will remove yourself from the situation.  It forces the sister and your bf to have to decide if having that \"friend\" over is more important then having you there. Leave the decision up to them , take yourself out of blame for not wanting him there amd simply remove yourself everytime he comes over .bet they stop inviting him",
    "Since she has now invited them, sit down as a group (or even a wider friend group) and decide on a list of specific behaviours that will get him kicked out   Nta",
    "Abusers rarely change.",
    "NTA-- You need to become very assertive in this situation. While I do think people have the ability to change and like to give the benefit of the doubt when I can, what you described seems like a pattern of behavior that a few months cannot fix.   That being said, I want to hear about their behavior at this upcoming party. Please update us. But I suggest that AT the upcoming party, the second J steps over any sort of line (bigoted comments, abusive language or behavior to his partner) CALL HIM OUT PUBLICLY in the group. You can say, \"Roommate has been pleading your case and saying you have changed but clearly she was incorrect and until you do, you will not be welcome here.\" Then invite him to leave. (talk to your bf about this strategy beforehand to make sure he is willing to back you up, or take the lead in case he is the one who witnesses J's bad behavior)  You have a right to feel safe in your own home. This isn't actually a situation where you need to have a unanimous vote. J makes you feel unsafe. Your roommate can have any relationship she wants with both R and J outside of your shared living space. But when it comes to who you invite into your space each roommate should have veto power when they feel unsafe.",
    "NTA"
  ],
  "INFO": [
    "repost of **very tired tropes**. a couple days ago it was the friend who wantedd to bring the dude of the hour along on a girls' night out on halloween."
  ],
  "selftext": "I (27F) live with my boyfriend (25M) and his sister (27F) who is also one of my good friends. I will refer to my boyfriend's sister as my roomate throughout this post, but I wanted to be clear that our lives are more intertwined than your average roomates. We frequently have friends come over and host parties, and the vibes are good, EXCEPT... when my roomate's best friend's fiance comes around. I will refer to my roomate's best friend as R and her best friend's fiance as J.  J has been a source of discomfort in the friend group since he started dating R. He has shown many times that he holds bigoted beliefs and he is emotionally abusive to R, who we care about. Not only that, but R and J constantly argue, even at these gatherings where we're all trying to have fun. After months of this, it began to reach a point where all our friend group talked about was how much they hated J, mostly because my roomate kept bringing it up in conversation. Even at parties, most of our friends were eavesdropping on their arguments or complaining about how terrible J was to R, and nobody was having any fun. Yet, my roomate wasn't willing to stop inviting R and J to parties because she was worried R would be isolated.  While I understand, I have been in an abusive relationship before, and was not only very triggered by J, but also sick of how my roomate's enabling was affecting everyone. I set a boundary and said I did not want J coming to our parties anymore, and everyone agreed. My roomate didn't agree, but respected is and told R that J was no longer welcome.  R then got angry at everyone for not \"talking to her\" about it, expressing no care about how uncomfortable they had made everyone. Since then, they have not been in attendance at group gatherings, and while we were sad that R chose J over us, we understood. Since then, things have been fine.  It's been a few months, and my roomate has been repeatedly bringing up how J \"took it to heart and has changed\". I don't believe that anyone is capable of changing their whole personality and belief system in a year, never mind a few months, and have expressed my skepticism. Recently, my roomate and my boyfriend were both talking about this, and my roomate mentioned that she had invited R and J to our upcoming party.   I didn't say anything at the time (my bad, I know) but I saw this as a boundary violation, and was pissed that my roomate had not asked us how we felt about inviting R and J beforehand when we had already made it clear that J was NOT welcome. It took me awhile to talk to my roomate about it because she gets very sad when she is confronted with anything, and I find her reaction to be triggering (OCD + guilt = bad combo), but once I worked up the courage, she just kept insisting that it wasn't fair for me to make blanket judgements, that I should \"give him a chance\" and that J has changed. She is not willing to reinstate the boundary we all agreed upon. AITA?",
  "post_id": "1odnx8i",
  "title": "AITA for telling my roomate that her best friend's fiance is not invited to our parties?",
  "flair": "Not the A-hole",
  "created_utc": 1761175692,
  "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odnx8i/aita_for_telling_my_roomate_that_her_best_friends/",
  "downs": 0,
  "ups": 43,
  "score": 43
}