{"selftext": "I am (34M), my mum (54F). I will try and keep this as short as possible.    Moved out of my parents house 10 years ago, had to move to a city a bit away from the village I grew up in for work as jobs were hard to find. I would go back and visit once every 2 weeks which was 4 hours total traveling by public transport, we would also have weekly phone calls. In this time my Mum never came to see me outside of the first week I moved. She visits my sister at least once a month. She said it was the travel time which was the issue. She would constantly give me reasons to move back to the village. 'we could nip round for a cuppa.' 'We could have Sunday dinner together most weekends.' ' I could watch your cats so you could travel more.' and to be honest I wanted to move back anyway because the majority of my friends, all my family etc. live there. I have a good relationship but don't live with my partner, so that wasn't a factor.    I worked hard, saved up money, started my own business and now for the last 6 months have lived back in the village in a nice cottage by the river. Perfection for me.     However, my Mum has declined every invitation to my house, while still visiting my siblings. Every time I have asked if she is free to pop over or for me to go for Sunday dinner I have been told no. I have the chance (nothing booked yet) to go see my partners family in the Americas middle of next year, asked my Mum if she could watch the cats and she blew up saying I shouldn't have a cat if I can't be responsible for it and that I shouldn't expect others help looking after them. She has looked after my sister's cat 4 times this year.     I sat down with her (to be honest I just showed up at her house uninvited to get her attention) and brought this all up, saying I felt forgotten and disrespected.  She told me I am a grown man and shouldn't make her feel bad because she is prioritising my younger siblings, because they need more help (31 and 24 for context, both married, no kids, good jobs). The only thing I can think is that she is jealous that I bought the cottage she always loved when we were kids, but one of the reasons I bought it was because she always loved it and so she could spend time there. Especially the garden by the river. We grew up poor and never thought we would be successful enough to own a place like that.   Am I the asshole for bringing this up?", "post_id": "1odzkxe", "title": "AITA for being frustrated with my Mum as an adult", "flair": "Not the A-hole", "created_utc": 1761214872, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1odzkxe/aita_for_being_frustrated_with_my_mum_as_an_adult/", "downs": 0, "ups": 68, "score": 68}
{"selftext": "I (F19) am at home with my mom (48). There are people over and for the time-being, they are staying in my room and I've basically been hopping between staying in the living room and my mother's room. They're out as I type this and I wanted to go there to just sit in my bed and do nothing special in particular, basically just being on my phone. But my mother told me not to stay there because I might tamper with their things which I think is weird since I literally don't plan to do anything that would disrupt anything in that room. If the people staying with us showed up, I was willing to bounce anyway and the thing is that I know these people would be fine with me staying there because like... I did that before once when they were here and my mom wasn't here and they didn't care when they saw me in there.     Anyway, when my mom said I wasn't allowed in the room, I basically went \"Oh, that sucks!\" jokingly in our language (I don't know how to translate it but it's just as lighthearted as it seems), which is something I say a lot anyway. I was seriously more than willing to just go to the living room instead or something because again, I wasn't doing anything too important. But she took it really seriously and got angry at me, telling me that I'm speaking extremely disrespectful to her and that I don't respect other people's privacy... when there's other people staying in my room?! I didn't even reply anymore, I just let her lecture me in silence because she kind of just went on and on. Then she proceeds to slam the door on me and she's giving me the silent treatment and shit. Am I the asshole?", "post_id": "1oi3851", "title": "AITA for wanting to sit around in my own room?", "flair": "Not the A-hole", "created_utc": 1761637265, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oi3851/aita_for_wanting_to_sit_around_in_my_own_room/", "downs": 0, "ups": 23, "score": 23}
{"selftext": "My name is mark , 26 years old , I finally got my own apartment last year after saving for years. It’s a small one-bedroom place, nothing fancy, but it’s mine and it’s the first time I’ve ever really had privacy. My mom , she is 52 years old recently broke up with her boyfriend and had to move out of his house. She called me crying, saying she didn’t have anywhere to go and asked if she could stay for a few weeks. Of course, I said yes, she’s my mom. But it’s been four months. She hasn’t looked for a new place, doesn’t help with groceries, and has started treating my apartment like it’s hers. She rearranged my furniture, keeps commenting on my food choices, and even tried to throw away some of my stuff because it looked old. I’ve gently brought it up a few times, but every time I do, she gets emotional and says things like, “Wow, after all I did for you, now you’re kicking me out?” or “You’d let your own mother be homeless?” Last week, she invited two of her friends over while I was at work without even asking. I came home to people sitting on my couch drinking wine. That’s when I told her we needed to set a deadline for her to move out. She cried and said I’ve changed and that she can’t believe how cold I’ve become. My sister thinks I’m being heartless, but she lives two hours away and isn’t offering to take Mom in either. I love my mom, but I just can’t live like this anymore. I’m starting to feel like a guest in my own home. AITA for asking my mom to move out even though she says she has nowhere to go?", "post_id": "1ongyz7", "title": "AITA for refusing to let my mom move in with me even though she says she has nowhere else to go?", "flair": "Not the A-hole", "created_utc": 1762188633, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ongyz7/aita_for_refusing_to_let_my_mom_move_in_with_me/", "downs": 0, "ups": 2895, "score": 2895}
{"selftext": "I (18f) have just come back home from college for the week, and only have 4 days before I have to go back. I haven’t seen my mom or home for 2 months and want to spend what time I have at my childhood home. My parents are divorced, and my dad has his own kids.   I am visiting him for one day, but he wants me to go in the evening on another day to babysit, because he wants to take his gf out for dinner. I technically have nothing to do that night, but it means I have to travel across the city to sit on my own on an evening I could spend with family and friends if I want to. I love my half siblings, but I don’t want to be used for my dads poor planning.      he has now called me selfish for not wanting to ‘spend time with my family’, even though I’d be alone most of the night because they are very young. Also, as a note, he does have a babysitter, but doesn’t want to spend the money. Does this make me an asshole? Especially seeing as I have no concrete plans? I do become a bit of a pushover with my dad, and am trying to do more things for myself, but maybe this is me being selfish?", "post_id": "1oi7e6o", "title": "AITA for not wanting to babysit my siblings?", "flair": "Not the A-hole", "created_utc": 1761652785, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oi7e6o/aita_for_not_wanting_to_babysit_my_siblings/", "downs": 0, "ups": 607, "score": 607}
{"selftext": "Hi, i'm a 20 year old female i'm in college and I live with my parents. Recently I've been having a lot of conflicts with my mother and I don't know how to communicate with her. A couple times I was threatened to be kicked out of the house(3 times now), and out of all those times it was due to me either worried about a trip, not taking her a certain time out for her birthday, and getting mad at her for comparing me to my aunt.   As of late i've been getting  tired of her using manipulative tactics where she says she gives me everything or she sacrifice everything for me and my siblings. A lot of the time i can't get a word in or even communicate to her. I have started  seeing a counselor as of late to try and find a way to talk to her. But a lot of the time with my mom I feel trapped and isolated. I always try and seek  validation from her when I know i shouldn't.   I'm trying to finish college as fast as I can so I can move in with my boyfriend who I've been dating over a year now. Ive known him for a long time he's been my best friend for 3 years and i love him so very much we are long distance.He's been seeing how my mom treats me along with my friends and they find it absurd. A lot of the time I don't feel supported or at least listened to. I'm having a lot of thoughts of wanting to cut ties with her once i'm done with college, its getting a bit much when she keeps threatening to take everything i've worked for.    A lot of the time she would tell me that she payed for my car or gets me stuff in order to win the argument, then turn around saying she wont do it anymore. She does the whole thing where she would give you stuff and then use it like its blackmail that I owe her something which always make me feel like a dick. She always calls me the b word or even insults me and then tells me to leave the house and never come back she even told me \"I don't care if you end up being a stripper for all i care\". I'm overall confused and just mind boggled... and tired.   I have my own problems to deal with and this just adds the cherry on top. Before anyone says anything I do love my mom and i'm not just saying that, she will always be my mom and we will always be two different people. I never had a healthy relationship with her to begin with even when I was young and dealing with a whole lot of mental health issues where she blamed herself for.   What i mean by this is she went to therapy because of me cause when i was in elementary i was dealing with extreme anxiety, ADHD , pica, and trichotillomania. Everytime she tells me that i feel like the asshole where im the reason why my mom is in therapy. There's a lot more she's done to me and i'm happy to tell more if anyone else asks but again am i the asshole", "post_id": "1onusug", "title": "AITA For getting mad at my mom about how she treats me", "flair": "Not the A-hole", "created_utc": 1762220742, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1onusug/aita_for_getting_mad_at_my_mom_about_how_she/", "downs": 0, "ups": 0, "score": 0}
