{"selftext": "I have a long time friend who has struggled  financially  for, well, forever. Background:I've always  been an empathetic  person, and I'm Not rich- but I've always had a strong work ethic,I budget, make ends meet, and try to save a bit to support my family. My friend has been on govt assistance for the majority  of our lives with her children and hasnt worked in atleast 17years. I have always just given her money- 20 here,50 there,100,bought tires for her car,stuff for her kids,etc.  About 3 months ago, I had saved up and spent thousands to drive across the country and bring her and 2 of her adult  children into to my home, in an effort to raise her some $ to get her  out of the hole she seems to forever be in. At the very least, make some memories  and give her some hope.  My goal was to work extra hard, pay her to babysit and raise her atleast $1000 to go home with. I exceeded  that goal, and raised her $1800 in a month. It was a costly endeavor  on my part, I almost completely  depleted  my savings paying for Everything, but I felt it was worth it. That is until she told me a few days before her return back, she had no $. I paid her through an app,and paid for literally  everything  while she was here, including  her trip home. She was asking me for $ the day after she left, and has continued to since. Thing is, I feel bad now because  she is in a hard place as always,but with the shut down she is desperate. But I cant really give anymore, and I am now recieving the cold shoulder. Aitah for not helping financially when she is starving?", "post_id": "1oh49p6", "title": "AITAH for not giving my friend money?", "flair": "Not the A-hole", "created_utc": 1761535877, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oh49p6/aitah_for_not_giving_my_friend_money/", "downs": 0, "ups": 6, "score": 6}
{"selftext": "F20 i, still live with my mother and step dad. I am currently in college and i do have a job that i go to on weekends and days when i finish college early.  I make enough to survive on my necessity and necessity for my hedgehog , that i took in and decided to take care of it myself. I make usually around minimum wage or even less as a student but its enough. Not enough tho for me to have my own home. I also have a brother 18M who moved out right away to his girlfriend house. He doesnt have a job yet and lives off what they can scrap up from past jobs. Week ago my brother called my mother asking her for 100$. Of course my mother , who would do anything for her child , she does , but instead of them buying groceries or necessities , they add that money for the new electric \"skiro\". She didnt mind tho , she only added that he has to return the money when available to do so.this month i didnt get payed myself , beacuse the company and student workforce company had complications through system and money was unable to transfer through so they asked me to wait till next month. I had some saved money so i didnt complain. But now after paying half of my shared bills, food and animals care i am completly out. Last night i asked her if she can lend me 20$. You know for my hedghog and so i could have 5$ for emergencies in college. She started huffing and complaining about it , making a whole deal about it like i asked her for 200$ instead of 20. I nicely explained how am completly without any , and my hedgehog still needs food and wooden palletes for his cage. And that in two weeks ill return whole 20$..she didnt listen , throwing a fit and telling me \"you are old enough to survive on your own and if you need money then go start asking for in the streets\". I was hurt , and i got pissed. I told her how many times i lend her money so she could go to mountains and drink or buy herself clothes. How many times i had to take care of her  , necessary or not and sometimes she didnt even returned it. I told her it was unfair that she could still lend that much to my brother while she cant even lend me 20 for necessaties. I barely ever asked for money. And i always returned it. We got into a huge fight through , and i yelled , talking about her drinking problems in the past and how i had to take care of her as a kid , how many times i was quiet when she met another man behind my step dads back. How she always prioritized my brother over me. She was hurt by this truth and i felt bad for yelling at my own mother but am i the AITA??", "post_id": "1oert2s", "title": "AITA for speaking out at my mother?", "flair": "Not the A-hole", "created_utc": 1761292682, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1oert2s/aita_for_speaking_out_at_my_mother/", "downs": 0, "ups": 11, "score": 11}
{"selftext": "I (17F) am still in high school and live in an area where it’s really hard to get a job. I don’t have a car because there’s no money for driving school.  Recently, my mom (37) told me she’s not going to buy food anymore because “we’re all grown” and everyone has to buy their own food. This started after she asked my brother (19), who works and also gets to use her car to get to work, to give her $100 to buy food since we rely on SNAP and the government shut it down. He refused, so she decided she’s not buying food for anyone and that everyone has to fend for themselves.  I completely lost it when she told me this and said, “Why did you even have kids? Why have kids if you’re poor and just end up regretting them?” She always talks about how we ruined her life, so I just snapped. I asked why, at 17, broke and having to take care of her own family, she decided to have kids anyway. Kids that she trauma dumps on every chance she gets. She always lets my brother have his way and then gets mad at the rest of us.   In the heat of the argument, I also told her that if she really didn’t want us, she should’ve just aborted us or never had us in the first place. I said that if she really wanted to punish someone, it should be my brother, since he’s the one who refused to help in the first place. She went on to say, “ I should have” “You guys are grown. I already raised you. I already raised you.”   I know what I said was rude and disrespectful, but it’s just so hard not to be when I’m this angry and hurt.  [ EDIT: MY MOM AND I SPOKE AGAIN ABOUT THE MATTER. SHE SAID THAT SHE WAS JUST STRESSED AND THAT SHE ACTUALLY DIDNT MEAN IT. SHE FOUND SOME HELP WITH OUR FOOD SITUATION FOR NOW AND I TOLD HER ABOUT THE FOOD BANKS]", "post_id": "1omocby", "title": "AITA for telling my mom why she had kids?", "flair": "Not the A-hole", "created_utc": 1762106891, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1omocby/aita_for_telling_my_mom_why_she_had_kids/", "downs": 0, "ups": 9252, "score": 9252}
{"selftext": "My name is mark , 26 years old , I finally got my own apartment last year after saving for years. It’s a small one-bedroom place, nothing fancy, but it’s mine and it’s the first time I’ve ever really had privacy. My mom , she is 52 years old recently broke up with her boyfriend and had to move out of his house. She called me crying, saying she didn’t have anywhere to go and asked if she could stay for a few weeks. Of course, I said yes, she’s my mom. But it’s been four months. She hasn’t looked for a new place, doesn’t help with groceries, and has started treating my apartment like it’s hers. She rearranged my furniture, keeps commenting on my food choices, and even tried to throw away some of my stuff because it looked old. I’ve gently brought it up a few times, but every time I do, she gets emotional and says things like, “Wow, after all I did for you, now you’re kicking me out?” or “You’d let your own mother be homeless?” Last week, she invited two of her friends over while I was at work without even asking. I came home to people sitting on my couch drinking wine. That’s when I told her we needed to set a deadline for her to move out. She cried and said I’ve changed and that she can’t believe how cold I’ve become. My sister thinks I’m being heartless, but she lives two hours away and isn’t offering to take Mom in either. I love my mom, but I just can’t live like this anymore. I’m starting to feel like a guest in my own home. AITA for asking my mom to move out even though she says she has nowhere to go?", "post_id": "1ongyz7", "title": "AITA for refusing to let my mom move in with me even though she says she has nowhere else to go?", "flair": "Not the A-hole", "created_utc": 1762188633, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ongyz7/aita_for_refusing_to_let_my_mom_move_in_with_me/", "downs": 0, "ups": 2895, "score": 2895}
{"selftext": "I (22F) let my best friend move in with me and my mom almost a year ago. She didn’t have the best upbringing and her parents never taught her to drive or really do anything, so we let her move in (rent free) so she could get a stable job and get a car. Since moving in she got a job pretty quickly at Panera bread, but she barely gets any pay or hours. My agreement with my mom when she moved in was that my friend would mostly be self sufficient, taking public transit or uber and we give her rides when we can until she gets a car. This is because my mom and I both work full time.  Lately i’ve been feeling a bit resentful towards her because of her lack of progress since moving here and I feel as though an expectation is always placed on me to give her a ride if i’m at home. These past few months we’ve really been stressing to her that she needs to find a job other than Panera, although she’s already saved up a couple thousand, she needs to get a job where she can pay for a car and other things like insurance. She acts as though she wants to find a better job, but i feel like she could definitely be putting a little more effort in. She says she’s calling places but I don’t know if it’s true. She seems complacent with where she’s working now most of the time.  But the thing that bothers me the most is that I pretty much have become responsible for giving her rides most of the time. She stopped taking public transport early on because she said the homeless people would bother her which i get, and ubers can be expensive. But i work 6 days a week and my one day off pretty much consists of making sure she gets to and from work. and i always have to get up extra early on the days i do work to take her. My mom doesn’t get to help out much because she goes to work at 5. She used to ride with my mom some mornings when she’d go in early but now she’s completely been depending on me.  Also my resentment has come from how she’s treated me lately when i tried to lay a boundary down. One morning she had to go in at 7 and she had previously asked me to take her, but that night i realized how physically exhausted I was and I needed one day where i didn’t have to get up early so I asked if she could ride with my mom the next morning and wait, she got passive aggressive, and then went in her room and slammed the door. Then two days ago i picked her up from work after I got off and she asked me to take her to goodwill. I said “i’m really tired right now can i take you tomorrow?” and she said “it’s fine” and got snippy again. I asked her why she was acting that way and she said “I feel like i have to force you to take me places” I told her that wasn’t true i just didn’t feel like it at the time. I genuinely just feel like being depended on so much for a whole year has made me really resentful and i don’t want to hang with her at all most of the time.", "post_id": "1ooiw3p", "title": "AITA for not wanting to drive my friend around anymore?", "flair": "Not the A-hole", "created_utc": 1762289393, "url": "https://www.reddit.com/r/AmItheAsshole/comments/1ooiw3p/aita_for_not_wanting_to_drive_my_friend_around/", "downs": 0, "ups": 1, "score": 1}
